

//  this code snippit demonstrates the overloaded "+"  feature to be used for enhancing the below cypher script. 
//  looks like dummy parameters are needed for when ii.N involves evaluates of 2,1


MATCH (:class1)-->(c1:class2)-->(:class3)--(:class4)-->(c2:class2)
WITH collect(c1)+collect(c2) as nodez
UNWIND nodez as c
RETURN c










I use LyX - The Document Processor, w

MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="4" AND t.twoSeq=4
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors


//  The following MATCH is constrained by ii.N's value.
//  Want the constraint to be whenever (ee:Evaluate {Value:targetFactors.T})


MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="2"
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END}]
      as argumentFactors,targetFactors



UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF


WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output

╒══════════╕
│"output"  │
╞══════════╡
│[2,159.0] │
├──────────┤
│[1,-782.0]│
├──────────┤
│[3,-14.5] │
├──────────┤
│[0,1456.0]│
├──────────┤
│[4,0.5]   │
└──────────┘


Time out, need a narrative:

   
MATCH (n:VertexNode) RETURN n LIMIT 25

╒══════════════════════════════════════════════════╕
│"n"                                               │
╞══════════════════════════════════════════════════╡
│{"Vertex":"0 42 0 0 0","Degree":"0","Scalar":"42"}│
├──────────────────────────────────────────────────┤

MATCH (n:IndexedBy) RETURN n LIMIT 25

╒══════════════════════════════════════╕
│"n"                                   │
╞══════════════════════════════════════╡
│{"RowCounter":"-1","N":"5","MaxN":"8"}│
├──────────────────────────────────────┤

MATCH (n:Evaluate) RETURN n LIMIT 25


╒══════════════════════════════════════════════════════════════════════╕
│"n"                                                                   │
╞══════════════════════════════════════════════════════════════════════╡
│{"size":32,"d":"32","nBinary":"[1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,│
│ 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1]","Value":"42│
│94967295","centerIndex":0,"n":"1","verticalTranslateIndex":0}         │
├──────────────────────────────────────────────────────────────────────┤

MATCH (n:TwoSeqFactor) RETURN n LIMIT 25


╒═════════════╕
│"n"          │
╞═════════════╡
│{"twoSeq":1} │
├─────────────┤




MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="4" AND t.twoSeq=4
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors

MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="2"
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END}]
      as argumentFactors,targetFactors

UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output                                                [{map}]    argumentF
Return output

╒══════════╕
│"output"  │
╞══════════╡│[2,159.0] │────────┤│[1,-782.0]│├──────────┤│[3,-14.5] │├──────────┤│[0,1456.0]│├──────────┤│[4,0.5]   │└──────────┘

targetFactors has rows of collected {(degree,scalars,twoS)} where each row's twoS patterns argumentFactors' map.
ArgumentFactors has rows of collected {(degree,scalars,twoS)} maps.
Each row's collected maps represent a targetFactor's substutible twoSeq value. 
targetFactors must stay as rows until after the second match pattern.
Suppose the rows can be wrapped into a list after second match.
Important: targetFactors, argumentFactors have the same number of rows.

The attempt:
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct

The change is targetF.Degree,argumentF are originally unwound argumentfactors,targetfactors.
but can be simply edited to the former. not.

maybe collect(argumentFactors) for, in this case, a list of two lists with each of the latter lists composed of a set of verticies including relevant twoS'.
      collect(targetFacotrs)                      a list of two lists                                             set of 4 verticies to be set Producted with collected argFactors.


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  //,collect(distinct toString(t.twoSeq)) as tS 
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   // WHERE ee.Value in targetFactors.T
WITH Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter} )      as argumentFactors  ,targetFactors


WITH [{TDegree:targetFactors.Degree,TScalar:targetFactors.Scalar,ATwoSeq:argumentFactors.TT,ADegree:CASE WHEN argumentFactors.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentFactors.Degree END,AScalar:argumentFactors.Scalar}]  AS argumentProduct

the last "with" should draw a product between each i'th row.  
return argumentFactors


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  //,collect(distinct toString(t.twoSeq)) as tS 
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   // WHERE ee.Value in targetFactors.T
WITH Collect({Evaluate:ee.Value,TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter} )      as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS
UNWIND tFDS as tFDSU
return tFDSU           // lets see what this looks like when it is projected with "T".


╒══════════════════════════╕
│"tFDSU"                   │
╞══════════════════════════╡
│{"Degree":1,"Scalar":-3.5}│
├──────────────────────────┤
│{"Degree":0,"Scalar":21.0}│
├──────────────────────────┤
│{"Degree":2,"Scalar":0.5} │
├──────────────────────────┤
│{"Degree":1,"Scalar":-3.0}│
├──────────────────────────┤
│{"Degree":1,"Scalar":-4.0}│
├──────────────────────────┤
│{"Degree":0,"Scalar":28.0}│
├──────────────────────────┤
│{"Degree":2,"Scalar":0.5} │
├──────────────────────────┤
│{"Degree":1,"Scalar":-3.5}│
└──────────────────────────┘


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  //,collect(distinct toString(t.twoSeq)) as tS 
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   // WHERE ee.Value in targetFactors.T
WITH Collect({Evaluate:ee.Value,TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter} )      as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT 
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS
UNWIND tFDS as tFDSU,tFT
return tFDSU.tFT           // lets see what this looks like when it is projected with "T".


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  //,collect(distinct toString(t.twoSeq)) as tS 
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   // WHERE ee.Value in targetFactors.T
WITH Collect({Evaluate:ee.Value,TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter} )      as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT       ,argumentFactors,argumentFactors.Evaluate as aFE 
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS,tFT
UNWIND tFDS as tFDSU
return tFDSU,tFT

╒══════════════════════════╤═════╕
│"tFDSU"                   │"tFT"│
╞══════════════════════════╪═════╡
│{"Degree":1,"Scalar":-4.0}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":0,"Scalar":28.0}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":2,"Scalar":0.5} │"8"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.5}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.5}│"4"  │
├──────────────────────────┼─────┤
│{"Degree":0,"Scalar":21.0}│"4"  │
├──────────────────────────┼─────┤
│{"Degree":2,"Scalar":0.5} │"4"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.0}│"4"  │
└──────────────────────────┴─────┘




MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="4" AND t.twoSeq=4
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="2"
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output

╒══════════╕
│"output"  │
╞══════════╡
│[2,159.0] │
├──────────┤
│[1,-782.0]│
├──────────┤
│[3,-14.5] │
├──────────┤
│[0,1456.0]│
├──────────┤
│[4,0.5]   │
└──────────┘

MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  //,collect(distinct toString(t.twoSeq)) as tS 
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   // WHERE ee.Value in targetFactors.T
WITH Collect({Evaluate:ee.Value,TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter} )      as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT       ,argumentFactors,argumentFactors.Evaluate as aFE 
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS,tFT
UNWIND tFDS as tFDSU
return tFDSU,tFT

╒══════════════════════════╤═════╕
│"tFDSU"                   │"tFT"│
╞══════════════════════════╪═════╡
│{"Degree":1,"Scalar":-4.0}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":0,"Scalar":28.0}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":2,"Scalar":0.5} │"8"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.5}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.5}│"4"  │
├──────────────────────────┼─────┤
│{"Degree":0,"Scalar":21.0}│"4"  │
├──────────────────────────┼─────┤
│{"Degree":2,"Scalar":0.5} │"4"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.0}│"4"  │
└──────────────────────────┴─────┘





MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors



WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT       ,argumentFactors,argumentFactors.Evaluate as aFE 
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS,tFT
UNWIND tFDS as tFDSU
return tFDSU,tFT

╒══════════════════════════╤═════╕
│"tFDSU"                   │"tFT"│
╞══════════════════════════╪═════╡
│{"Degree":1,"Scalar":-4.0}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":0,"Scalar":28.0}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":2,"Scalar":0.5} │"8"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.5}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.5}│"4"  │
├──────────────────────────┼─────┤
│{"Degree":0,"Scalar":21.0}│"4"  │
├──────────────────────────┼─────┤
│{"Degree":2,"Scalar":0.5} │"4"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.0}│"4"  │
└──────────────────────────┴─────┘





MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
return argumentFactors

╒══════════════════════════════════════════════════════════════════════╕
│"argumentFactors"                                                     │
╞══════════════════════════════════════════════════════════════════════╡
│{"DS":[{"TT":1,"Degree":1,"Scalar":-4.0,"RowC":"1"},{"TT":1,"Degree":0│
│,"Scalar":28.0,"RowC":"1"},{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}│
│,{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"},{"TT":1,"Degree":1,"Scal│
│ar":-3.5,"RowC":"0"},{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"0"},{"TT│
│":1,"Degree":2,"Scalar":0.5,"RowC":"0"},{"TT":1,"Degree":1,"Scalar":-3│
│.0,"RowC":"0"},{"TT":1,"Degree":-1,"Scalar":3.0,"RowC":"-1"}],"Evaluat│
│e":"4"}                                                               │
├──────────────────────────────────────────────────────────────────────┤
│{"DS":[{"TT":2,"Degree":1,"Scalar":-4.0,"RowC":"2"},{"TT":2,"Degree":0│
│,"Scalar":28.0,"RowC":"2"},{"TT":2,"Degree":2,"Scalar":0.5,"RowC":"2"}│
│,{"TT":2,"Degree":1,"Scalar":-3.5,"RowC":"2"},{"TT":1,"Degree":1,"Scal│
│ar":-3.5,"RowC":"1"},{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"1"},{"TT│
│":1,"Degree":2,"Scalar":0.5,"RowC":"1"},{"TT":1,"Degree":1,"Scalar":-3│
│.0,"RowC":"1"},{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"},{"TT":1,"D│
│egree":0,"Scalar":15.0,"RowC":"0"},{"TT":1,"Degree":2,"Scalar":0.5,"Ro│
│wC":"0"},{"TT":1,"Degree":1,"Scalar":-2.5,"RowC":"0"},{"TT":1,"Degree"│
│:-1,"Scalar":4.0,"RowC":"-1"}],"Evaluate":"8"}                        │
└──────────────────────────────────────────────────────────────────────┘

╒══════════════════════════════════════════════════════════════════════╕
│"targetFactors"                                                       │
╞══════════════════════════════════════════════════════════════════════╡
│{"DS":[{"Degree":1,"Scalar":-3.5},{"Degree":0,"Scalar":21.0},{"Degree"│
│:2,"Scalar":0.5},{"Degree":1,"Scalar":-3.0}],"T":"4"}                 │
├──────────────────────────────────────────────────────────────────────┤
│{"DS":[{"Degree":1,"Scalar":-4.0},{"Degree":0,"Scalar":28.0},{"Degree"│
│:2,"Scalar":0.5},{"Degree":1,"Scalar":-3.5}],"T":"8"}                 │
└──────────────────────────────────────────────────────────────────────┘



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT       ,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,fFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS,tFT
WITH argumentF[ii].DS as aFDS,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
return aFDSU,aFE
return tFDSU,tFT


╒══════════════════════════╤═════╕
│"tFDSU"                   │"tFT"│
╞══════════════════════════╪═════╡
│{"Degree":1,"Scalar":-3.5}│"4"  │
├──────────────────────────┼─────┤
│{"Degree":0,"Scalar":21.0}│"4"  │
├──────────────────────────┼─────┤
│{"Degree":2,"Scalar":0.5} │"4"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.0}│"4"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-4.0}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":0,"Scalar":28.0}│"8"  │
├──────────────────────────┼─────┤
│{"Degree":2,"Scalar":0.5} │"8"  │
├──────────────────────────┼─────┤
│{"Degree":1,"Scalar":-3.5}│"8"  │
└──────────────────────────┴─────┘


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT       ,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
//WITH targetF[ii].DS as tFDS,tFT
WITH argumentF[ii].DS as aFDS,aFE
//UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
return aFDSU,aFE
//return tFDSU,tFT                                                       // Expect 4*9 + 4*13 rows in product.


╒═════════════════════════════════════════════╤═════╕
│"aFDSU"                                      │"aFE"│
╞═════════════════════════════════════════════╪═════╡
│{"TT":1,"Degree":1,"Scalar":-4.0,"RowC":"1"} │"4"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":28.0,"RowC":"1"} │"4"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"4"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"4"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"0"} │"4"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"0"} │"4"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"4"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"4"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":3.0,"RowC":"-1"}│"4"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-4.0,"RowC":"2"} │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":2,"Degree":0,"Scalar":28.0,"RowC":"2"} │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":2,"Degree":2,"Scalar":0.5,"RowC":"2"}  │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-3.5,"RowC":"2"} │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"1"} │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"1"} │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":15.0,"RowC":"0"} │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-2.5,"RowC":"0"} │"8"  │
├─────────────────────────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":4.0,"RowC":"-1"}│"8"  │
└─────────────────────────────────────────────┴─────┘


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT       ,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS,tFT
WITH argumentF[ii].DS as aFDS,aFE,tFDS,tFT
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
return aFDSU,aFE,tFDSU,tFT
//return tFDSU,tFT

MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT       ,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,     tFT,aFE//,argumentF,
//WITH argumentF[ii].DS as aFDS,aFE,tFDS,tFT
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
return aFDSU,aFE,tFDSU,tFT
//return tFDSU,tFT



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU

WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,       ADegree:CASE WHEN argumentF.Degree=-1 
       Then argumentF.Degree+1 ELSE argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct

WITH [{TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree,AScalar:aFDSU.Scalar}]  AS argumentProduct



//   return aFDSU,aFE,tFDSU,tFT

╒═════════════════════════════════════════════╤═════╤══════════════════════════╤═════╕
│"aFDSU"                                      │"aFE"│"tFDSU"                   │"tFT"│
╞═════════════════════════════════════════════╪═════╪══════════════════════════╪═════╡
│{"TT":1,"Degree":1,"Scalar":-4.0,"RowC":"1"} │"4"  │{"Degree":1,"Scalar":-3.5}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":28.0,"RowC":"1"} │"4"  │{"Degree":1,"Scalar":-3.5}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"4"  │{"Degree":1,"Scalar":-3.5}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"4"  │{"Degree":1,"Scalar":-3.5}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"0"} │"4"  │{"Degree":1,"Scalar":-3.5}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"0"} │"4"  │{"Degree":1,"Scalar":-3.5}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"4"  │{"Degree":1,"Scalar":-3.5}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"4"  │{"Degree":1,"Scalar":-3.5}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":3.0,"RowC":"-1"}│"4"  │{"Degree":1,"Scalar":-3.5}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-4.0,"RowC":"1"} │"4"  │{"Degree":0,"Scalar":21.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":28.0,"RowC":"1"} │"4"  │{"Degree":0,"Scalar":21.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"4"  │{"Degree":0,"Scalar":21.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"4"  │{"Degree":0,"Scalar":21.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"0"} │"4"  │{"Degree":0,"Scalar":21.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"0"} │"4"  │{"Degree":0,"Scalar":21.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"4"  │{"Degree":0,"Scalar":21.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"4"  │{"Degree":0,"Scalar":21.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":3.0,"RowC":"-1"}│"4"  │{"Degree":0,"Scalar":21.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-4.0,"RowC":"1"} │"4"  │{"Degree":2,"Scalar":0.5} │"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":28.0,"RowC":"1"} │"4"  │{"Degree":2,"Scalar":0.5} │"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"4"  │{"Degree":2,"Scalar":0.5} │"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"4"  │{"Degree":2,"Scalar":0.5} │"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"0"} │"4"  │{"Degree":2,"Scalar":0.5} │"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"0"} │"4"  │{"Degree":2,"Scalar":0.5} │"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"4"  │{"Degree":2,"Scalar":0.5} │"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"4"  │{"Degree":2,"Scalar":0.5} │"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":3.0,"RowC":"-1"}│"4"  │{"Degree":2,"Scalar":0.5} │"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-4.0,"RowC":"1"} │"4"  │{"Degree":1,"Scalar":-3.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":28.0,"RowC":"1"} │"4"  │{"Degree":1,"Scalar":-3.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"4"  │{"Degree":1,"Scalar":-3.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"4"  │{"Degree":1,"Scalar":-3.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"0"} │"4"  │{"Degree":1,"Scalar":-3.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"0"} │"4"  │{"Degree":1,"Scalar":-3.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"4"  │{"Degree":1,"Scalar":-3.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"4"  │{"Degree":1,"Scalar":-3.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":3.0,"RowC":"-1"}│"4"  │{"Degree":1,"Scalar":-3.0}│"4"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-4.0,"RowC":"2"} │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":0,"Scalar":28.0,"RowC":"2"} │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":2,"Scalar":0.5,"RowC":"2"}  │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-3.5,"RowC":"2"} │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"1"} │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"1"} │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":15.0,"RowC":"0"} │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-2.5,"RowC":"0"} │"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":4.0,"RowC":"-1"}│"8"  │{"Degree":1,"Scalar":-4.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-4.0,"RowC":"2"} │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":0,"Scalar":28.0,"RowC":"2"} │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":2,"Scalar":0.5,"RowC":"2"}  │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-3.5,"RowC":"2"} │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"1"} │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"1"} │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":15.0,"RowC":"0"} │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-2.5,"RowC":"0"} │"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":4.0,"RowC":"-1"}│"8"  │{"Degree":0,"Scalar":28.0}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-4.0,"RowC":"2"} │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":0,"Scalar":28.0,"RowC":"2"} │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":2,"Scalar":0.5,"RowC":"2"}  │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-3.5,"RowC":"2"} │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"1"} │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"1"} │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":15.0,"RowC":"0"} │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-2.5,"RowC":"0"} │"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":4.0,"RowC":"-1"}│"8"  │{"Degree":2,"Scalar":0.5} │"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-4.0,"RowC":"2"} │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":0,"Scalar":28.0,"RowC":"2"} │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":2,"Scalar":0.5,"RowC":"2"}  │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":2,"Degree":1,"Scalar":-3.5,"RowC":"2"} │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.5,"RowC":"1"} │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":21.0,"RowC":"1"} │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"1"}  │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"1"} │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-3.0,"RowC":"0"} │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":0,"Scalar":15.0,"RowC":"0"} │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":2,"Scalar":0.5,"RowC":"0"}  │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":1,"Scalar":-2.5,"RowC":"0"} │"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
├─────────────────────────────────────────────┼─────┼──────────────────────────┼─────┤
│{"TT":1,"Degree":-1,"Scalar":4.0,"RowC":"-1"}│"8"  │{"Degree":1,"Scalar":-3.5}│"8"  │
└─────────────────────────────────────────────┴─────┴──────────────────────────┴─────┘



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
WITH [{afe:aFE,tft:tFT,TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar}]  AS argumentProduct
RETURN argumentProduct

╒═════════════════════════════════════════════════════════════════════════════════════════╕
│"argumentProduct"                                                                        │
╞═════════════════════════════════════════════════════════════════════════════════════════╡
│[{"AScalar":-4.0,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":28.0,"ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":21.0,"ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":3.0,"ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-4.0,"ADegree":1,"TScalar":21.0,"TDegree":0,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":28.0,"ADegree":0,"TScalar":21.0,"TDegree":0,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":21.0,"TDegree":0,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":21.0,"TDegree":0,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":21.0,"TDegree":0,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":21.0,"ADegree":0,"TScalar":21.0,"TDegree":0,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":21.0,"TDegree":0,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":21.0,"TDegree":0,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":3.0,"ADegree":0,"TScalar":21.0,"TDegree":0,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-4.0,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":28.0,"ADegree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"4","tft":"4"}]  │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":21.0,"ADegree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"4","tft":"4"}]  │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":3.0,"ADegree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"4","tft":"4"}]  │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-4.0,"ADegree":1,"TScalar":-3.0,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":28.0,"ADegree":0,"TScalar":-3.0,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-3.0,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":-3.0,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":-3.0,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":21.0,"ADegree":0,"TScalar":-3.0,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-3.0,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":-3.0,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":3.0,"ADegree":0,"TScalar":-3.0,"TDegree":1,"ATwoSeq":1,"afe":"4","tft":"4"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-4.0,"ADegree":1,"TScalar":-4.0,"TDegree":1,"ATwoSeq":2,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":28.0,"ADegree":0,"TScalar":-4.0,"TDegree":1,"ATwoSeq":2,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-4.0,"TDegree":1,"ATwoSeq":2,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":-4.0,"TDegree":1,"ATwoSeq":2,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":21.0,"ADegree":0,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":15.0,"ADegree":0,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-2.5,"ADegree":1,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":4.0,"ADegree":0,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-4.0,"ADegree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":2,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":28.0,"ADegree":0,"TScalar":28.0,"TDegree":0,"ATwoSeq":2,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":28.0,"TDegree":0,"ATwoSeq":2,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":2,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":21.0,"ADegree":0,"TScalar":28.0,"TDegree":0,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":28.0,"TDegree":0,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":15.0,"ADegree":0,"TScalar":28.0,"TDegree":0,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":28.0,"TDegree":0,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-2.5,"ADegree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":4.0,"ADegree":0,"TScalar":28.0,"TDegree":0,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-4.0,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":2,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":28.0,"ADegree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq":2,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":0.5,"TDegree":2,"ATwoSeq":2,"afe":"8","tft":"8"}]  │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":2,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":21.0,"ADegree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"8","tft":"8"}]  │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":15.0,"ADegree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"8","tft":"8"}]  │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-2.5,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":4.0,"ADegree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq":1,"afe":"8","tft":"8"}]  │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-4.0,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":2,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":28.0,"ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":2,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-3.5,"TDegree":1,"ATwoSeq":2,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":2,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.5,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":21.0,"ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-3.0,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":15.0,"ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":0.5,"ADegree":2,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}] │
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":-2.5,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}]│
├─────────────────────────────────────────────────────────────────────────────────────────┤
│[{"AScalar":4.0,"ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1,"afe":"8","tft":"8"}] │
└─────────────────────────────────────────────────────────────────────────────────────────┘



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
WITH {afe:aFE,tft:tFT, COLLECT( {  TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar })    }  AS argumentProduct
UNWIND argumentProduct as argumentProductt
RETURN argumentProduct



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
WITH {afe:aFE,tft:tFT,DS: COLLECT( {  TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar })    }  AS argumentProduct
RETURN argumentProduct


╒══════════════════════════════════════════════════════════════════════╕
│"argumentProduct"                                                     │
╞══════════════════════════════════════════════════════════════════════╡
│{"afe":"4","tft":"4","DS":[{"AScalar":-4.0,"ADegree":1,"TScalar":-3.5,│
│"TDegree":1,"ATwoSeq":1},{"AScalar":28.0,"ADegree":0,"TScalar":-3.5,"T│
│Degree":1,"ATwoSeq":1},{"AScalar":0.5,"ADegree":2,"TScalar":-3.5,"TDeg│
│ree":1,"ATwoSeq":1},{"AScalar":-3.5,"ADegree":1,"TScalar":-3.5,"TDegre│
│e":1,"ATwoSeq":1},{"AScalar":-3.5,"ADegree":1,"TScalar":-3.5,"TDegree"│
│:1,"ATwoSeq":1},{"AScalar":21.0,"ADegree":0,"TScalar":-3.5,"TDegree":1│
│,"ATwoSeq":1},{"AScalar":0.5,"ADegree":2,"TScalar":-3.5,"TDegree":1,"A│
│TwoSeq":1},{"AScalar":-3.0,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATw│
│oSeq":1},{"AScalar":3.0,"ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSe│
│q":1},{"AScalar":-4.0,"ADegree":1,"TScalar":21.0,"TDegree":0,"ATwoSeq"│
│:1},{"AScalar":28.0,"ADegree":0,"TScalar":21.0,"TDegree":0,"ATwoSeq":1│
│},{"AScalar":0.5,"ADegree":2,"TScalar":21.0,"TDegree":0,"ATwoSeq":1},{│
│"AScalar":-3.5,"ADegree":1,"TScalar":21.0,"TDegree":0,"ATwoSeq":1},{"A│
│Scalar":-3.5,"ADegree":1,"TScalar":21.0,"TDegree":0,"ATwoSeq":1},{"ASc│
│alar":21.0,"ADegree":0,"TScalar":21.0,"TDegree":0,"ATwoSeq":1},{"AScal│
│ar":0.5,"ADegree":2,"TScalar":21.0,"TDegree":0,"ATwoSeq":1},{"AScalar"│
│:-3.0,"ADegree":1,"TScalar":21.0,"TDegree":0,"ATwoSeq":1},{"AScalar":3│
│.0,"ADegree":0,"TScalar":21.0,"TDegree":0,"ATwoSeq":1},{"AScalar":-4.0│
│,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1},{"AScalar":28.0,"A│
│Degree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq":1},{"AScalar":0.5,"ADegr│
│ee":2,"TScalar":0.5,"TDegree":2,"ATwoSeq":1},{"AScalar":-3.5,"ADegree"│
│:1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1},{"AScalar":-3.5,"ADegree":1,│
│"TScalar":0.5,"TDegree":2,"ATwoSeq":1},{"AScalar":21.0,"ADegree":0,"TS│
│calar":0.5,"TDegree":2,"ATwoSeq":1},{"AScalar":0.5,"ADegree":2,"TScala│
│r":0.5,"TDegree":2,"ATwoSeq":1},{"AScalar":-3.0,"ADegree":1,"TScalar":│
│0.5,"TDegree":2,"ATwoSeq":1},{"AScalar":3.0,"ADegree":0,"TScalar":0.5,│
│"TDegree":2,"ATwoSeq":1},{"AScalar":-4.0,"ADegree":1,"TScalar":-3.0,"T│
│Degree":1,"ATwoSeq":1},{"AScalar":28.0,"ADegree":0,"TScalar":-3.0,"TDe│
│gree":1,"ATwoSeq":1},{"AScalar":0.5,"ADegree":2,"TScalar":-3.0,"TDegre│
│e":1,"ATwoSeq":1},{"AScalar":-3.5,"ADegree":1,"TScalar":-3.0,"TDegree"│
│:1,"ATwoSeq":1},{"AScalar":-3.5,"ADegree":1,"TScalar":-3.0,"TDegree":1│
│,"ATwoSeq":1},{"AScalar":21.0,"ADegree":0,"TScalar":-3.0,"TDegree":1,"│
│ATwoSeq":1},{"AScalar":0.5,"ADegree":2,"TScalar":-3.0,"TDegree":1,"ATw│
│oSeq":1},{"AScalar":-3.0,"ADegree":1,"TScalar":-3.0,"TDegree":1,"ATwoS│
│eq":1},{"AScalar":3.0,"ADegree":0,"TScalar":-3.0,"TDegree":1,"ATwoSeq"│
│:1}]}                                                                 │
├──────────────────────────────────────────────────────────────────────┤
│{"afe":"8","tft":"8","DS":[{"AScalar":-4.0,"ADegree":1,"TScalar":-4.0,│
│"TDegree":1,"ATwoSeq":2},{"AScalar":28.0,"ADegree":0,"TScalar":-4.0,"T│
│Degree":1,"ATwoSeq":2},{"AScalar":0.5,"ADegree":2,"TScalar":-4.0,"TDeg│
│ree":1,"ATwoSeq":2},{"AScalar":-3.5,"ADegree":1,"TScalar":-4.0,"TDegre│
│e":1,"ATwoSeq":2},{"AScalar":-3.5,"ADegree":1,"TScalar":-4.0,"TDegree"│
│:1,"ATwoSeq":1},{"AScalar":21.0,"ADegree":0,"TScalar":-4.0,"TDegree":1│
│,"ATwoSeq":1},{"AScalar":0.5,"ADegree":2,"TScalar":-4.0,"TDegree":1,"A│
│TwoSeq":1},{"AScalar":-3.0,"ADegree":1,"TScalar":-4.0,"TDegree":1,"ATw│
│oSeq":1},{"AScalar":-3.0,"ADegree":1,"TScalar":-4.0,"TDegree":1,"ATwoS│
│eq":1},{"AScalar":15.0,"ADegree":0,"TScalar":-4.0,"TDegree":1,"ATwoSeq│
│":1},{"AScalar":0.5,"ADegree":2,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1│
│},{"AScalar":-2.5,"ADegree":1,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1},│
│{"AScalar":4.0,"ADegree":0,"TScalar":-4.0,"TDegree":1,"ATwoSeq":1},{"A│
│Scalar":-4.0,"ADegree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":2},{"ASc│
│alar":28.0,"ADegree":0,"TScalar":28.0,"TDegree":0,"ATwoSeq":2},{"AScal│
│ar":0.5,"ADegree":2,"TScalar":28.0,"TDegree":0,"ATwoSeq":2},{"AScalar"│
│:-3.5,"ADegree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":2},{"AScalar":-│
│3.5,"ADegree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":1},{"AScalar":21.│
│0,"ADegree":0,"TScalar":28.0,"TDegree":0,"ATwoSeq":1},{"AScalar":0.5,"│
│ADegree":2,"TScalar":28.0,"TDegree":0,"ATwoSeq":1},{"AScalar":-3.0,"AD│
│egree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":1},{"AScalar":-3.0,"ADeg│
│ree":1,"TScalar":28.0,"TDegree":0,"ATwoSeq":1},{"AScalar":15.0,"ADegre│
│e":0,"TScalar":28.0,"TDegree":0,"ATwoSeq":1},{"AScalar":0.5,"ADegree":│
│2,"TScalar":28.0,"TDegree":0,"ATwoSeq":1},{"AScalar":-2.5,"ADegree":1,│
│"TScalar":28.0,"TDegree":0,"ATwoSeq":1},{"AScalar":4.0,"ADegree":0,"TS│
│calar":28.0,"TDegree":0,"ATwoSeq":1},{"AScalar":-4.0,"ADegree":1,"TSca│
│lar":0.5,"TDegree":2,"ATwoSeq":2},{"AScalar":28.0,"ADegree":0,"TScalar│
│":0.5,"TDegree":2,"ATwoSeq":2},{"AScalar":0.5,"ADegree":2,"TScalar":0.│
│5,"TDegree":2,"ATwoSeq":2},{"AScalar":-3.5,"ADegree":1,"TScalar":0.5,"│
│TDegree":2,"ATwoSeq":2},{"AScalar":-3.5,"ADegree":1,"TScalar":0.5,"TDe│
│gree":2,"ATwoSeq":1},{"AScalar":21.0,"ADegree":0,"TScalar":0.5,"TDegre│
│e":2,"ATwoSeq":1},{"AScalar":0.5,"ADegree":2,"TScalar":0.5,"TDegree":2│
│,"ATwoSeq":1},{"AScalar":-3.0,"ADegree":1,"TScalar":0.5,"TDegree":2,"A│
│TwoSeq":1},{"AScalar":-3.0,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwo│
│Seq":1},{"AScalar":15.0,"ADegree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq│
│":1},{"AScalar":0.5,"ADegree":2,"TScalar":0.5,"TDegree":2,"ATwoSeq":1}│
│,{"AScalar":-2.5,"ADegree":1,"TScalar":0.5,"TDegree":2,"ATwoSeq":1},{"│
│AScalar":4.0,"ADegree":0,"TScalar":0.5,"TDegree":2,"ATwoSeq":1},{"ASca│
│lar":-4.0,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":2},{"AScala│
│r":28.0,"ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":2},{"AScalar"│
│:0.5,"ADegree":2,"TScalar":-3.5,"TDegree":1,"ATwoSeq":2},{"AScalar":-3│
│.5,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":2},{"AScalar":-3.5│
│,"ADegree":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1},{"AScalar":21.0,"│
│ADegree":0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1},{"AScalar":0.5,"ADe│
│gree":2,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1},{"AScalar":-3.0,"ADegr│
│ee":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1},{"AScalar":-3.0,"ADegree│
│":1,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1},{"AScalar":15.0,"ADegree":│
│0,"TScalar":-3.5,"TDegree":1,"ATwoSeq":1},{"AScalar":0.5,"ADegree":2,"│
│TScalar":-3.5,"TDegree":1,"ATwoSeq":1},{"AScalar":-2.5,"ADegree":1,"TS│
│calar":-3.5,"TDegree":1,"ATwoSeq":1},{"AScalar":4.0,"ADegree":0,"TScal│
│ar":-3.5,"TDegree":1,"ATwoSeq":1}]}                                   │
└──────────────────────────────────────────────────────────────────────┘


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
WITH {afe:aFE,tft:tFT,DS: COLLECT( {  TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar })    }  AS argumentProduct
RETURN argumentProduct

//  agumentProduct is two rows.
//  they need to be collected      

MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
WITH {afe:aFE,tft:tFT,DS: COLLECT( {  TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar })    }  AS argumentProduct
WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.afe as aPafe
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe
UNWIND aPTds as aPTdsU
WITH {DS:COLLECT({ResultScalar:aPTdsU.TScalar*aPTdsU.AScalar,ResultDegree:aPTdsU.ADegree+aPTdsU.TDegree,ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe} as resultProduct
RETURN resultProduct


╒══════════════════════════════════════════════════════════════════════╕
│"resultProduct"                                                       │
╞══════════════════════════════════════════════════════════════════════╡
│{"DS":[{"ResultScalar":16.0,"ResultDegree":2,"ResultTwoSeq":2},{"Resul│
│tScalar":-112.0,"ResultDegree":1,"ResultTwoSeq":2},{"ResultScalar":-2.│
│0,"ResultDegree":3,"ResultTwoSeq":2},{"ResultScalar":14.0,"ResultDegre│
│e":2,"ResultTwoSeq":2},{"ResultScalar":14.0,"ResultDegree":2,"ResultTw│
│oSeq":1},{"ResultScalar":-84.0,"ResultDegree":1,"ResultTwoSeq":1},{"Re│
│sultScalar":-2.0,"ResultDegree":3,"ResultTwoSeq":1},{"ResultScalar":12│
│.0,"ResultDegree":2,"ResultTwoSeq":1},{"ResultScalar":12.0,"ResultDegr│
│ee":2,"ResultTwoSeq":1},{"ResultScalar":-60.0,"ResultDegree":1,"Result│
│TwoSeq":1},{"ResultScalar":-2.0,"ResultDegree":3,"ResultTwoSeq":1},{"R│
│esultScalar":10.0,"ResultDegree":2,"ResultTwoSeq":1},{"ResultScalar":-│
│16.0,"ResultDegree":1,"ResultTwoSeq":1},{"ResultScalar":-112.0,"Result│
│Degree":1,"ResultTwoSeq":2},{"ResultScalar":784.0,"ResultDegree":0,"Re│
│sultTwoSeq":2},{"ResultScalar":14.0,"ResultDegree":2,"ResultTwoSeq":2}│
│,{"ResultScalar":-98.0,"ResultDegree":1,"ResultTwoSeq":2},{"ResultScal│
│ar":-98.0,"ResultDegree":1,"ResultTwoSeq":1},{"ResultScalar":588.0,"Re│
│sultDegree":0,"ResultTwoSeq":1},{"ResultScalar":14.0,"ResultDegree":2,│
│"ResultTwoSeq":1},{"ResultScalar":-84.0,"ResultDegree":1,"ResultTwoSeq│
│":1},{"ResultScalar":-84.0,"ResultDegree":1,"ResultTwoSeq":1},{"Result│
│Scalar":420.0,"ResultDegree":0,"ResultTwoSeq":1},{"ResultScalar":14.0,│
│"ResultDegree":2,"ResultTwoSeq":1},{"ResultScalar":-70.0,"ResultDegree│
│":1,"ResultTwoSeq":1},{"ResultScalar":112.0,"ResultDegree":0,"ResultTw│
│oSeq":1},{"ResultScalar":-2.0,"ResultDegree":3,"ResultTwoSeq":2},{"Res│
│ultScalar":14.0,"ResultDegree":2,"ResultTwoSeq":2},{"ResultScalar":0.2│
│5,"ResultDegree":4,"ResultTwoSeq":2},{"ResultScalar":-1.75,"ResultDegr│
│ee":3,"ResultTwoSeq":2},{"ResultScalar":-1.75,"ResultDegree":3,"Result│
│TwoSeq":1},{"ResultScalar":10.5,"ResultDegree":2,"ResultTwoSeq":1},{"R│
│esultScalar":0.25,"ResultDegree":4,"ResultTwoSeq":1},{"ResultScalar":-│
│1.5,"ResultDegree":3,"ResultTwoSeq":1},{"ResultScalar":-1.5,"ResultDeg│
│ree":3,"ResultTwoSeq":1},{"ResultScalar":7.5,"ResultDegree":2,"ResultT│
│woSeq":1},{"ResultScalar":0.25,"ResultDegree":4,"ResultTwoSeq":1},{"Re│
│sultScalar":-1.25,"ResultDegree":3,"ResultTwoSeq":1},{"ResultScalar":2│
│.0,"ResultDegree":2,"ResultTwoSeq":1},{"ResultScalar":14.0,"ResultDegr│
│ee":2,"ResultTwoSeq":2},{"ResultScalar":-98.0,"ResultDegree":1,"Result│
│TwoSeq":2},{"ResultScalar":-1.75,"ResultDegree":3,"ResultTwoSeq":2},{"│
│ResultScalar":12.25,"ResultDegree":2,"ResultTwoSeq":2},{"ResultScalar"│
│:12.25,"ResultDegree":2,"ResultTwoSeq":1},{"ResultScalar":-73.5,"Resul│
│tDegree":1,"ResultTwoSeq":1},{"ResultScalar":-1.75,"ResultDegree":3,"R│
│esultTwoSeq":1},{"ResultScalar":10.5,"ResultDegree":2,"ResultTwoSeq":1│
│},{"ResultScalar":10.5,"ResultDegree":2,"ResultTwoSeq":1},{"ResultScal│
│ar":-52.5,"ResultDegree":1,"ResultTwoSeq":1},{"ResultScalar":-1.75,"Re│
│sultDegree":3,"ResultTwoSeq":1},{"ResultScalar":8.75,"ResultDegree":2,│
│"ResultTwoSeq":1},{"ResultScalar":-14.0,"ResultDegree":1,"ResultTwoSeq│
│":1}],"ET":"8"}                                                       │
├──────────────────────────────────────────────────────────────────────┤
│{"DS":[{"ResultScalar":14.0,"ResultDegree":2,"ResultTwoSeq":1},{"Resul│
│tScalar":-98.0,"ResultDegree":1,"ResultTwoSeq":1},{"ResultScalar":-1.7│
│5,"ResultDegree":3,"ResultTwoSeq":1},{"ResultScalar":12.25,"ResultDegr│
│ee":2,"ResultTwoSeq":1},{"ResultScalar":12.25,"ResultDegree":2,"Result│
│TwoSeq":1},{"ResultScalar":-73.5,"ResultDegree":1,"ResultTwoSeq":1},{"│
│ResultScalar":-1.75,"ResultDegree":3,"ResultTwoSeq":1},{"ResultScalar"│
│:10.5,"ResultDegree":2,"ResultTwoSeq":1},{"ResultScalar":-10.5,"Result│
│Degree":1,"ResultTwoSeq":1},{"ResultScalar":-84.0,"ResultDegree":1,"Re│
│sultTwoSeq":1},{"ResultScalar":588.0,"ResultDegree":0,"ResultTwoSeq":1│
│},{"ResultScalar":10.5,"ResultDegree":2,"ResultTwoSeq":1},{"ResultScal│
│ar":-73.5,"ResultDegree":1,"ResultTwoSeq":1},{"ResultScalar":-73.5,"Re│
│sultDegree":1,"ResultTwoSeq":1},{"ResultScalar":441.0,"ResultDegree":0│
│,"ResultTwoSeq":1},{"ResultScalar":10.5,"ResultDegree":2,"ResultTwoSeq│
│":1},{"ResultScalar":-63.0,"ResultDegree":1,"ResultTwoSeq":1},{"Result│
│Scalar":63.0,"ResultDegree":0,"ResultTwoSeq":1},{"ResultScalar":-2.0,"│
│ResultDegree":3,"ResultTwoSeq":1},{"ResultScalar":14.0,"ResultDegree":│
│2,"ResultTwoSeq":1},{"ResultScalar":0.25,"ResultDegree":4,"ResultTwoSe│
│q":1},{"ResultScalar":-1.75,"ResultDegree":3,"ResultTwoSeq":1},{"Resul│
│tScalar":-1.75,"ResultDegree":3,"ResultTwoSeq":1},{"ResultScalar":10.5│
│,"ResultDegree":2,"ResultTwoSeq":1},{"ResultScalar":0.25,"ResultDegree│
│":4,"ResultTwoSeq":1},{"ResultScalar":-1.5,"ResultDegree":3,"ResultTwo│
│Seq":1},{"ResultScalar":1.5,"ResultDegree":2,"ResultTwoSeq":1},{"Resul│
│tScalar":12.0,"ResultDegree":2,"ResultTwoSeq":1},{"ResultScalar":-84.0│
│,"ResultDegree":1,"ResultTwoSeq":1},{"ResultScalar":-1.5,"ResultDegree│
│":3,"ResultTwoSeq":1},{"ResultScalar":10.5,"ResultDegree":2,"ResultTwo│
│Seq":1},{"ResultScalar":10.5,"ResultDegree":2,"ResultTwoSeq":1},{"Resu│
│ltScalar":-63.0,"ResultDegree":1,"ResultTwoSeq":1},{"ResultScalar":-1.│
│5,"ResultDegree":3,"ResultTwoSeq":1},{"ResultScalar":9.0,"ResultDegree│
│":2,"ResultTwoSeq":1},{"ResultScalar":-9.0,"ResultDegree":1,"ResultTwo│
│Seq":1}],"ET":"4"}                                                    │
└──────────────────────────────────────────────────────────────────────┘


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
WITH {afe:aFE,tft:tFT,DS: COLLECT( {  TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar })    }  AS argumentProduct
WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.afe as aPafe
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe
UNWIND aPTds as aPTdsU
WITH {DS:COLLECT({ResultScalar:aPTdsU.TScalar*aPTdsU.AScalar,ResultDegree:aPTdsU.ADegree+aPTdsU.TDegree,ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe} as resultProduct
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT} as resultMap
RETURN resultMap


╒══════════════════════════════════════════════════════════════════════╕
│"resultMap"                                                           │
╞══════════════════════════════════════════════════════════════════════╡
│{"RScalarList":[{"RScalar":-1.75},{"RScalar":-1.75},{"RScalar":-2.0},{│
│"RScalar":-1.75},{"RScalar":-1.75},{"RScalar":-1.5},{"RScalar":-1.5},{│
│"RScalar":-1.5}],"RDegree":3,"ET":"4"}                                │
├──────────────────────────────────────────────────────────────────────┤
│{"RScalarList":[{"RScalar":16.0},{"RScalar":14.0},{"RScalar":14.0},{"R│
│Scalar":12.0},{"RScalar":12.0},{"RScalar":10.0},{"RScalar":14.0},{"RSc│
│alar":14.0},{"RScalar":14.0},{"RScalar":14.0},{"RScalar":10.5},{"RScal│
│ar":7.5},{"RScalar":2.0},{"RScalar":14.0},{"RScalar":12.25},{"RScalar"│
│:12.25},{"RScalar":10.5},{"RScalar":10.5},{"RScalar":8.75}],"RDegree":│
│2,"ET":"8"}                                                           │
├──────────────────────────────────────────────────────────────────────┤
│{"RScalarList":[{"RScalar":588.0},{"RScalar":441.0},{"RScalar":63.0}],│
│"RDegree":0,"ET":"4"}                                                 │
├──────────────────────────────────────────────────────────────────────┤
│{"RScalarList":[{"RScalar":14.0},{"RScalar":12.25},{"RScalar":12.25},{│
│"RScalar":10.5},{"RScalar":10.5},{"RScalar":10.5},{"RScalar":14.0},{"R│
│Scalar":10.5},{"RScalar":1.5},{"RScalar":12.0},{"RScalar":10.5},{"RSca│
│lar":10.5},{"RScalar":9.0}],"RDegree":2,"ET":"4"}                     │
├──────────────────────────────────────────────────────────────────────┤
│{"RScalarList":[{"RScalar":0.25},{"RScalar":0.25},{"RScalar":0.25}],"R│
│Degree":4,"ET":"8"}                                                   │
├──────────────────────────────────────────────────────────────────────┤
│{"RScalarList":[{"RScalar":-112.0},{"RScalar":-84.0},{"RScalar":-60.0}│
│,{"RScalar":-16.0},{"RScalar":-112.0},{"RScalar":-98.0},{"RScalar":-98│
│.0},{"RScalar":-84.0},{"RScalar":-84.0},{"RScalar":-70.0},{"RScalar":-│
│98.0},{"RScalar":-73.5},{"RScalar":-52.5},{"RScalar":-14.0}],"RDegree"│
│:1,"ET":"8"}                                                          │
├──────────────────────────────────────────────────────────────────────┤
│{"RScalarList":[{"RScalar":0.25},{"RScalar":0.25}],"RDegree":4,"ET":"4│
│"}                                                                    │
├──────────────────────────────────────────────────────────────────────┤
│{"RScalarList":[{"RScalar":-2.0},{"RScalar":-2.0},{"RScalar":-2.0},{"R│
│Scalar":-2.0},{"RScalar":-1.75},{"RScalar":-1.75},{"RScalar":-1.5},{"R│
│Scalar":-1.5},{"RScalar":-1.25},{"RScalar":-1.75},{"RScalar":-1.75},{"│
│RScalar":-1.75}],"RDegree":3,"ET":"8"}                                │
├──────────────────────────────────────────────────────────────────────┤
│{"RScalarList":[{"RScalar":-98.0},{"RScalar":-73.5},{"RScalar":-10.5},│
│{"RScalar":-84.0},{"RScalar":-73.5},{"RScalar":-73.5},{"RScalar":-63.0│
│},{"RScalar":-84.0},{"RScalar":-63.0},{"RScalar":-9.0}],"RDegree":1,"E│
│T":"4"}                                                               │
├──────────────────────────────────────────────────────────────────────┤
│{"RScalarList":[{"RScalar":784.0},{"RScalar":588.0},{"RScalar":420.0},│
│{"RScalar":112.0}],"RDegree":0,"ET":"8"}                              │
└──────────────────────────────────────────────────────────────────────┘

MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
WITH {afe:aFE,tft:tFT,DS: COLLECT( {  TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar })    }  AS argumentProduct
WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.afe as aPafe
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe
UNWIND aPTds as aPTdsU
WITH {DS:COLLECT({ResultScalar:aPTdsU.TScalar*aPTdsU.AScalar,ResultDegree:aPTdsU.ADegree+aPTdsU.TDegree,ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe} as resultProduct
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT} as resultMap
WITH COLLECT(resultMap) as resultMapC
RETURN resultMapC


╒══════════════════════════════════════════════════════════════════════╕
│"resultMapC"                                                          │
╞══════════════════════════════════════════════════════════════════════╡
│[{"RScalarList":[{"RScalar":-1.75},{"RScalar":-1.75},{"RScalar":-2.0},│
│{"RScalar":-1.75},{"RScalar":-1.75},{"RScalar":-1.5},{"RScalar":-1.5},│
│{"RScalar":-1.5}],"RDegree":3,"ET":"4"},{"RScalarList":[{"RScalar":16.│
│0},{"RScalar":14.0},{"RScalar":14.0},{"RScalar":12.0},{"RScalar":12.0}│
│,{"RScalar":10.0},{"RScalar":14.0},{"RScalar":14.0},{"RScalar":14.0},{│
│"RScalar":14.0},{"RScalar":10.5},{"RScalar":7.5},{"RScalar":2.0},{"RSc│
│alar":14.0},{"RScalar":12.25},{"RScalar":12.25},{"RScalar":10.5},{"RSc│
│alar":10.5},{"RScalar":8.75}],"RDegree":2,"ET":"8"},{"RScalarList":[{"│
│RScalar":588.0},{"RScalar":441.0},{"RScalar":63.0}],"RDegree":0,"ET":"│
│4"},{"RScalarList":[{"RScalar":14.0},{"RScalar":12.25},{"RScalar":12.2│
│5},{"RScalar":10.5},{"RScalar":10.5},{"RScalar":10.5},{"RScalar":14.0}│
│,{"RScalar":10.5},{"RScalar":1.5},{"RScalar":12.0},{"RScalar":10.5},{"│
│RScalar":10.5},{"RScalar":9.0}],"RDegree":2,"ET":"4"},{"RScalarList":[│
│{"RScalar":0.25},{"RScalar":0.25},{"RScalar":0.25}],"RDegree":4,"ET":"│
│8"},{"RScalarList":[{"RScalar":-112.0},{"RScalar":-84.0},{"RScalar":-6│
│0.0},{"RScalar":-16.0},{"RScalar":-112.0},{"RScalar":-98.0},{"RScalar"│
│:-98.0},{"RScalar":-84.0},{"RScalar":-84.0},{"RScalar":-70.0},{"RScala│
│r":-98.0},{"RScalar":-73.5},{"RScalar":-52.5},{"RScalar":-14.0}],"RDeg│
│ree":1,"ET":"8"},{"RScalarList":[{"RScalar":0.25},{"RScalar":0.25}],"R│
│Degree":4,"ET":"4"},{"RScalarList":[{"RScalar":-2.0},{"RScalar":-2.0},│
│{"RScalar":-2.0},{"RScalar":-2.0},{"RScalar":-1.75},{"RScalar":-1.75},│
│{"RScalar":-1.5},{"RScalar":-1.5},{"RScalar":-1.25},{"RScalar":-1.75},│
│{"RScalar":-1.75},{"RScalar":-1.75}],"RDegree":3,"ET":"8"},{"RScalarLi│
│st":[{"RScalar":-98.0},{"RScalar":-73.5},{"RScalar":-10.5},{"RScalar":│
│-84.0},{"RScalar":-73.5},{"RScalar":-73.5},{"RScalar":-63.0},{"RScalar│
│":-84.0},{"RScalar":-63.0},{"RScalar":-9.0}],"RDegree":1,"ET":"4"},{"R│
│ScalarList":[{"RScalar":784.0},{"RScalar":588.0},{"RScalar":420.0},{"R│
│Scalar":112.0}],"RDegree":0,"ET":"8"}]                                │
└──────────────────────────────────────────────────────────────────────┘



WITH {afe:aFE,tft:tFT,DS: COLLECT( {  TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar })    }  AS argumentProduct
WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.afe as aPafe
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe
UNWIND aPTds as aPTdsU
WITH {DS:COLLECT({ResultScalar:aPTdsU.TScalar*aPTdsU.AScalar,ResultDegree:aPTdsU.ADegree+aPTdsU.TDegree,ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe} as resultProduct
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT} as resultMap
WITH COLLECT(resultMap) as resultMapC
UNWIND RANGE(0,SIZE(resultMapC)-1) as iII
WITH resultMapC[iII].RScalarList as rSL
UNWIND RANGE(0,SIZE(rSL)-1) as iIII
UNWIND rSL[iIII] as rSLI
WITH COLLECT(rSLI.RScalar) as cts
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar
RETURN TotalRScalar

╒══════════════╕
│"TotalRScalar"│
╞══════════════╡
│1635.0        │
└──────────────┘



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" 
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii)   
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
WITH {afe:aFE,tft:tFT,DS: COLLECT( {  TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar })    }  AS argumentProduct
WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.afe as aPafe
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe
UNWIND aPTds as aPTdsU
WITH {DS:COLLECT({ResultScalar:aPTdsU.TScalar*aPTdsU.AScalar,ResultDegree:aPTdsU.ADegree+aPTdsU.TDegree,ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe} as resultProduct
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT} as resultMap
WITH COLLECT(resultMap) as resultMapC,resultMap.ET as eTrm,resultMap.RDegree as rDRM
UNWIND RANGE(0,SIZE(resultMapC)-1) as iII
WITH resultMapC[iII].RScalarList as rSL,eTrm,rDRM
UNWIND RANGE(0,SIZE(rSL)-1) as iIII
UNWIND rSL[iIII] as rSLI
WITH COLLECT(rSLI.RScalar) as cts,eTrm,rDRM
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,eTrm,rDRM
RETURN TotalRScalar,eTrm,rDRM
╒══════════════╤══════╤══════╕
│"TotalRScalar"│"eTrm"│"rDRM"│
╞══════════════╪══════╪══════╡
│1904.0        │"8"   │0     │
├──────────────┼──────┼──────┤
│-632.0        │"4"   │1     │
├──────────────┼──────┼──────┤
│0.5           │"4"   │4     │
├──────────────┼──────┼──────┤
│222.25        │"8"   │2     │
├──────────────┼──────┼──────┤
│1092.0        │"4"   │0     │
├──────────────┼──────┼──────┤
│-13.5         │"4"   │3     │
├──────────────┼──────┼──────┤
│-1056.0       │"8"   │1     │
├──────────────┼──────┼──────┤
│138.0         │"4"   │2     │
├──────────────┼──────┼──────┤
│0.75          │"8"   │4     │
├──────────────┼──────┼──────┤
│-21.0         │"8"   │3     │
└──────────────┴──────┴──────┘


Call apoc.export.csv.query("
MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="5" AND i.MaxN="8"
WITH {DS:collect({Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}),T:toString(t.twoSeq)} as targetFactors,i.N as iN, i.MaxN as iM  
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:targetFactors.T}),(tt:TwoSeqFactor)<-[]-(ii) where ii.MaxN="8"
WITH {DS:Collect({TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END,RowC:ii.RowCounter}),Evaluate:ee.Value}  as argumentFactors  ,targetFactors,iN,iM
WITH COLLECT(targetFactors) as targetF,targetFactors.T as tFT,argumentFactors,iN,iM 
WITH COLLECT(argumentFactors) as argumentF,argumentFactors.Evaluate as aFE,targetF,tFT,iN,iM
UNWIND RANGE(0,SIZE(targetF)-1) as ii
WITH targetF[ii].DS as tFDS, argumentF[ii].DS as aFDS,tFT,aFE,iN,iM
UNWIND tFDS as tFDSU
UNWIND aFDS as aFDSU
WITH {afe:aFE,tft:tFT,DS: COLLECT( {  TDegree:tFDSU.Degree,TScalar:tFDSU.Scalar,ATwoSeq:aFDSU.TT,ADegree: CASE WHEN aFDSU.Degree=-1 THEN aFDSU.Degree+1 ELSE aFDSU.Degree END,AScalar:aFDSU.Scalar })    }  AS argumentProduct,iN,iM
WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.afe as aPafe,iN,iM
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe,iN,iM
UNWIND aPTds as aPTdsU
WITH {DS:COLLECT({ResultScalar:aPTdsU.TScalar*aPTdsU.AScalar,ResultDegree:aPTdsU.ADegree+aPTdsU.TDegree,ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe} as resultProduct,iN,iM
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT,iN,iM
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT,iN,iM
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT} as resultMap,iN,iM
WITH COLLECT(resultMap) as resultMapC,resultMap.ET as eTrm,resultMap.RDegree as rDRM,iN,iM
UNWIND RANGE(0,SIZE(resultMapC)-1) as iII
WITH resultMapC[iII].RScalarList as rSL,eTrm,rDRM,iN,iM
UNWIND RANGE(0,SIZE(rSL)-1) as iIII
UNWIND rSL[iIII] as rSLI
WITH COLLECT(rSLI.RScalar) as cts,eTrm,rDRM,iN,iM
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,eTrm,rDRM,iN,iM
RETURN TotalRScalar,eTrm,rDRM,iN,iM
 ",
"quartets0804.csv",{d:";"})




MATCH (n:IndexedBy) RETURN n LIMIT 25

╒══════════════════════════════════════╕
│"n"                                   │
╞══════════════════════════════════════╡
│{"RowCounter":"-1","N":"5","MaxN":"8"}│
├──────────────────────────────────────┤



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="4" AND t.twoSeq=4
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="2"
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output

╒══════════╕
│"output"  │
╞══════════╡
│[2,159.0] │
├──────────┤
│[1,-782.0]│
├──────────┤
│[3,-14.5] │
├──────────┤
│[0,1456.0]│
├──────────┤
│[4,0.5]   │
└──────────┘


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="4" AND t.twoSeq=4 AND i.MaxN='14'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="2" AND ii.MaxN='14'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output

04/29


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="4" AND t.twoSeq=4 AND i.MaxN='8'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="2" AND ii.MaxN='8'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output
                                                                          //  i.N=7 t.twoSeq=16  ii.N=16

output
[0, 1456.0]
[2, 159.0]
[4, 0.5]
[1, -782.0]
[3, -14.5]

MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="7" AND t.twoSeq=16 AND i.MaxN='8'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="4" AND ii.MaxN='8'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output


[0, 1456.0]
[2, 159.0]
[4, 0.5]
[1, -782.0]
[3, -14.5]


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="7" AND t.twoSeq=16 AND i.MaxN='8'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="4" AND ii.MaxN='8'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt

return argumentProductt.TDegree,  argumentProductt.TScalar,  argumentProductt.ATwoSeq,  argumentProductt.ADegree,  argumentProductt.AScalar
  
  




WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP


WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output


output
[1, -1017.5]
[4, 1.0]
[0, 1659.0]
[3, -25.0]
[2, 237.5]



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="7" AND t.twoSeq=16 AND i.MaxN='8'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="4" AND ii.MaxN='8'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output

output
[2, 520.5]
[0, 3864.0]
[4, 2.0]
[3, -52.5]
[1, -2309.0]



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="8" AND t.twoSeq=32 AND i.MaxN='9'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="5" AND ii.MaxN='9'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END*tt.twoSeq}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output

//  The not quite working copy.


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="8" AND t.twoSeq=32 AND i.MaxN='9'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)/2}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="5" AND ii.MaxN='9'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END*tt.twoSeq}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:CASE WHEN argumentF.Degree=-1 Then argumentF.Degree+1 ELSE
      argumentF.Degree END,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output



// do not divide by two, treat degree=-1 seperatly.
// hmm..   still a refinemment...




MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="8" AND t.twoSeq=32 AND i.MaxN='9'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="5" AND ii.MaxN='9'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar: toFloat(vv.Scalar)}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:argumentF.Degree,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
return   argumentProductt.TDegree,argumentProductt.TScalar,argumentProductt.ATwoSeq,argumentProductt.ADegree,argumentProductt.AScalar



WITH [{ResultScalar:argumentProductt.TScalar*argumentProductt.AScalar,ResultDegree:argumentProductt.ADegree+argumentProductt.TDegree,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP



WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output


4/30

twoSeq  in argument * scalar in target * 9^ sum of degrees / 4  ( the highlightes example). 


So maybe have an attemp to make with the above prototype.
Still have the special case of degree=-1.  It needs to be treated as degree =0 and not divided by two 
(don't divide through by 4 but by two).

WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:CASE WHEN vv.Degree = "-1" THEN toFloat(vv.Scalar) ELSE toFloat(vv.Scalar)/2 END*tt.twoSeq}]
      as argumentFactors,targetFactors


MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="8" AND t.twoSeq=32 AND i.MaxN='9'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="5" AND ii.MaxN='9'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:toFloat(vv.Scalar)}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:argumentF.Degree,AScalar:argumentF.Scalar}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:CASE WHEN argumentProductt.ADegree=-1 THEN (argumentProductt.TScalar*argumentProductt.AScalar*argumentProductt.ATwoSeq)/2 ELSE 
        (argumentProductt.TScalar*argumentProductt.AScalar*argumentProductt.ATwoSeq)/4 END,
      ResultDegree: CASE WHEN argumentProductt.ADegree=-1 THEN argumentProductt.TDegree ELSE argumentProductt.ADegree+argumentProductt.TDegree END,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output

output
[3, -120.5]
[4, 4.0]
[2, 1368.0]
[1, -6935.5]
[0, 13244.0]

=32 so ok. and many others are correct..  but.. but..

but 9,8,16 returns 2X correct answer.

5/1

The first today attemt: record -1 dimension scalar as 2X(value).

MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) where i.N="8" AND t.twoSeq=16 AND i.MaxN='9'
WITH [{T:t.twoSeq,Degree:toInteger(v.Degree),Scalar:toFloat(v.Scalar)}] as targetFactors
MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate),(tt:TwoSeqFactor)<-[]-(ii) where ii.N="4" AND ii.MaxN='9'
WITH [{TT:tt.twoSeq,Degree:toInteger(vv.Degree),Scalar:toFloat(vv.Scalar)}]
      as argumentFactors,targetFactors
UNWIND argumentFactors as argumentF
UNWIND targetFactors as targetF
WITH [{TDegree:targetF.Degree,TScalar:targetF.Scalar,ATwoSeq:argumentF.TT,ADegree:argumentF.Degree,AScalar:
CASE WHEN argumentF.Degree=-1 THEN argumentF.Scalar*2 ELSE argumentF.Scalar END}]  AS argumentProduct
UNWIND argumentProduct as argumentProductt
WITH [{ResultScalar:(argumentProductt.TScalar*argumentProductt.AScalar*argumentProductt.ATwoSeq)/4,
      ResultDegree: CASE WHEN argumentProductt.ADegree=-1 THEN argumentProductt.TDegree ELSE argumentProductt.ADegree+argumentProductt.TDegree END,
      ResultTwoSeq:argumentProductt.ATwoSeq}] as resultProduct
UNWIND resultProduct as rP
WITH {RScalarList:COLLECT({RScalar:rP.ResultScalar}),RDegree:rP.ResultDegree} as ResultMap
WITH COLLECT(ResultMap.RScalarList) AS RScalar,ResultMap
Unwind RANGE(0,SIZE(RScalar)-1) as ii
Unwind RScalar[ii] as ts
With collect(ts.RScalar) as cts,ResultMap
With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,ResultMap
With [ResultMap.RDegree,TotalRScalar] as output
Return output

output
[3, -56.5]
[4, 2.0]
[2, 601.0]
[1, -2847.5]
[0, 5061.0]















