4/1




MuNumDen:   31  1   5   [1, 1, 1, 1, 1]  5
MuNumDen:   23  2   5   [2, 1, 1, 1]  4
MuNumDen:   13  2   5   [2, 2, 1]  3
MuNumDen:   19  3   5   [3, 1, 1]  3
MuNumDen:   10  3   5   [3, 2]  2

1 0 1 0

MuNumDen:   17  4   5   [4, 1]  2
MuNumDen:   16  5   5   [5]  1

MuNumDen:   15  1   4   [1, 1, 1, 1]  4
MuNumDen:   11  2   4   [2, 1, 1]  3
MuNumDen:   6  2   4   [2, 2]  2
MuNumDen:   9  3   4   [3, 1]  2
MuNumDen:   8  4   4   [4]  1

MuNumDen:   7  1   3   [1, 1, 1]  3
MuNumDen:   5  2   3   [2, 1]  2
MuNumDen:   4  3   3   [3]  1

MuNumDen:   3  1   2   [1, 1]  2
MuNumDen:   2  2   2   [2]  1

MuNumDen:   1  1   1   [1]  1

0 0 0 1
0 0 1 0
0 0 1 1
0 1 0 0
0 1 0 1
0 1 1 1
1 0 0 0
1 0 0 1
0 1 1 0
1 0 1 1
1 1 1 1

1 0 0 0 0 0 0 1
1 0 0 0 0 1 0

1 0 0 0 1 0 1

 1 1 1 0 1 1

the index of the last digit + value of last digit.

n - The index of the set.
n index of mu set.
any place where n + val_n < worker_last.     - EQ1

So, implement EQ1 in ZAD.


LoopsMain needs to loop a range of numeratorHigh/denominater for FractionIntegerDriverIterate.


To write the FractionIntegerDriverIterate buffer to ZAD or not....
AND
Refactor ZAD for not computingIndexZero...

LoopsDriverTwoPManager has the noBufferRun boolean.  Works great when set to true.
noBufferRun set to false reads the plvManager buffer. 

//       plvManager mage = new plvManager(tlSemaphore,t2Semaphore,cosetSemaphore,dbVector,dbVector1,dbVectorCST,tl1Semaphore,dbVector11);
while ((mage.isAlive()) || (dbVector11.size()>0))
 
Want it to read the FractionIntegerDriverIterate buffer.

       FractionIntegerDriverIterate figI= new FractionIntegerDriverIterate(muList,muSem);


4/2

FractionIntegerDriverIterate puts muNumDen objects on buffer.  The buffer is muList.


LoopsDriverTwoPManager lDriver= new LoopsDriverTwoPManager(muList,muSem,loopsLogic,tl1Semaphore,dbVector11,figI,tl1Semaphore,dbVector11,false); 
GaussTable1 gTable1 = new GaussTable1(muSem,muList,lDriver); 

so, want LDTPM and GT1 to share tl1Semapher, and dbVector11.   dbVector11 should be the same type as muList.

generatebinaryiterateLast does not propigatge exit properlly to prior threads.  needs to gracefully exit.

muNumDen is stringey.  Need the list on the object for LoopsDriverTwoPManager.


LoopsDriverTwoPManager.run has bList from muNumDen object.   
It is time to implement yesterday's equation.


Maybe validMu works...


4/5

work outline:
.With dimension=n what is the least upper denominater that will complete semaphor pattern mask???
.noBufferrun repurposing...                             - working
 each validMu to be passed into nobufferrun() for LoopsDriverTwoP thread iteration.   
.LoopSemaphore pattern needs skip logic.                -done
.LoopsDriverTwoP needs the correctGaussTable1 buffer.   -done

loopsDriverTwoP and muMaskList.
The loopsDriverTwoP.call instanciates worker threads.
Each worker needs a skip boolean in constructor.

LoopsDriverTwoP needs a method writing muMaskList as boolean arrayList.
Actually, LoopsDriverTwoPManager will contain this method.

muListBoolean(theList):
Need to initialize returnList.
Meaning need to know size of return list.  
returnList is size of dimension.


1,3,4
       1 0 1 0 0 1

so, valid mu does check if size is less than dimension.
muListBoolean appears working.


LoopsDriverTwoP has reference of muListBoolean as muMaskList.


LoopSemaphoer
LoopSemaphoreInital
LoopSemaphoreLast  

they each need a "skip" boolean in respective constructors.

in each in pattern skip has defalt = false. 
for when not constructed with boolean.

and again LoopsDriverTwoP has field:
   this.muMaskList=muMaskList;


up to:  LoopSemaphore's have the skip boolean.  
Time to implement....


Have LoopSemaphoreInitial.
And say skip=true.


4/6

match (c:CreatedBy {pArray:'[1, 0, 2, 0]'}) -[]-(d:Dnode) return c,d

match (c:CreatedBy {pArray:'[5, 0, 0, 1, 4, 0]'}) -[]-(d:Dnode) return c,d

setMuDen is not recording num,den properly.  --  maybe it is....  


next up:

FidI - need to exit correctly.
The mu complete iteration is several iterations of parameterized denominator.



Fraction Integer Driver Iterate before .isTerminated() ThreadMXBean:    [17, 16, 15, 14, 13, 11, 5, 4, 3, 2, 1]
isTerminated() ThreadMXBean:    [17, 16, 15, 14, 11, 5, 4, 3, 2, 1]

service.take gbl exit     .........
isTerminated() ThreadMXBean:    [18, 12, 15, 14, 11, 5, 4, 3, 2, 1]

service.take generateBinary 16
isTerminated() ThreadMXBean:    [18, 12, 15, 14, 11, 5, 4, 3, 2, 1]

some printlns and again...

Generate BinaryStart ThredID 13 StartSemaphore permits0

generateBinaryZeroIterate before sf2.acquire()0threadId: 11

GenerateBinaryIterate before  sf2.acquire()0threadId: 15

GenerateBinaryIterate before  sf2.acquire()0threadId: 16

Generate BinaryLast ThredID 18

Fraction Integer Driver Iterate before .isTerminated() ThreadMXBean:    [18, 16, 15, 14, 13, 11, 5, 4, 3, 2, 1]

service.take generateBinaryStart return
isTerminated() ThreadMXBean:    [18, 16, 15, 14, 11, 5, 4, 3, 2, 1]

service.take gbl exit     .........
isTerminated() ThreadMXBean:    [17, 12, 15, 14, 11, 5, 4, 3, 2, 1]
service.take generateBinary 16
isTerminated() ThreadMXBean:    [17, 12, 15, 14, 11, 5, 4, 3, 2, 1]

And a narration of LoopSemaphore execution strategy.

OuterLoop until endProduct.

wait to aquire because previous iteration complete.

perform the logic.

release because increment

Inner loop until runtime nunber of iterations parameter.

wait to aquire. 

perform the logic.

release because increment.

innerLoop boundery.  

// iteration complete.

Wait to aquire because previous iteration complete.

reset 

release next worker permit.

Wait for next worker to increment.

release prior worker permit.


So, sleuth:

If simply guard the logic.  
Then redundancy galore.

So,
 
Don't iterate.
Don't implement logic.

Then:

What permits are necessary?

Need the first acquire from prior worker iteration.
Need the release to the next worker.
Need the aquire from the next worker
Need the release to the previous worker.


LoopSemaphore last does fall through. 

So, maybe pattern refactored.

Back to LoopsTwoPManager.

shut off noBufferRun...   - not ready yet...

Need to set test dimension as 5.  done  
Need to set numeratorHigh/denomiator  as 5. done

Run and see what muSkipList is produced.

The first skipList says skip all.   and what happens with run is...

WorkerLast is not constructed with skip boolean.  

Now though onto straightening out GaussTable1 variables.

The buffers:


LoopsDriverTwoP uses dbVector11 in run()  - it is depricated.
                defines muList1 - it appears unused.

muList,muSem the first two in constructor signature is the 
buffer implemented in .call()


      GaussTable1 gTable1 = new GaussTable1(t11Semaphore,dbVector11,lDriver);


Appears all good....

Not though, resultId need uniqueeness from run to run.

problems with noBufferRun reusing the executor service.
Think it has to change it's scope, put it inside buffer loop.

4/7

The plan:

ResultListId fix.   -  it is a field in LoopsDriverTwoPManager.  It will not conflict with looping FractionIntegerDriverIterate.
large denominator index error  -  bad return syntax.  Fixed.

Exception in thread "Thread-1" java.lang.IndexOutOfBoundsException: Index: 23, Size: 5
muListBoolean.set(mLBIndex, true);

Compute denominator range necessary for mask pattern.

LoopsDriverTwoPManager has while loop condition FractionIntegerDriverIterate is alive or has buffer elements.

FractionIntegerDriverIterate's run method has one iteration for the denominater field.
It needs a refactoring enabeling a range of denominators for iteration.

The current run() must be renamed as runDenominator().
A new run() method to set denominator in necessary range of denominator
and call runDenominator with current denominator in range of denominator. 

Asserting dimension requires a range of numeratorHigh/Denominators expressions.

Say dimension=5. 


The refactored run will iterate numeratorHigh/denominator until !validMu.

so, need field validMuBoolean pre-defined to false.

have boolean isValidMu=false;

isValid mu happens at LoopsDriverTwoPManager and does not communicate with fractionIntegerDriverIterate.

so the question remains how to validmu test....


looks like blind guess for now   someting of an analysis for closed form result resolving max denominater needed. 
will set dimension to 7.

meaning want to iterate denominators to 10.


so, have runGBpattern - a simple loop calling runGBpattern.





   LoopsDriverTwoPmanager while loop false 2
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@7c3a3e59
LoopsDriverTwoP muNumDen:   [1]
LoopsDriverTwoP muNumDen:  [1]
Size: 1
validMu [1] true
true
Size: 1
validMu [1] true
muListBoolean, theList: [1]
0
[true, false, false, false, false]
   LoopsDriverTwoPmanager while loop false 1
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@72fddfae
LoopsDriverTwoP muNumDen:   [1]
LoopsDriverTwoP muNumDen:  [1]
Size: 1
validMu [1] true
true
Size: 1
validMu [1] true
muListBoolean, theList: [1]
0
[true, false, false, false, false]
LoopsDriverTwoPManager Exit 


                                                                                                              LoopsDriverTwoPmanager while loop false 2
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@32b04d4b
LoopsDriverTwoP muNumDen:   [1, 1]
LoopsDriverTwoP muNumDen:  [1, 1]
Size: 2
validMu [1, 1] true
true
Size: 2
validMu [1, 1] true
muListBoolean, theList: [1, 1]
0
1
[true, true, false, false, false]
                                                                                                              LoopsDriverTwoPmanager while loop false 1
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@3c77b56d
LoopsDriverTwoP muNumDen:   [2]
LoopsDriverTwoP muNumDen:  [2]
Size: 2
validMu [2] true
true
Size: 2
validMu [2] true
muListBoolean, theList: [2]
0
[false, true, false, false, false]
LoopsDriverTwoPManager Exit 

                                                                                                              LoopsDriverTwoPmanager while loop false 3
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@483b79f5
LoopsDriverTwoP muNumDen:   [1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1]
Size: 3
validMu [1, 1, 1] true
true
Size: 3
validMu [1, 1, 1] true
muListBoolean, theList: [1, 1, 1]
0
1
2
[true, true, true, false, false]
                                                                                                              LoopsDriverTwoPmanager while loop false 2
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@46fc9e82
LoopsDriverTwoP muNumDen:   [2, 1]
LoopsDriverTwoP muNumDen:  [1, 2]
Size: 3
validMu [1, 2] true
true
Size: 3
validMu [1, 2] true
muListBoolean, theList: [1, 2]
0
1
[true, false, true, false, false]
                                                                                                              LoopsDriverTwoPmanager while loop false 1
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@42c31285
LoopsDriverTwoP muNumDen:   [3]
LoopsDriverTwoP muNumDen:  [3]
Size: 3
validMu [3] true
true
Size: 3
validMu [3] true
muListBoolean, theList: [3]
0
[false, false, true, false, false]
LoopsDriverTwoPManager Exit 


                                                                                                              LoopsDriverTwoPmanager while loop false 3
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@483b79f5
LoopsDriverTwoP muNumDen:   [1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1]
Size: 3
validMu [1, 1, 1] true
true
Size: 3
validMu [1, 1, 1] true
muListBoolean, theList: [1, 1, 1]
0
1
2
[true, true, true, false, false]
                                                                                                              LoopsDriverTwoPmanager while loop false 2
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@46fc9e82
LoopsDriverTwoP muNumDen:   [2, 1]
LoopsDriverTwoP muNumDen:  [1, 2]
Size: 3
validMu [1, 2] true
true
Size: 3
validMu [1, 2] true
muListBoolean, theList: [1, 2]
0
1
[true, false, true, false, false]
                                                                                                              LoopsDriverTwoPmanager while loop false 1
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@42c31285
LoopsDriverTwoP muNumDen:   [3]
LoopsDriverTwoP muNumDen:  [3]
Size: 3
validMu [3] true
true
Size: 3
validMu [3] true
muListBoolean, theList: [3]
0
[false, false, true, false, false]



                                                                                                             LoopsDriverTwoPmanager while loop false 7
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@6a6daa45
LoopsDriverTwoP muNumDen:   [1, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 1]
Size: 5
validMu [1, 1, 1, 1, 1] false
false
Size: 5
validMu [1, 1, 1, 1, 1] false
                                                                                                              LoopsDriverTwoPmanager while loop false 6
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@64aa4978
LoopsDriverTwoP muNumDen:   [2, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 2]
Size: 5
validMu [1, 1, 1, 2] false
false
Size: 5
validMu [1, 1, 1, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 5
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@6095c135
LoopsDriverTwoP muNumDen:   [2, 2, 1]
LoopsDriverTwoP muNumDen:  [1, 2, 2]
Size: 4
validMu [1, 2, 2] true
true
Size: 4
validMu [1, 2, 2] true
muListBoolean, theList: [1, 2, 2]
0
1
2
[true, false, true, true, false]
                                                                                                              LoopsDriverTwoPmanager while loop false 4
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@25974343
LoopsDriverTwoP muNumDen:   [3, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 3]
Size: 5
validMu [1, 1, 3] false
false
Size: 5
validMu [1, 1, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 3
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@222ffa36
LoopsDriverTwoP muNumDen:   [3, 2]
LoopsDriverTwoP muNumDen:  [2, 3]
Size: 4
validMu [2, 3] true
true
Size: 4
validMu [2, 3] true
muListBoolean, theList: [2, 3]
0
1
[false, true, false, true, false]
                                                                                                              LoopsDriverTwoPmanager while loop false 2
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@14f88682
LoopsDriverTwoP muNumDen:   [4, 1]
LoopsDriverTwoP muNumDen:  [1, 4]
Size: 5
validMu [1, 4] false
false
Size: 5
validMu [1, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 1
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@5aaa6141
LoopsDriverTwoP muNumDen:   [5]
LoopsDriverTwoP muNumDen:  [5]
Size: 5
validMu [5] false
false
Size: 5
validMu [5] false
LoopsDriverTwoPManager Exit 

                                                                                                              LoopsDriverTwoPmanager while loop false 11
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@10894ff2
LoopsDriverTwoP muNumDen:   [1, 1, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 1, 1]
Size: 6
validMu [1, 1, 1, 1, 1, 1] false
false
Size: 6
validMu [1, 1, 1, 1, 1, 1] false
                                                                                                              LoopsDriverTwoPmanager while loop false 10
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@1e4ea393
LoopsDriverTwoP muNumDen:   [2, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 2]
Size: 6
validMu [1, 1, 1, 1, 2] false
false
Size: 6
validMu [1, 1, 1, 1, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 9
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@1a712482
LoopsDriverTwoP muNumDen:   [2, 2, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 2, 2]
Size: 5
validMu [1, 1, 2, 2] false
false
Size: 5
validMu [1, 1, 2, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 8
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@5f73a9a8
LoopsDriverTwoP muNumDen:   [2, 2, 2]
LoopsDriverTwoP muNumDen:  [2, 2, 2]
Size: 4
validMu [2, 2, 2] true
true
Size: 4
validMu [2, 2, 2] true
muListBoolean, theList: [2, 2, 2]
0
1
2
[false, true, true, true, false]
                                                                                                              LoopsDriverTwoPmanager while loop false 7
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@55f8b6b
LoopsDriverTwoP muNumDen:   [3, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 3]
Size: 6
validMu [1, 1, 1, 3] false
false
Size: 6
validMu [1, 1, 1, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 6
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@6e66f268
LoopsDriverTwoP muNumDen:   [3, 3]
LoopsDriverTwoP muNumDen:  [3, 3]
Size: 4
validMu [3, 3] true
true
Size: 4
validMu [3, 3] true
muListBoolean, theList: [3, 3]
0
1
[false, false, true, true, false]
                                                                                                              LoopsDriverTwoPmanager while loop false 5
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@7da08e12
LoopsDriverTwoP muNumDen:   [3, 2, 1]
LoopsDriverTwoP muNumDen:  [1, 2, 3]
Size: 5
validMu [1, 2, 3] false
false
Size: 5
validMu [1, 2, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 4
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@3f5c56e7
LoopsDriverTwoP muNumDen:   [4, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 4]
Size: 6
validMu [1, 1, 4] false
false
Size: 6
validMu [1, 1, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 3
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@462196b4
LoopsDriverTwoP muNumDen:   [4, 2]
LoopsDriverTwoP muNumDen:  [2, 4]
Size: 5
validMu [2, 4] false
false
Size: 5
validMu [2, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 2
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@1f0dc9aa
LoopsDriverTwoP muNumDen:   [5, 1]
LoopsDriverTwoP muNumDen:  [1, 5]
Size: 6
validMu [1, 5] false
false
Size: 6
validMu [1, 5] false
                                                                                                              LoopsDriverTwoPmanager while loop false 1
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@66a40447
LoopsDriverTwoP muNumDen:   [6]
LoopsDriverTwoP muNumDen:  [6]
Size: 6
validMu [6] false
false
Size: 6
validMu [6] false
LoopsDriverTwoPManager Exit 

                                                                                                              LoopsDriverTwoPmanager while loop false 15
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@1c776cd
LoopsDriverTwoP muNumDen:   [1, 1, 1, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 1, 1, 1]
Size: 7
validMu [1, 1, 1, 1, 1, 1, 1] false
false
Size: 7
validMu [1, 1, 1, 1, 1, 1, 1] false
                                                                                                              LoopsDriverTwoPmanager while loop false 14
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@f009885
LoopsDriverTwoP muNumDen:   [2, 1, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 1, 2]
Size: 7
validMu [1, 1, 1, 1, 1, 2] false
false
Size: 7
validMu [1, 1, 1, 1, 1, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 13
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@b3f1dbd
LoopsDriverTwoP muNumDen:   [2, 2, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 2, 2]
Size: 6
validMu [1, 1, 1, 2, 2] false
false
Size: 6
validMu [1, 1, 1, 2, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 12
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@4e3d92be
LoopsDriverTwoP muNumDen:   [2, 2, 2, 1]
LoopsDriverTwoP muNumDen:  [1, 2, 2, 2]
Size: 5
validMu [1, 2, 2, 2] false
false
Size: 5
validMu [1, 2, 2, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 11
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@74f6f4aa
LoopsDriverTwoP muNumDen:   [3, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 3]
Size: 7
validMu [1, 1, 1, 1, 3] false
false
Size: 7
validMu [1, 1, 1, 1, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 10
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@7f399e01
LoopsDriverTwoP muNumDen:   [3, 3, 1]
LoopsDriverTwoP muNumDen:  [1, 3, 3]
Size: 5
validMu [1, 3, 3] false
false
Size: 5
validMu [1, 3, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 9
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@c18a6ae
LoopsDriverTwoP muNumDen:   [3, 2, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 2, 3]
Size: 6
validMu [1, 1, 2, 3] false
false
Size: 6
validMu [1, 1, 2, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 8
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@2e126df1
LoopsDriverTwoP muNumDen:   [3, 2, 2]
LoopsDriverTwoP muNumDen:  [2, 2, 3]
Size: 5
validMu [2, 2, 3] false
false
Size: 5
validMu [2, 2, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 7
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@6d028f3d
LoopsDriverTwoP muNumDen:   [4, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 4]
Size: 7
validMu [1, 1, 1, 4] false
false
Size: 7
validMu [1, 1, 1, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 6
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@5ef8cd0a
LoopsDriverTwoP muNumDen:   [4, 3]
LoopsDriverTwoP muNumDen:  [3, 4]
Size: 5
validMu [3, 4] false
false
Size: 5
validMu [3, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 5
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@171c2dad
LoopsDriverTwoP muNumDen:   [4, 2, 1]
LoopsDriverTwoP muNumDen:  [1, 2, 4]
Size: 6
validMu [1, 2, 4] false
false
Size: 6
validMu [1, 2, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 4
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@2a5cb75a
LoopsDriverTwoP muNumDen:   [5, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 5]
Size: 7
validMu [1, 1, 5] false
false
Size: 7
validMu [1, 1, 5] false
                                                                                                              LoopsDriverTwoPmanager while loop false 3
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@53deae4b
LoopsDriverTwoP muNumDen:   [5, 2]
LoopsDriverTwoP muNumDen:  [2, 5]
Size: 6
validMu [2, 5] false
false
Size: 6
validMu [2, 5] false
                                                                                                              LoopsDriverTwoPmanager while loop false 2
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@4b56b9a7
LoopsDriverTwoP muNumDen:   [6, 1]
LoopsDriverTwoP muNumDen:  [1, 6]
Size: 7
validMu [1, 6] false
false
Size: 7
validMu [1, 6] false
                                                                                                              LoopsDriverTwoPmanager while loop false 1
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@3dd19425
LoopsDriverTwoP muNumDen:   [7]
LoopsDriverTwoP muNumDen:  [7]
Size: 7
validMu [7] false
false
Size: 7
validMu [7] false
LoopsDriverTwoPManager Exit 
jdbc:neo4j:bolt://localhost
Connected to  database twotabledb1thread 
                                                                                         It is inside GaussCorrolation? 

                                                                                                              LoopsDriverTwoPmanager while loop false 22
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@41ba6491
LoopsDriverTwoP muNumDen:   [1, 1, 1, 1, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 1, 1, 1, 1]
Size: 8
validMu [1, 1, 1, 1, 1, 1, 1, 1] false
false
Size: 8
validMu [1, 1, 1, 1, 1, 1, 1, 1] false
                                                                                                              LoopsDriverTwoPmanager while loop false 21
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@4f7d82d6
LoopsDriverTwoP muNumDen:   [2, 1, 1, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 1, 1, 2]
Size: 8
validMu [1, 1, 1, 1, 1, 1, 2] false
false
Size: 8
validMu [1, 1, 1, 1, 1, 1, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 20
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@4b420fe1
LoopsDriverTwoP muNumDen:   [2, 2, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 2, 2]
Size: 7
validMu [1, 1, 1, 1, 2, 2] false
false
Size: 7
validMu [1, 1, 1, 1, 2, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 19
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@e4088ed
LoopsDriverTwoP muNumDen:   [2, 2, 2, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 2, 2, 2]
Size: 6
validMu [1, 1, 2, 2, 2] false
false
Size: 6
validMu [1, 1, 2, 2, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 18
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@1cccfb58
LoopsDriverTwoP muNumDen:   [2, 2, 2, 2]
LoopsDriverTwoP muNumDen:  [2, 2, 2, 2]
Size: 5
validMu [2, 2, 2, 2] false
false
Size: 5
validMu [2, 2, 2, 2] false
                                                                                                              LoopsDriverTwoPmanager while loop false 17
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@3f04a125
LoopsDriverTwoP muNumDen:   [3, 1, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 1, 3]
Size: 8
validMu [1, 1, 1, 1, 1, 3] false
false
Size: 8
validMu [1, 1, 1, 1, 1, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 16
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@64628c23
LoopsDriverTwoP muNumDen:   [3, 3, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 3, 3]
Size: 6
validMu [1, 1, 3, 3] false
false
Size: 6
validMu [1, 1, 3, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 15
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@6e6f77a2
LoopsDriverTwoP muNumDen:   [3, 2, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 2, 3]
Size: 7
validMu [1, 1, 1, 2, 3] false
false
Size: 7
validMu [1, 1, 1, 2, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 14
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@1502470c
LoopsDriverTwoP muNumDen:   [3, 3, 2]
LoopsDriverTwoP muNumDen:  [2, 3, 3]
Size: 5
validMu [2, 3, 3] false
false
Size: 5
validMu [2, 3, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 13
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@f95d100
LoopsDriverTwoP muNumDen:   [3, 2, 2, 1]
LoopsDriverTwoP muNumDen:  [1, 2, 2, 3]
Size: 6
validMu [1, 2, 2, 3] false
false
Size: 6
validMu [1, 2, 2, 3] false
                                                                                                              LoopsDriverTwoPmanager while loop false 12
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@7f664745
LoopsDriverTwoP muNumDen:   [4, 1, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 1, 4]
Size: 8
validMu [1, 1, 1, 1, 4] false
false
Size: 8
validMu [1, 1, 1, 1, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 11
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@6a21ed6c
LoopsDriverTwoP muNumDen:   [4, 4]
LoopsDriverTwoP muNumDen:  [4, 4]
Size: 5
validMu [4, 4] false
false
Size: 5
validMu [4, 4] false
     
         1 1 0 0 0

                                                                                                         LoopsDriverTwoPmanager while loop false 10
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@6d9cfd03
LoopsDriverTwoP muNumDen:   [4, 3, 1]
LoopsDriverTwoP muNumDen:  [1, 3, 4]
Size: 6
validMu [1, 3, 4] false
false
Size: 6
validMu [1, 3, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 9
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@4c202c61
LoopsDriverTwoP muNumDen:   [4, 2, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 2, 4]
Size: 7
validMu [1, 1, 2, 4] false
false
Size: 7
validMu [1, 1, 2, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 8
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@1b116cf
LoopsDriverTwoP muNumDen:   [4, 2, 2]
LoopsDriverTwoP muNumDen:  [2, 2, 4]
Size: 6
validMu [2, 2, 4] false
false
Size: 6
validMu [2, 2, 4] false
                                                                                                              LoopsDriverTwoPmanager while loop false 7
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@649ec118
LoopsDriverTwoP muNumDen:   [5, 1, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 1, 5]
Size: 8
validMu [1, 1, 1, 5] false
false
Size: 8
validMu [1, 1, 1, 5] false
                                                                                                              LoopsDriverTwoPmanager while loop false 6
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@6ee04c6d
LoopsDriverTwoP muNumDen:   [5, 3]
LoopsDriverTwoP muNumDen:  [3, 5]
Size: 6
validMu [3, 5] false
false
Size: 6
validMu [3, 5] false
                                                                                                              LoopsDriverTwoPmanager while loop false 5
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@23ee36f4
LoopsDriverTwoP muNumDen:   [5, 2, 1]
LoopsDriverTwoP muNumDen:  [1, 2, 5]
Size: 7
validMu [1, 2, 5] false
false
Size: 7
validMu [1, 2, 5] false
                                                                                                              LoopsDriverTwoPmanager while loop false 4
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@2ae04b28
LoopsDriverTwoP muNumDen:   [6, 1, 1]
LoopsDriverTwoP muNumDen:  [1, 1, 6]
Size: 8
validMu [1, 1, 6] false
false
Size: 8
validMu [1, 1, 6] false
                                                                                                              LoopsDriverTwoPmanager while loop false 3
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@3864c96d
LoopsDriverTwoP muNumDen:   [6, 2]
LoopsDriverTwoP muNumDen:  [2, 6]
Size: 7
validMu [2, 6] false
false
Size: 7
validMu [2, 6] false
                                                                                                              LoopsDriverTwoPmanager while loop false 2
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@540b7928
LoopsDriverTwoP muNumDen:   [7, 1]
LoopsDriverTwoP muNumDen:  [1, 7]
Size: 8
validMu [1, 7] false
false
Size: 8
validMu [1, 7] false
                                                                                                              LoopsDriverTwoPmanager while loop false 1
LoopsDriverTwoP muNumDen:   fractionintegerset.muNumDen@680bccb
LoopsDriverTwoP muNumDen:   [8]
LoopsDriverTwoP muNumDen:  [8]
Size: 8
validMu [8] false
false
Size: 8
validMu [8] false
LoopsDriverTwoPManager Exit 

let it fly and soon enough out of memory.....

so...

an iteration scheem...

in several degrees that is.....

memory does not like large dimension>5 setproduct>5 iterations. 
do need alternative scheme.  
and certainly does not like running fractioniterationdriveriterate in any case simultainusly.  

so....  

4/8

Latest narrative:

LoopsMain instanciates two threads.  

FractionIntegerDriverIterate is a thread defining
sets representing mu numbers.  A FIDI mu set is characterized
by the mu denominater.  Iterating across all numerators, for a range of
denominators, compleates a FIDI run.  It is to note though,  when paired
with LDTPM,  The interest is in the binary representation of mu, and not 
the fraction itself.      

LoopsDriverTwoPManager, the second thread, implements a Newton's difference 
algorithm described in the video link.  Each iteration in a LDTPM defines a set
of related P's each with determined/under determined sets of roots and the corrosponding
mu number defined by the roots.  Each set of P's along with relevant root sets and mu number
(in this case the mu fraction is significant) are written to the graph DB.     

The simple iteration of LoopsDriverTwoPManager is not a complete description of the 
difference space. It is not necessary to define a zero at a particular triag_i or for that matter
a set of triag's.  FIDI's binary mu sets (a power set of permutations) provide masks LDTPM applys
to thread iterations.  The P sets generated with masked iterations contribute the P space without
changing the specified parameters of Newton's difference algorithm.

Issues with FIDI and LDTPM integration:

Out of memory crash.  
The proposed remediation is uncouple the simultanious iterations.
FIDI is to write to mlGraph a simple list of nodes representing its
iteration output over a range of denominators.
LDTPN can querry for nextMask pattern.

Other issues:

FIDI seeds the iteration with a simple monomial. It is paramiterized with
"setProductRange" the furthest zero index to transform p.  PArray, the
setProductRange record during iteration, is initialized to zero.    
It needs to be able to append a prior iteration.  For a append setProductRange
iteration, pArray must be predefined, not as a zeroed array, but with the 
last complete setProductRange variable.  

The Gauss reduction result of the difference p at triag_i is imprecise.  
More to the point is implement the algebraic definition as P(x)-P(x-1).

Of graphic interest is interConnected triag_i p's wholy defined.

The sets are written to a buffer
shared with LoopsDriverTwoPManager.  

Runtime
parameters numeratorHigh,denominator are hard coded.  FIDI writes
to a buffer shared with LoopsDriverTwoPManager, also a thread.


4/9

The priority given to the mask.
Put a range of denominators on MLDB.


GenerateBinaryIterate populates muNumDen as

gbList.setGBList(new muNumDen(numerator,denominator,nextBigDecimal,((ArrayList)nBinaryList.get(0)).toString(),((ArrayList)nBinaryList.get(0)).size(),((ArrayList)nBinaryList.get(0))));

GaussTable1 has runFIDi method.
It loops through buffer with method call

goFidCypher(((BigDecimal)((muNumDen)dbbVector.get(0)).getMu()).toString(),((BigDecimal)((muNumDen)dbbVector.get(0)).getnumerator()).toString(),
            ((BigDecimal)((muNumDen)dbbVector.get(0)).getDenominator()).toString(),((String)((muNumDen)dbbVector.get(0)).getBString()),((muNumDen)dbbVector.get(0)).getbStringSize(),
            ((muNumDen)dbbVector.get(0)).getcenterIndex(),((muNumDen)dbbVector.get(0)).getverticalTranslateIndex());
 

public synchronized void goFidCypher(String mU, String numerator, String denominator,String nBinary,int nBinarySize,int centerIndex,int verticalTranslateIndex)  

it (the above) calls method

//   mergeEvaluate( mU, numerator,denominator,nBinary,nBinarySize,centerIndex,verticalTranslateIndex);

currently commented out.

Looks like: 

Include mergeEvaluate method with origonal signature or refactor current signature.
The verticalTranlateIndex is irrelevant to this build and is to be otherwise wiped
from library.

Did include mergeEvaluate with origonal signature.  goFidCypher updated.

Now,    

The typical LoopsMain implementing differences.

       FractionIntegerDriverIterate figI= new FractionIntegerDriverIterate(muList,muSem);     
//       GaussTable1 gTable1 = new GaussTable1(muSem,muList,figI);
  //     fig.start();
       figI.start();
//       gTable1.start();

                                      //  noBufferRun is boolean at end of signature true=noBuffer
                                      //  Looks like most current ldtpm
        // need both instances need both started.                              
 //      LoopsDriverTwoPManager lDriver= new LoopsDriverTwoPManager(muList,muSem,loopsLogic,tl1Semaphore,dbVector11,figI,tl1Semaphore,dbVector11,true);  
       LoopsDriverTwoPManager lDriver= new LoopsDriverTwoPManager(muList,muSem,loopsLogic,t11Semaphore,dbVector11,figI,t11Semaphore,dbVector11,false); 
       GaussTable1 gTable1 = new GaussTable1(t11Semaphore,dbVector11,lDriver);  
       lDriver.start();
       gTable1.start();

note: LoopsDriverTwoPManager needs reference to FractionIntegerDriverIterate for isAlive test within buffer loop.

      FractionIntegerDriverIterate has runGBBuffer(). It's run() loops through desired denominator sets.

So, configure LoopsMain to just run FIDI.
And maybe have mu numbers up to denominator=32.

And so, back in LoopsDriverTwoPManager.
Its run() method has a muNumDen buffer populated with FractionIntegerDriverIterate threads.

Need the ResultSet from MLGraph querry.
Only want to call GaussTable1 method and have ResultSet returned? ArrayListReturned??

 
LoopsMain needs a method for managing the newly written GaussTable1 method implementing
The muNumber querry. 

Now write the new GaussTable1 Method,

GaussTable1 is alive because either LoopsMain is alive or the buffer has objects.

Loops main has a reference to fractionIntegerDriverIterate as it wanted, in the prior build, 
to know if it was producing muNumbers.

That requirement is no longer necessary.  
The new requirement is a reference to GaussTable1 so that it can call a querry method.  
Otherwise,   just need to import the object not...

Take the reference to a started GaussTable1.
Can't mutually reference GaussTable1 and LoopsMain.

Need GaussTable1 method 

Public ResultSet muQuerry(int denominator) { 

      startConn();


       endConn();

}

Instead, looks like a DFScripts method.

DFScripts has a zero argument constructor
with a startConn() method call.


meaning endConn must be called from LoopsDriverTwoPManager.

Suppose it also means need ZADScripts on classpath.  

So...  All things concidered, work with GaussTable1.

But, for reference....


public ResultSet s3ARC(String rangeLow, String rangeHigh, String nMax, String dimension1, int rCounter)  {
//    this.startConn();
    System.out.println();
//    System.out.println("s3A" + rangeLow+" "+rangeHigh+" "+nMax+" "+dimension1+" "+dimension2+" "+dimension3+" "); 
    System.out.println();
    ResultSet rs=null;
    List valueList=new ArrayList(); 
    try
     {  
        s = conn.createStatement();
        statements.add(s);
        psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
        "     \n" +
        "RETURN aDegree,aScalar,pTD,iM,iN"); 
        statements.add(psInsert);
        psInsert.setString(1,rangeLow);
        psInsert.setString(2,rangeHigh);
        psInsert.setString(3,nMax);
        psInsert.setString(4,dimension1);
        psInsert.setInt(5,rCounter);
        psInsert.setString(6, dimension1);
        psInsert.setInt(7,rCounter);
        rs = psInsert.executeQuery();
        conn.commit();
     }
         catch (SQLException sqle)
        {
            printSQLException(sqle);
        }
        statements.remove(0);
        return(rs);
}



Next technical hurdle:

Want a range of denominators.
The resutSet will querry for one denominator at a time....


{"Value":"9","d":"4","size":2,"n":"3","nBinary":"[3, 1]"} 

Note size is not the same context used in LTPM.

suppose want n,d,nBianry.

Note nBinary is String.  Will need a decoder.


 {"Value":"9","d":"4","size":2,"n":"3","nBinary":"[3, 1]"}

public ResultSet muQuerry(int denominator)


LoopDriverTwoPManager.run() did, in prior build, define theList as .getBList from buffer.


public ResultSet muQuerry(int denominator) { 
    Integer denInt = new Integer(denominator);
    String denString = denInt.toString();
    startConn();

    ResultSet rs=null;
    try
     {  
        s = conn.createStatement();
        statements.add(s);
        psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
        "MATCH (e:Evaluate {d:?}\n" +
        "RETURN e.nBinary,e.n,e.d"); 
        statements.add(psInsert);
        psInsert.setString(1,denString);

        rs = psInsert.executeQuery();
        conn.commit();
     }
         catch (SQLException sqle)
        {
            printSQLException(sqle);
        }
        statements.remove(0);
         endConn();
        return(rs);
} 

public void run() {

    for (int x=32; x<33; x++) {
    this.denominator=x;
    this.numeratorHigh=x;    
    runGBpattern();
    System.out.println("X: "+x);
    }
}



How about if a retrieved bList is processed,  send it off to be deleted.

next start will not include it in return.

and maybe manage the gTable1 buffer with wait, notify....

so, in a kind of dumb way, querry for the entire resultSet.
only process one mask pattern.  
delete the node with pattern.

start again....

        Boolean hasRS = TRUE; 
        while ( hasRS ) {
        if (rs.next()) {
        Map rsMap = new HashMap();
        rsMap=((Map)rs.getObject(1));
        jSMapString =  new ObjectMapper().writeValueAsString(rsMap);
        System.out.println( new ObjectMapper().writeValueAsString(rsMap));
        pollLoop=false;
        } else {  hasRS=FALSE;}; //System.out.println("pollcounter:" + pollcounter++ );
      }


4/11

Implement limit 1 in gausstable1 querry.

4/12

Remember, FIDI does the iteration for a range of denominators.

muQuerry does return Limit 1 of querry.


muQuerry does return the query resultset as list.

let valueList, the resultSet transcribe, be a DriverTwoPManager ...
Do not need the boolean.  if no resultSet, then returned valuelist.isEmpty=true.

but will leave the boolean logic as is for now.  -though it is aparently unnecessary.

Part of the graph spiele is the first run of LDTPM is without a mask.

Need nBinary, from the resultset as a string written back as a list.
- got it on SO.  did refernce source in code.

Will have to run FIDI because testing LDTPM will need the deleteQuerry call.


private void muDelete(String nBinary) {

private List muQuerry(int denominator)

and muQuerry does not need denominator argument anyMore.


and FractionIntegerDriverIterate wrote a whole lot of nBinaries to MLGraph. 

private void createEvaluates(LoopList loopList,String vmResult) {

psInsert = conn.prepareStatement(" MATCH (e:Evaluate), (d:Dnode) WHERE e.Value = ? AND d.vmResult=? WITH d,e MERGE  (d)-[ee:Envalues]->(e)");

maybe FIDI does not want to write Evaluates.  Need a new Lable....  
"MuNumbers"

public synchronized void goFidCypher(String mU, String numerator, String denominator,String nBinary,int nBinarySize)  {

   mergeEvaluate( mU, numerator,denominator,nBinary,nBinarySize);
   
}

private List muListBoolean(ArrayList theList)  {
// does not need a parameter.

nBlist: [1]

[0, 0, 5, 2, 1, 0]

[5, 3, 2, 3, 1, 0]

[2, 6, 2, 3, 1, 0]

[1, 4, 4, 0, 3, 0]


maybe not quite....  
Need not writing redundant.
Need resultCounter correct.

"Merge (d:CreatedBy {resultId:?, wNum:?,pArray:?,translateIndex:?,pArrayIndexValue:?} )");

looks like unique resultID's will allow for skip pattern. 
As any zero in parry is or isnt a skip then need resultID context, is it greater than first iteration max?, 
to know if skip occured.

resultListID 16814

observe the skip and all things concidered with gausstable1 turned off.

4/13

Did reload graph dim=5.
Need skip run review without gausstable1.

   int fIDI=-1;   -  run with muListBoolean all false.
 
if (fIDI<1) { if (validMu((ArrayList)nBList)) noBufferRun((ArrayList)muListBoolean((ArrayList)nBList));

// set fIDI=0 and will limit 1 muNumber.

First off,  need FIDI run for muNumber population.

while looppey  14412
GaussBean1:   LoopLists.GaussBean1@610d0114 [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 14.999999999999893, -84.99999999999883, 224.9999999999955, -273.9999999999932, 119.99999999999659]pArrayIndexValue: 0evaluateValue: null
while looppey  14411
GaussBean1:   LoopLists.GaussBean1@14ff1ce7 [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 5.000000000000012, 9.999999999999854, 10.000000000000558, 4.999999999999147, 1.0000000000004263]pArrayIndexValue: 0evaluateValue: null
while looppey  14410
GaussBean1:   LoopLists.GaussBean1@2282eb83 [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 20.0, 60.0, 70.0, 30.0]pArrayIndexValue: 0evaluateValue: null
while looppey  14409
GaussBean1:   LoopLists.GaussBean1@4be5a95b [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 60.0, 180.0, 150.0]pArrayIndexValue: 0evaluateValue: null
while looppey  14408
GaussBean1:   LoopLists.GaussBean1@42690492 [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 120.0, 240.0]pArrayIndexValue: 0evaluateValue: null
while looppey  14407
GaussBean1:   LoopLists.GaussBean1@2e9d201c [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 0evaluateValue: null
while looppey  14406
GaussBean1:   LoopLists.GaussBean1@1bf608bf [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 1.000000000000138, -10.000000000002323, 35.00000000001434, -50.000000000040416, 24.000000000051458, -2.3192114895258118E-11]pArrayIndexValue: 0evaluateValue: null
while looppey  14405
GaussBean1:   LoopLists.GaussBean1@7d3fc5eb [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 4.999999999999999, -30.0, 55.0, -30.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  14404
GaussBean1:   LoopLists.GaussBean1@77f8034a [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 20.0, -60.0, 40.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  14403
GaussBean1:   LoopLists.GaussBean1@30a25069 [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 60.0, -60.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  14402
GaussBean1:   LoopLists.GaussBean1@1b3a0532 [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 120.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  14401
GaussBean1:   LoopLists.GaussBean1@18299b23 [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 0evaluateValue: null
while looppey  14400
GaussBean1:   LoopLists.GaussBean1@2f7c393f [0, 24, -50, 35, -10, 1] [0, 1, 0, 0, 0, 0] [0.0, 1.000000000000138, -10.000000000002323, 35.00000000001434, -50.000000000040416, 24.000000000051458, -2.3192114895258118E-11]pArrayIndexValue: 1evaluateValue: null
while looppey  14399
GaussBean1:   LoopLists.GaussBean1@dff05a1 [0, 24, -50, 35, -10, 1] [0, 1, 0, 0, 0, 0] [0.0, 4.999999999999999, -30.0, 55.0, -30.0, 0.0]pArrayIndexValue: 1evaluateValue: null
while looppey  14398
GaussBean1:   LoopLists.GaussBean1@46a792b9 [0, 24, -50, 35, -10, 1] [0, 1, 0, 0, 0, 0] [0.0, 20.0, -60.0, 40.0, -0.0]pArrayIndexValue: 1evaluateValue: null
while looppey  14397
GaussBean1:   LoopLists.GaussBean1@1283f9cd [0, 24, -50, 35, -10, 1] [0, 1, 0, 0, 0, 0] [0.0, 60.0, -60.0, 0.0]pArrayIndexValue: 1evaluateValue: null
while looppey  14396
GaussBean1:   LoopLists.GaussBean1@5cf88f63 [0, 24, -50, 35, -10, 1] [0, 1, 0, 0, 0, 0] [0.0, 120.0, -0.0]pArrayIndexValue: 1evaluateValue: null
while looppey  14395
GaussBean1:   LoopLists.GaussBean1@295f4b50 [0, 24, -50, 35, -10, 1] [0, 1, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 1evaluateValue: null
while looppey  14394
GaussBean1:   LoopLists.GaussBean1@53973698 [0, 24, -50, 35, -10, 1] [0, 2, 0, 0, 0, 0] [0.0, 1.000000000000138, -10.000000000002323, 35.00000000001434, -50.000000000040416, 24.000000000051458, -2.3192114895258118E-11]pArrayIndexValue: 2evaluateValue: null
while looppey  14393
GaussBean1:   LoopLists.GaussBean1@5ed7e0b6 [0, 24, -50, 35, -10, 1] [0, 2, 0, 0, 0, 0] [0.0, 4.999999999999999, -30.0, 55.0, -30.0, 0.0]pArrayIndexValue: 2evaluateValue: null
while looppey  14392
GaussBean1:   LoopLists.GaussBean1@464cff98 [0, 24, -50, 35, -10, 1] [0, 2, 0, 0, 0, 0] [0.0, 20.0, -60.0, 40.0, -0.0]pArrayIndexValue: 2evaluateValue: null
while looppey  14391
GaussBean1:   LoopLists.GaussBean1@151a39ca [0, 24, -50, 35, -10, 1] [0, 2, 0, 0, 0, 0] [0.0, 60.0, -60.0, 0.0]pArrayIndexValue: 2evaluateValue: null
while looppey  14390
GaussBean1:   LoopLists.GaussBean1@7fd3ee07 [0, 24, -50, 35, -10, 1] [0, 2, 0, 0, 0, 0] [0.0, 120.0, -0.0]pArrayIndexValue: 2evaluateValue: null
while looppey  14389
GaussBean1:   LoopLists.GaussBean1@1ee0731b [0, 24, -50, 35, -10, 1] [0, 2, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 2evaluateValue: null
while looppey  14388
GaussBean1:   LoopLists.GaussBean1@3f71ff60 [0, 24, -50, 35, -10, 1] [0, 3, 0, 0, 0, 0] [0.0, 1.000000000000138, -10.000000000002323, 35.00000000001434, -50.000000000040416, 24.000000000051458, -2.3192114895258118E-11]pArrayIndexValue: 3evaluateValue: null
while looppey  14387
GaussBean1:   LoopLists.GaussBean1@7b61452d [0, 24, -50, 35, -10, 1] [0, 3, 0, 0, 0, 0] [0.0, 4.999999999999999, -30.0, 55.0, -30.0, 0.0]pArrayIndexValue: 3evaluateValue: null
while looppey  14386
GaussBean1:   LoopLists.GaussBean1@1ba22f90 [0, 24, -50, 35, -10, 1] [0, 3, 0, 0, 0, 0] [0.0, 20.0, -60.0, 40.0, -0.0]pArrayIndexValue: 3evaluateValue: null
while looppey  14385
GaussBean1:   LoopLists.GaussBean1@6c7ef54 [0, 24, -50, 35, -10, 1] [0, 3, 0, 0, 0, 0] [0.0, 60.0, -60.0, 0.0]pArrayIndexValue: 3evaluateValue: null
while looppey  14384
GaussBean1:   LoopLists.GaussBean1@36fd8a13 [0, 24, -50, 35, -10, 1] [0, 3, 0, 0, 0, 0] [0.0, 120.0, -0.0]pArrayIndexValue: 3evaluateValue: null
while looppey  14383
GaussBean1:   LoopLists.GaussBean1@4744e9cc [0, 24, -50, 35, -10, 1] [0, 3, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 3evaluateValue: null
while looppey  14382
GaussBean1:   LoopLists.GaussBean1@4d10801b [0, -96, -50, 35, -10, 1] [0, 4, 0, 0, 0, 0] [0.0, 0.9999999999994486, -9.999999999990706, 34.999999999942645, -49.99999999983834, -96.00000000020583, 9.276845958103247E-11]pArrayIndexValue: 4evaluateValue: null
while looppey  14381



while looppey  100848
GaussBean1:   LoopLists.GaussBean1@5eb327ee [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 14.999999999999893, -84.99999999999883, 224.9999999999955, -273.9999999999932, 119.99999999999659]pArrayIndexValue: 0evaluateValue: null
while looppey  100847
GaussBean1:   LoopLists.GaussBean1@6cee183 [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 5.000000000000012, 9.999999999999854, 10.000000000000558, 4.999999999999147, 1.0000000000004263]pArrayIndexValue: 0evaluateValue: null
while looppey  100846
GaussBean1:   LoopLists.GaussBean1@506bc734 [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 20.0, 60.0, 70.0, 30.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100845
GaussBean1:   LoopLists.GaussBean1@7091e8aa [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 60.0, 180.0, 150.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100844
GaussBean1:   LoopLists.GaussBean1@375a3d01 [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 120.0, 240.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100843
GaussBean1:   LoopLists.GaussBean1@46e90090 [0, 0, 0, 0, 0, 1] [0, 0, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100842
GaussBean1:   LoopLists.GaussBean1@48b53d1e [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 1.000000000000138, -10.000000000002323, 35.00000000001434, -50.000000000040416, 24.000000000051458, -2.3192114895258118E-11]pArrayIndexValue: 0evaluateValue: null
while looppey  100841
GaussBean1:   LoopLists.GaussBean1@379e581a [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 4.999999999999999, -30.0, 55.0, -30.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100840
GaussBean1:   LoopLists.GaussBean1@51cac9dd [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 20.0, -60.0, 40.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100839
GaussBean1:   LoopLists.GaussBean1@5f29aef4 [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 60.0, -60.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100838
GaussBean1:   LoopLists.GaussBean1@3e9535c2 [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 120.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100837
GaussBean1:   LoopLists.GaussBean1@7b8ef482 [0, 24, -50, 35, -10, 1] [0, 0, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100836
GaussBean1:   LoopLists.GaussBean1@7c0d4e0f [0, 24, -50, 35, -10, 1] [1, 0, 0, 0, 0, 0] [0.0, 1.000000000000138, -10.000000000002323, 35.00000000001434, -50.000000000040416, 24.000000000051458, -2.3192114895258118E-11]pArrayIndexValue: 0evaluateValue: null
while looppey  100835
GaussBean1:   LoopLists.GaussBean1@6e410174 [0, 24, -50, 35, -10, 1] [1, 0, 0, 0, 0, 0] [0.0, 4.999999999999999, -30.0, 55.0, -30.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100834
GaussBean1:   LoopLists.GaussBean1@796d025b [0, 24, -50, 35, -10, 1] [1, 0, 0, 0, 0, 0] [0.0, 20.0, -60.0, 40.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100833
GaussBean1:   LoopLists.GaussBean1@75cbd310 [0, 24, -50, 35, -10, 1] [1, 0, 0, 0, 0, 0] [0.0, 60.0, -60.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100832
GaussBean1:   LoopLists.GaussBean1@63209690 [0, 24, -50, 35, -10, 1] [1, 0, 0, 0, 0, 0] [0.0, 120.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100831
GaussBean1:   LoopLists.GaussBean1@58c6121 [0, 24, -50, 35, -10, 1] [1, 0, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100830
GaussBean1:   LoopLists.GaussBean1@1462c411 [0, 24, -50, 35, -10, 1] [2, 0, 0, 0, 0, 0] [0.0, 1.000000000000138, -10.000000000002323, 35.00000000001434, -50.000000000040416, 24.000000000051458, -2.3192114895258118E-11]pArrayIndexValue: 0evaluateValue: null
while looppey  100829
GaussBean1:   LoopLists.GaussBean1@3f1ad6de [0, 24, -50, 35, -10, 1] [2, 0, 0, 0, 0, 0] [0.0, 4.999999999999999, -30.0, 55.0, -30.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100828
GaussBean1:   LoopLists.GaussBean1@586943bb [0, 24, -50, 35, -10, 1] [2, 0, 0, 0, 0, 0] [0.0, 20.0, -60.0, 40.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100827
GaussBean1:   LoopLists.GaussBean1@3e8aa4fe [0, 24, -50, 35, -10, 1] [2, 0, 0, 0, 0, 0] [0.0, 60.0, -60.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100826
GaussBean1:   LoopLists.GaussBean1@3c4aad72 [0, 24, -50, 35, -10, 1] [2, 0, 0, 0, 0, 0] [0.0, 120.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100825
GaussBean1:   LoopLists.GaussBean1@558f3003 [0, 24, -50, 35, -10, 1] [2, 0, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100824
GaussBean1:   LoopLists.GaussBean1@47e9c592 [0, 24, -50, 35, -10, 1] [3, 0, 0, 0, 0, 0] [0.0, 1.000000000000138, -10.000000000002323, 35.00000000001434, -50.000000000040416, 24.000000000051458, -2.3192114895258118E-11]pArrayIndexValue: 0evaluateValue: null
while looppey  100823
GaussBean1:   LoopLists.GaussBean1@2c2f24c5 [0, 24, -50, 35, -10, 1] [3, 0, 0, 0, 0, 0] [0.0, 4.999999999999999, -30.0, 55.0, -30.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100822
GaussBean1:   LoopLists.GaussBean1@45e72d0f [0, 24, -50, 35, -10, 1] [3, 0, 0, 0, 0, 0] [0.0, 20.0, -60.0, 40.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100821
GaussBean1:   LoopLists.GaussBean1@69440298 [0, 24, -50, 35, -10, 1] [3, 0, 0, 0, 0, 0] [0.0, 60.0, -60.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100820
GaussBean1:   LoopLists.GaussBean1@60088f77 [0, 24, -50, 35, -10, 1] [3, 0, 0, 0, 0, 0] [0.0, 120.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100819
GaussBean1:   LoopLists.GaussBean1@35d486bf [0, 24, -50, 35, -10, 1] [3, 0, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100818
GaussBean1:   LoopLists.GaussBean1@49274a5f [0, 24, -50, 35, -10, 1] [4, 0, 0, 0, 0, 0] [0.0, 1.000000000000138, -10.000000000002323, 35.00000000001434, -50.000000000040416, 24.000000000051458, -2.3192114895258118E-11]pArrayIndexValue: 0evaluateValue: null
while looppey  100817
GaussBean1:   LoopLists.GaussBean1@bec121 [0, 24, -50, 35, -10, 1] [4, 0, 0, 0, 0, 0] [0.0, 4.999999999999999, -30.0, 55.0, -30.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100816
GaussBean1:   LoopLists.GaussBean1@24e98576 [0, 24, -50, 35, -10, 1] [4, 0, 0, 0, 0, 0] [0.0, 20.0, -60.0, 40.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100815
GaussBean1:   LoopLists.GaussBean1@35191e2a [0, 24, -50, 35, -10, 1] [4, 0, 0, 0, 0, 0] [0.0, 60.0, -60.0, 0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100814
GaussBean1:   LoopLists.GaussBean1@469fdf64 [0, 24, -50, 35, -10, 1] [4, 0, 0, 0, 0, 0] [0.0, 120.0, -0.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100813
GaussBean1:   LoopLists.GaussBean1@30deb95f [0, 24, -50, 35, -10, 1] [4, 0, 0, 0, 0, 0] [0.0, 120.0]pArrayIndexValue: 0evaluateValue: null
while looppey  100812
GaussBean1:   L


ValueList: []
[[1], 1, 1]
MuQuerry hasRS: false
nBinary.toList[1]
nBlist: [1]
LoopsDriverTwoP nBList reverse:  [1]
true


sht....  forgot to manage resultCounter....



So, muQuerry can be refactord to return the appropriate powerset.
the auxiliary method isValidMu can be part of the cypher script.


dimension = 5 no skip run:

resultListID 16813
LoopListener.pArrayIncrement pre pArray .to string [0, 0, 0, 0, 0, 1] wNum: 5  rListIndex: 6
LoopSemaphoreLast pre .return
service.take Loops Semaphore  last20


skip 1 resultListID inital 20000

resultListID 22407
LoopListener.pArrayIncrement pre pArray .to string [0, 0, 0, 0, 0, 0] wNum: 5  rListIndex: 6
                                                              PolynomialArray.incrementP   pArray:   [0, 0, 0, 0, 0, 0]
                                                              PolynomiaArray.increment index:   5
LoopSemaphoreLast pre .return
service.take Loops Semaphore  last58



skip 2
private  ResultListID resultListId=new ResultListID(25000);
[[2], 2, 2]

resultListID 25350

nBlist: [2]
private  ResultListID resultListId=new ResultListID(26000);
resultListID 28408


private  ResultListID resultListId=new ResultListID(30000);
resultListID 30055
[[1, 1, 1], 1, 3]


private  ResultListID resultListId=new ResultListID(31000);
resultCounter: 31351

private  ResultListID resultListId=new ResultListID(32000);
resultListID 34407

private  ResultListID resultListId=new ResultListID(36000);
resultListID 36013


4/14

private  ResultListID resultListId=new ResultListID(37000);
resultListID 37049

private  ResultListID resultListId=new ResultListID(38000);
resultListID 38350

private  ResultListID resultListId=new ResultListID(39000);
resultListID 39350

private  ResultListID resultListId=new ResultListID(40000);
resultListID 42408

private  ResultListID resultListId=new ResultListID(43000);
resultListID 43049

private  ResultListID resultListId=new ResultListID(44000);
resultListID 44343

private  ResultListID resultListId=new ResultListID(45000);
resultListID 45056

private  ResultListID resultListId=new ResultListID(46000);
resultListID 46345

private  ResultListID resultListId=new ResultListID(47000);


Maybe all good.  Think the skip pattern iterated compleatly.

Do want to know if skipping did reveal any new zeros....

 
From 4/8:

Latest narrative:

LoopsMain instanciates two threads.  

FractionIntegerDriverIterate is a thread defining
sets representing mu numbers.  A FIDI mu set is characterized
by the mu denominater.  Iterating across all numerators, for a range of
denominators, compleates a FIDI run.  It is to note though,  when paired
with LDTPM,  The interest is in the binary representation of mu, and not 
the fraction itself.      

LoopsDriverTwoPManager, the second thread, implements a Newton's difference 
algorithm described in the video link.  Each iteration in a LDTPM defines a set
of related P's each with determined/under determined sets of roots and the corrosponding
mu number defined by the roots.  Each set of P's along with relevant root sets and mu number
(in this case the mu fraction is significant) are written to the graph DB.     

The simple iteration of LoopsDriverTwoPManager is not a complete description of the 
difference space. It is not necessary to define a zero at a particular triag_i or for that matter
a set of triag's.  FIDI's binary mu sets (a power set of permutations) provide masks LDTPM applys
to thread iterations.  The P sets generated with masked iterations contribute the P space without
changing the specified parameters of Newton's difference algorithm.

Issues with FIDI and LDTPM integration:

Out of memory crash.  
The proposed remediation is uncouple the simultanious iterations.
FIDI is to write to mlGraph a simple list of nodes representing its
iteration output over a range of denominators.
LDTPN can querry for nextMask pattern.

Other issues:

FIDI seeds the iteration with a simple monomial. It is paramiterized with
"setProductRange" the furthest zero index to transform p.  PArray, the
setProductRange record during iteration, is initialized to zero.    
It needs to be able to append a prior iteration.  For a append setProductRange
iteration, pArray must be predefined, not as a zeroed array, but with the 
last complete setProductRange variable.  

The Gauss reduction result of the difference p at triag_i is imprecise.  
More to the point is implement the algebraic definition as P(x)-P(x-1).

Of graphic interest is interConnected triag_i p's wholy defined.

The sets are written to a buffer
shared with LoopsDriverTwoPManager.  

Runtime
parameters numeratorHigh,denominator are hard coded.  FIDI writes
to a buffer shared with LoopsDriverTwoPManager, also a thread.

So, muQuerry can be refactord to return the appropriate powerset.
the auxiliary method isValidMu can be part of the cypher script.

here is an idea:  a node with current resultlistId can be querried and updated from from run to run.

Also,  number of zeros by wNum table.

origonally:
match (c:CreatedBy {pArray:'[1, 0, 2, 0]'}) -[]-(d:Dnode) return c,d

as in worker0 should have max=5 zeros.
            1                 4
            2                 3
            3                 2
            2                 1
            1                 0

Now:
match (c:CreatedBy {wNum:5}) -[]-(d:Dnode) return d.totalZero

match (c:CreatedBy {wNum:1}) -[]-(d:Dnode {totalZero:2}) return d



4/16

4/19

https://www.youtube.com/watch?v=SUH1ecTgU3g


4/20

Today GraphSage.  need a backup of mlGraph.


neo4j-admin dump/load –- used for performing offline dump and load operations. The database to be dumped must be in offline mode.
This dump command is suitable for environments, where downtime is not a factor. It is faster than the backup command, and produces
an archive file, which occupies less space than a normal database structure.




https://www.youtube.com/watch?v=THW1vyCeVjs

4/22

Note:  a lot to say about projecting a Neo4j into an in memory graph.

Neo4j GraphSage:

Create in memory graph.
Train in memory graph.
Stream/Mutate/Write imbedding

A downstream task such as Node Classification:


The protein nodes also contain a secondary label that could be either Train or Test.
With the help of the secondary label, you can easily perform the train-test data split.


https://cs.stanford.edu/people/jure/pubs/graphsage-nips17.pdf


4/23


Issue roundup:

Have seed P.
pArray initialized to zero vector.  Increments to parameter.

Want to append. 
Believe Use same seed, initialize to arbitrary first vector,
and update stop parameter.

Want a node property mltype[train,test]

Writing a fine grained subgraph as set skip
pattern and append script.

Need backup 

Perform the above from last.


A useful ZAD.jar

Seems easy to set mlType property during graph build.
And to read dNode.pArray.


LDTPM reads nBinary

Want to read parray.

looks like a DfScrips kind of method.

looks better like a cypher script.

And remember, pArray is a string.   - found cypher on SO.

note CreatedBy.pArray_i in filter and CreatedBy.pArray_j not
will not simply partition graph. They can both point to the same
Dnode.

More complicated querry.

There is the task of with createdby,dnode in partition
and ...

Where is it surjective?                 >1.
Where is it injective?  when totalZeroes=1.

 (:CreatedBy) - [] -> (:Dnode) is not necessarily injective.


Can Return the [:zMap] pairs.


Have the constant vmResult=constant term.


MATCH p=()-[r:zMap]->() RETURN p LIMIT 25


(:CreatedBy {wNum})

MATCH (c:CreatedBy)  RETURN DISTINCT c.wNum  

╒════════╕
│"c.wNum"│
╞════════╡
│2       │
├────────┤
│3       │
├────────┤
│4       │
├────────┤
│5       │
├────────┤
│0       │
├────────┤
│1       │
└────────┘

MATCH (c:CreatedBy {wNum:5}) - [] -> (d:Dnode)
RETURN c,d


MATCH (c:CreatedBy {wNum:5})<-[r:CreatedBye]-(d) RETURN c,d LIMIT 25

5 is max wNum and there is only one node.


MATCH (c:CreatedBy {wNum:5})<-[r:CreatedBye]-(d) RETURN d LIMIT 25

MATCH (c:CreatedBy {wNum:5})<-[r:CreatedBye]-(d) - [:zMap] -> (dd)  RETURN d,dd 

One hop:

MATCH (c:CreatedBy {wNum:5})<-[r:CreatedBye]-(d) - [:zMap] -> (dd)  - [:zMap] -> (ddd) RETURN d,dd,ddd

Two hop:

MATCH (c:CreatedBy {wNum:5})<-[r:CreatedBye]-(d) - [:zMap*1..2] -> (dd) RETURN d,dd  - real dicey memory wise.

Concluding,  is a scheme for test train. 

Implement "One hop".

Take first count(dd)/2 as train.
     second            as test.

The lab:    

MATCH (c:CreatedBy {wNum:5})<-[r:CreatedBye]-(d) RETURN c,d LIMIT 25

Needs some embellisment.

pArray becomes a list.  
are interested in wNum=4 andd the corrosponding pArray index. 

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
//RETURN pArrayS LIMIT 100
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
RETURN pArrayN

WITH [str in pArrayN | toInteger(str)] as pArrayNN
RETURN pArrayNN Limit 100

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
//RETURN pArrayS LIMIT 100
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
//RETURN pArrayN

WITH [str in pArrayN | str] as pArrayNN
RETURN pArrayNN Limit 100

looks like an error with pArray.  there is a leading space for what reason??



MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
UNWIND split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArraySS
WITH trim(pArraySS) AS pArraySSS
WITH COLLECT(toInteger(pArraySSS) AS pArrayI
RETURN pArrayI LIMIT 100

With substring(pArraySS,0,1) AS testS
Return testS

RETURN pArrayN

trim(original)


CASE WHEN substring(pArraySS,1,1)=' ' THEN  substring(pArraySS,0,1) ELSE toString(vvScalar) END


MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
UNWIND split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArraySS
WITH trim(pArraySS) AS pArraySSS
WITH COLLECT(toInteger(pArraySSS)) AS pArrayI
RETURN pArrayI LIMIT 100


MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
//RETURN pArrayS LIMIT 100
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
//RETURN pArrayN
WITH [str in pArrayN | toInteger(trim(str)] as pArrayNN
RETURN pArrayNN Limit 100

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
//RETURN pArrayS LIMIT 100
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
//RETURN pArrayN
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN

WITH pArrayNN[size(pArrayNN)-2] as pElement

RETURN pElement limit 100

WITH [num in pArrayNN WHERE            ]

RETURN pArrayNN Limit 100

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN
WITH pArrayNN[size(pArrayNN)-2] as pElement
RETURN pElement limit 100

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=2 END as pElement,c
RETURN pElement,c

WITH [x in pArrayNN[size(pArrayNN)-2] WHERE x=2] as px

RETURN px limit 100     ]

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
//WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=1 THEN pArrayNN[size(pArrayNN)-2]   END as pElement,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=1 THEN c End as cc
return cc
//RETURN pElement,c

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
//WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=1 THEN pArrayNN[size(pArrayNN)-2]   END as pElement,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=1 THEN c End as cc
WITH cc WHERE cc IS NOT null 
return cc

// filters for wNum:34 the constan in third with clause.

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=3 THEN c End as cc
WITH cc WHERE cc IS NOT null 
return cc


MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=3 THEN c End as cc
WITH cc WHERE cc IS NOT null 
//return cc
MATCH (cc:CreatedBy)<-[r:CreatedBye]-(d) RETURN dd

RETURN pElement limit 100

4/26

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
//WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=4 THEN c End as cc
WITH CASE WHEN pArrayNN[size(pArrayNN)-2] IN [1, 2, 3] THEN c End as cc
WITH cc WHERE cc IS NOT null 
//return cc
MATCH (cc:CreatedBy)<-[r:CreatedBye]-(d) RETURN d


Apr dialog

New FractionIntegerDriverIterate use case:
   Iterate a range of denominators.  Whenever
MuNumDen is in size Dimension argument LoopsDriverTwoP
with skip pattern.  Involved populating MLGraph with FIDI output
and LDTPM methods for RETURN-ing MND nodes one at a time.
MLGraph has a complete population.

Have the apr2021 4/5 question.
                 4/8 narrative.

"nBinary":"[3, 1]"            decoder
pArray:'[5, 0, 0, 1, 4, 0]'   decoder

4/14 run narrative.
And how to actually run zad these days.

Have archive graph on Spinning drive.



Today, work on "pave".

match (c:CreatedBy {pArray:'[5, 0, 0, 1, 4, 0]'}) -[]-(d:Dnode) return c,d

MATCH p=()-[r:zMap]->() RETURN p LIMIT 25

MATCH (c:CreatedBy {wNum:5}) - [] -> (d:Dnode)
RETURN c,d

MATCH (c:CreatedBy {wNum:5})<-[r:CreatedBye]-(d) - [:zMap*1..2] -> (dd) RETURN d,dd  - real dicey memory wise.

MATCH (c:CreatedBy {wNum:5})<-[r:CreatedBye]-(d) RETURN c,d LIMIT 25

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2] IN [1, 2, 3] THEN c End as cc
WITH cc WHERE cc IS NOT null 
MATCH (cc:CreatedBy)<-[r:CreatedBye]-(d) RETURN d

Appropriate pArray interpretation can "pave" MLGraph.

Have the above narration as:

   wNum:4 pattern returns the set of dNodes identifing linears
as s=pArray[last-1]. The linear dNodes can wholy partition MLGraph
because s, dNode.vmResult are bijective.  The bijection is 
not true for s=pArray[last-n] when n>1 because p's represented are at least 
quadratics with s and s'  pointing to same p. 

Problem above is only those nodes in wNum:4 pattern is in the proper bijection.
hops up from linears maybe have vmResult from different CreatedBy. 

MATCH (d:Dnode), (k:CreatedBy) WHERE d.vmResult=? AND k.resultId=? AND k.wNum=? 
AND k.translateIndex=? AND k.pArrayIndexValue=? WITH d,k MERGE  (d)-[ee:CreatedBye]->(k)

match  (d:Dnode)-[:CreatedBye]->(c:CreatedBy {resultId:? , wNum:?}) , 
(dd:Dnode)-[:CreatedBye]->(cc:CreatedBy {resultId:? , wNum:?}) MERGE (d)-[:zMap]->(dd)

  worker 0  1  2  3  4  5
pArray:'[5, 0, 0, 1, 4, 0]'
     
         *,*,*,1,3,0
         *,*,*,6,3,0  together identify a quadratic at triag_3 (worker 3)

               1,4,0 
               8,4,0 roots at 1,6 is different quadratic than quadratic with roots at 1,8,

Maybe say something like from wHigh to wLow uniqueness when....
so if workNum p is underdetermined than the determined one with different 
Remember, want to do things like map seed p to p.

4/27

logistic regression  predict a zero or a one from the data.

have simple regression, multiple regression.

the sigmoid function and solve for y...

the probability is y.  
but want predict the y value.

The concepts

dataframe different columns storing text feature vectors,true labels 
and predictions

Transformer  algorithm transform one dataframe into another dataframe.

Estimator algorithm which can be fit on a dataframe to produce a transformer
   a learning algorithm is an estimator which trains on a dataframe and
produces a model

pipeline  chains multiple transformers and estimators together to specify
an ml workflow.

predict owns.car - response

have continuous feature income.
have categorical features state, gender.

org.apache.spark.ml.feature.{OneHotEncoder,StringIndexer}
org.apache.spar.ml.classification.logisticRegression

the atom editor - this time...

feature engineering a feature from a feature column.

dataframes for machine learing.

and of course spark programming guides machine learning library 


stringIndexer catagoryIndex
genderIndexer

find the optimal coefficients for the regerssion,
buzz word compliant 


looks like spark should be developed in eclipse.

https://en.wikipedia.org/wiki/One-hot


three big classes 
spark.ml.feature.{VectorAssembler,StringIndexer,VectorIndexer,OneHotEncoder.}
spark.ml.linalg.Vectors

the confusion matrix...


4/28 

Arbitrary power set of roots of dimension d represented
as an arbitrary set of polynomials (determined/underdetermined).

aggregate and treeAggregate.

max out clustering.

pipeline functions

logistic regression is easier.

mixin trait scala

RatingClassificationTransormer extends Transformer with DefaltParsWriteable

override def copy
override def transform
override val uid ...


4/29

These java commands populate the typical TwoPolynomials 
to the arbitrary degreed p as argumented. 

java -jar TwoPolynomialGenerator.jar test.csv 8 2 9      67   
java -jar TwoPolynomialGenerator.jar test.csv 16 2 17    240
java -jar TwoPolynomialGenerator.jar test.csv 32 2 33    845 
java -jar TwoPolynomialGenerator.jar test.csv 64 2 65    3082 

java -jar TwoPolynomialGenerator.jar test.csv 10 2 11      3134        
java -jar TwoPolynomialGenerator.jar test.csv 100 2 101    8361
java -jar TwoPolynomialGenerator.jar test.csv 1000 2 101   13607     
java -jar TwoPolynomialGenerator.jar test.csv 10000 2 101  18853 

java -jar ZADScripts.jar 2 8 8 2    47881 
java -jar ZADScripts.jar 2 8 8 8    48289
java -jar ZADScripts.jar 2 8 8 16                     
java -jar ZADScripts.jar 2 8 8 32   49828

java -jar ZADScripts.jar 2 13 16 2   55168      
java -jar ZADScripts.jar 2 13 16 8   57209   
java -jar ZADScripts.jar 2 13 16 16  61469                  
java -jar ZADScripts.jar 2 13 16 32  71501

java -jar ZADScripts.jar 2 13 32 2   76841        
java -jar ZADScripts.jar 2 13 32 8   78881   
java -jar ZADScripts.jar 2 13 32 16  83141                  
java -jar ZADScripts.jar 2 13 32 32  93173

java -jar ZADScripts.jar 2 13 64 2   98513          
java -jar ZADScripts.jar 2 13 64 8   100,553      
java -jar ZADScripts.jar 2 13 64 16  103787                  
java -jar ZADScripts.jar 2 13 64 32  103787

chdir JavaProjects\TwoPolynomialGeneratorK\dist
java -jar TwoPolynomialGenerator.jar test.csv 10000 2 17  105009

java -jar ZADScripts.jar 2 8 10000 2    116164
java -jar ZADScripts.jar 2 8 10000 8    118752
java -jar ZADScripts.jar 2 8 10000 16   117724                     
java -jar ZADScripts.jar 2 8 10000 32   119388


With a seed p, ZerosAndDifferences (not yet a jar) does write out a Newtons Root Graph.
Want a seed selected from TwoPolynomial graph for ZerosAndDifferences graph.  

Note only concerned with setProductRange=Dimension (the power set of dimension many set).

The scope of a complete ZerosAndDifferences graph is firstly 
the complete set of fractions for seed p evaluate exists?
Secondly, the power set is complete?  
Thirdly, can it map to itself?

The ZerosAndDifferences jar:

args[] 
 .select a twoPolynomial 
 .select a moninomial of degeree d (scalar,max degree).

Latest narrative:

LoopsMain instanciates two threads.  

FractionIntegerDriverIterate is a thread defining
sets representing mu numbers.  A FIDI mu set is characterized
by the mu denominater.  Iterating across all numerators, for a range of
denominators, compleates a FIDI run.  It is to note though,  when paired
with LDTPM,  The interest is in the binary representation of mu, and not 
the fraction itself.      

LoopsDriverTwoPManager, the second thread, implements a Newton's difference 
algorithm described in the video link.  Each iteration in a LDTPM defines a set
of related P's each with determined/under determined sets of roots and the corrosponding
mu number defined by the roots.  Each set of P's along with relevant root sets and mu number
(in this case the mu fraction is significant) are written to the graph DB.     

The simple iteration of LoopsDriverTwoPManager is not a complete description of the 
difference space. It is not necessary to define a zero at a particular triag_i or for that matter
a set of triag's.  FIDI's binary mu sets (a power set of permutations) provide masks LDTPM applys
to thread iterations.  The P sets generated with masked iterations contribute the P space without
changing the specified parameters of Newton's difference algorithm.                                 //  last sentence wonky.

Issues with FIDI and LDTPM integration:

Out of memory crash.  
The proposed remediation is uncouple the simultanious iterations.
FIDI is to write to mlGraph a simple list of nodes representing its
iteration output over a range of denominators.
LDTPN can querry for nextMask pattern.

Other issues:

FIDI seeds the iteration with a simple monomial. It is paramiterized with
"setProductRange" the furthest zero index to transform p.  PArray, the
setProductRange record during iteration, is initialized to zero.    
It needs to be able to append a prior iteration.  For a append setProductRange
iteration, pArray must be predefined, not as a zeroed array, but with the 
last complete setProductRange variable.  

The Gauss reduction result of the difference p at triag_i is imprecise.  
More to the point is implement the algebraic definition as P(x)-P(x-1).

Of graphic interest is interConnected triag_i p's wholy defined.

The sets are written to a buffer
shared with LoopsDriverTwoPManager.  

Runtime
parameters numeratorHigh,denominator are hard coded.  FIDI writes
to a buffer shared with LoopsDriverTwoPManager, also a thread.








































The Sigillum Dei is a late-13th century amulet composed of two circles, a pentagram, two heptagons, and one heptagram.  In the hands of a beatific visionary, it was said to bestow power over all creatures except Archangels. Around the same time, Dante Alighieri was also using geometry as a metaphor to describe the ineffable:
As the geometer intently seeks
to square the circle, but he cannot reach, through thought on thought, the principle he needs, so I searched that strange sight.

weisfeiler lehman isomorphism test

Java question:

Have:

LoopsDriverTwoPManager lDriver= new LoopsDriverTwoPManager(muList,muSem,loopsLogic,t11Semaphore,dbVector11,t11Semaphore,dbVector11,false);
GaussTable1 gTable1 = new GaussTable1(t11Semaphore,dbVector11,lDriver);

Both are Threads.  
ldriver is the logic thread.
gTable1 is a database buffer thread (holds connection to database, they share an ArrayList).

gTable needs reference to lDriver because tests .isAlive()
ldriver wants to querry database directly (use database connection without using shared buffer).
lDriver cannot have a reference to gTable1 as a parameter (compiler error)?  

Note not using something like connection pool vis Glassfish.

Is it possible for lDriver to have reference to gTable1?

interesting querry does return well defined p's:

MATCH (c:CreatedBy {wNum:0}) -[]- (d:Dnode {totalZero:5}) return c,d


So...  does the powerset of 5 zeros exist.
That is..

Match 

Match (c:CreatedBy) -[]- (d:Dnode {d:5,n:1}) RETURN c,d

Lots of great results with d:5
Note though 





the land at rainbow's end -qf
the happy organ
johny and the hurricanes.
rinky dink
connie francis


stratigy into tactics.

not a lake a river.

Pierre-Emmanuel Fega look at this: https://www.eetimes.com/startup-unveils-graph-processor-at-hot-chips/#https://www.eetimes.com/startup-unveils-graph-processor-at-hot-chips/#

does the network strategy help people.

team of teams

phoenix and unicorn  walmart turned into a phoenix.

see an awful lot of manipulation.

Kamau https://www.peterhinssen.com/books


catigory prediction
reinforcement learning.
no optimal way to fly a helicopter.


supervised linear regression


size of house by price of house.


job of the learning algorithm is to choose theta...

choose theta.

find an algorithm that minimises j of theta.

use gradient descent.

start with value of theta.


Linear Regression and Gradient Descent or batch gradient descent.


gradient descent needs to recompute entire dataset each iteration.

10000 mainacs outdoor fires 
and then stohastic gradient descent.

ford augustus
whailong souls.
feel the spirit
denise brown

marcia aitkin  

poor man style
rock-a-by person

the mighty diamonds pass the knowledge

https://databricks.com/session_na21/tensors-are-all-you-need-faster-inference-with-hummingbird?utm_source=databricks&utm_medium=email&utm_campaign=7013f000000TyO7AAK&mkt_tok=MDk0LVlNUy02MjkAAAF8nnpDE4ezjwcsFoplbzP-fl2AImcqYj88P_IJpzNC2b_SsznJCb7S-BKgjIimm3N5D9T6FA5Pu0dz1uwqFJZvgPQNq8PQIDcLfrJar0CUvbc5Xw

Aktuell läuft: MUNDO/Kabarett & Co.

https://www.facebook.com/jinkolesnikov/videos/10221707850578172

https://www.youtube.com/watch?v=J6Ei1RMG5Xo


 
https://www.youtube.com/watch?fbclid=IwAR3cszMPFup_M5Bxt_zDP7APTDXa4U_ojTGJMFHybDMY0kCd5gWVsJfVJ_8&v=l8wV77XxC60&feature=youtu.be






























