12/1
The Platters -The Great Pretender (1955
The graph used for graphsage3 is...  
when Dnode has dd, a float property.

Clarence Gatemouth Brown & Canned Heat
D4Determined has predictedDetermined,predictedProbabilities properties.
D3Determined is the robust determined model.  - A binary not multi-class model.

D3 looks like the predict link model.
D4 also has predicted link.

D3 looks like the predict link model.   -Links are written beyond usufullness.


The effort is recreate/document the pipeline.


a sequence of tasks including 

pre-processing       write ZAD
feature extraction:  wNum as one,two,three...  n,d,muList 
model fitting  
validation stages

There are two basic types of pipeline stages: 
Transformer 
Estimator.

https://towardsdatascience.com/a-deep-dive-into-neo4j-link-prediction-pipeline-and-fastrp-embedding-algorithm-bf244aeed50d

Node Feature engineering    -the embedding

Link Feature Combiner       -calculate vector product.  create a single feature from a pair of node properties.
                             cosine distance l2 or euclidian distance hadamard product.

Model training

Predict new links

https://neo4j.com/docs/graph-data-science/current/algorithms/ml-models/linkprediction/


Link prediction:   training a model to learn, between pairs of nodes in a graph, where
                   relationships should exist.

Object of interest is D3 graph.  The in-memory graph conciders :Dnode {dd} it may want nn property.
                                 Suspect though, including dd,nn will confuse prediciton.


The work flow of Link Prediction:

    Creating training and test graphs                -  GMLGS3 paragraph 2,3.
    (write testgraph/trainGraph relationships)       -  GMLGS3 does mutate.  
                                                     -  Want written into graph as proof of work.  
     "The 'remaining' graph after the second split can optionally be used to create node embeddings
     without data leakage from test or validation sets."????
 

   Training and Evaluating model candidates

GMLGS3 all good


   Applying a model for prediction

GMLGS3 all good though 'remaining' graph per above is not clear.
...

do use GraphSage.  Maybe also FastRP with properties....




ETL pipelines
ml pipelines






https://neo4j.com/docs/graph-data-science/current/algorithms/graph-sage/


How do the two below

sampleSizes
List of Integer
[25, 10]
yes
A list of Integer values, the size of the list determines the number of layers
 and the values determine how many nodes will be sampled by the layers.


embeddingDimension
Integer
64
yes
The dimension of the generated node embeddings as well as their hidden layer representations.

note "learningRate" default .1 maybe make smaller.  Is left as default.




Have GraphicDetermined and GMLGS3 both observing and predicting on legacy ZAD.

GD as a determined/underdetermined classifier.
   uses Dnode.one,two,three.. and not embedding as predictor properties.

GMLGS3 as a Dnode.dd link predictor.  
   uses graphsage embedding as predictor properties.  


Do not have description of mu numbers present/missing.
                           determined/underdetermined.
                           ZADFork improvememnt.

With ZAD summary note, 
Can compare ZADforkD3
with        ZADD3.

As start with D3 active.
run relevant paragraps for zContext.
Swith over t D3fork.  
run relevant paragraphs.
Join the datarames and summary.

Suppose can argue ZAD as map n to q instructions.
Want to argue ZAD as ML prime number detector.
the issue with determined/undetermeined and what
the final shape of graph should look like to predict on (dnode.dd linked)....

Proof of work, for instance....
image by image of succesfull linking...
Need the old scatter plots.
Dig up the old ZAD run configurations....


CREATE INDEX ON :CreatedBy(resultId)
CREATE INDEX ON :Dnode(vmResult)

CREATE (n:Configure {maxFigPScalar:1, dimension:5, setProductRange:5, integerRange:200, setProductRAngeIncrement:5,maxSetProductRange:5})
CREATE (n:Configure {maxFigPScalar:1, dimension:6, setProductRange:6, integerRange:200, setProductRAngeIncrement:6,maxSetProductRange:6})
CREATE (n:Configure {maxFigPScalar:1, dimension:6, setProductRange:6, integerRange:200, setProductRAngeIncrement:6,maxSetProductRange:6},pArray:"[0, 0, 0, 0, 0, 0, 0]")
CREATE (n:Configure {maxFigPScalar:1, dimension:6, setProductRange:6, integerRange:200, setProductRAngeIncrement:6,maxSetProductRange:6},pArray:"[0, 0, 0, 0, 0, 0, 0]")
CREATE (n:Configure {maxFigPScalar:1, dimension:5, setProductRange:5, integerRange:200, setProductRAngeIncrement:5,maxSetProductRange:5,pArray:"[0, 0, 0, 0, 0, 0, 0]"})


Want ZAD graph summary. 

Is root power set complete?   - n,d analysis.  use the combinations formula and compare result with dataframe summary (with d count(n)).

Is mu root set complete?      - :CreatedBy.pArray can be related to :Dnode.vmResult that is determined/under determined. 
                              - Use the appropriate set of muNumbers (Dimension).  Which are/are not in a (HigestScalar,Dimension)
                                Conjecture is the HS =1,2 completes up to quadratics.  1,2,3 completes the cubits.  1,2,3,4 completes the quartets...
 
What percentage of the power set is determined/under determined?    - 
Can determined p's both be expressed with highest term =1 and 2?    - believe no.

Does the skip pattern reveal more root sets???


https://towardsdatascience.com/a-deep-dive-into-neo4j-link-prediction-pipeline-and-fastrp-embedding-algorithm-bf244aeed50d



12/2

node lable prediction, GraphicDetermined does not use an embedding.  The properties are set in 

gds.alpha.ml.nodeClassification.train
featureProperties: ['zero','one','two','three','wNum','totalZero']

DiffDataExploreD6C1             July 09 2021 
Don't know what graph it was working on.


DiffDataExploreD6C1,2           July 28 2021



DiffDnodeMuD                    September 02 2021

And where to populate ZADGraph with muNumbers?
Any ZAD run as a %cmd paragraph.

Remember how to populate muNumbers


                             //       FractionIntegerDriver fig= new FractionIntegerDriver(muList,muSem);        
//       FractionIntegerDriverIterate figI= new FractionIntegerDriverIterate(muList,muSem);     
//       GaussTable1 gTable1 = new GaussTable1(muSem,muList,figI);
                             //     fig.start();
//       figI.start();
//       gTable1.start()

val dfsRS = dfs.wNumQ(wNum)
        psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
                                         "MATCH (n:Dnode) - [] -> (c:CreatedBy {wNum:?})\n" +
                                         "WITH DISTINCT n\n" +
                                         "RETURN toString(n.d) as denominator, toString(n.n) as numerator, toString(n.determined) as determined"); 

val dfsRS = dfs.wNumQQ(wNum)
        psInsert = conn.prepareStatement("MATCH (n:Dnode) - [] -> (c:CreatedBy {wNum:?})\n" +
                                         "WITH DISTINCT n,toString(c.wNum) as wNum\n" +
                                         "RETURN toString(n.d) as denominator, toString(n.n) as numerator, wNum, toString(n.determined) as determined"); 

val dfsRS = dfs.allMuQ()
        psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
                                         "MATCH (n:MuNumber )\n" +
                                         "RETURN toString(n.Value) as value,toString(n.size) as size,toString(n.d) as d,toString(n.n) as n,n.nBinary as nBinary"); 

MuNumber have a size and a derrived lengeth
size refers to number of sets represented
length is the number of significant digits in the binary expression.

DiffDataExploreD6C1   
looks at ZAD and muNumbers.

With regard to ZAD, not yet best comprehension of muNumbers on Dnodes.
With regard to muNumbers, it does verify musets representing an arbitrary power sets.

DiffDataExploreD6C1,2

Evolved from DiffDataExploreD6C1 with key value implementation.
Mostly though, does not distinguish determined/underdetermined representations of mu.
Does address skip pattern worth...



DiffDnodeMuD

same dfs.wNumQQ(wNum) data pull.
Does pull determined info...
Does not work with determined info.

The above three set the stage for 
ZAD wrap up.


Have ZAD, ZADFork.

FractionIntegerDriver along with the nCr equation defines an expected set size and composition. 
Each wNum in ZAD,ZADFork has a set of determined,underdetermind 
Reconcile the ZAD,ZADFork determined set with the FID set. 
 
The qustion of removing undetermined and linking through to the next determined.

12/3

MuNumbers is the new Graph  They will populated dataframes as needed.

Need not just neo4.conf but also the streams conf in the new graph.


GraphicMu is new note.


DiffDataExploreD6C1 under the microscope:

Paragraph 3,4 retrieve the zad graph up to args[wNum] and populates
case class dNFields(denominator:Int,numerator:Int, wNum:Int,determined:Int)

Paragraph 5 so far uninteresting. It writes PivotDF
Paragraph 6 so far uninteresting, reads same dataframe as paragraph 5 and writes PivotDF1.


Paragraph 8,9 

public ResultSet allMuQ()

        psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
        "MATCH (n:MuNumber )\n" +
        "RETURN toString(n.Value) as value,toString(n.size) as size,toString(n.d) as d,toString(n.n) as n,n.nBinary as nBinary"); 

Populates
case class muFields(value:String,d:String,size:String,n:String,nBinary:String)
as QfidQuery0105 dataframe. 

Paragraph 10,11 entend "Length", the size of the respective binary word.
Note: "lenght" <=arbitrary value includes word in power set of value.

Paragraph 12,13 filter to an arbitrary lenght returning members of power set.


As it was discovered the D3 graph is spend with GraphSage links,  a new 
D3Legacy graph is needed.
See zadrun.txt for run configure.

AM summary:

It appears the disatification with DiffDataExploerD6C1,DiffDataExploreD6C1,2  and
DiffDnodeMuD is it only conciders n,d and determined.  muList must be included in
summary.  
First off importantly, it must exist in case class 


╒══════════════════════════════════════════════════════════════════════════════════════════════════╕
│"n"                                                                                               │
╞══════════════════════════════════════════════════════════════════════════════════════════════════╡
│{"vmResult":"[0.0, 1.0, -0.0, 0.0, 0.0]","muList":"[]","d":0,"determined":0,"totalZero":1,"n":0}  │
├──────────────────────────────────────────────────────────────────────────────────────────────────┤
│{"vmResult":"[0.0, 3.0, 3.0, 1.0]","muList":"[]","d":0,"determined":0,"totalZero":0,"n":0}        │


need a new method wNumQX for also returning muList.





         psInsert = conn.prepareStatement("MATCH (n:Dnode) - [] -> (c:CreatedBy {wNum:?})\n" +
                                         "WITH DISTINCT n,toString(c.wNum) as wNum\n" +
                                         "RETURN toString(n.d) as denominator, toString(n.n) as numerator, wNum, toString(n.determined) as determined"); 


        psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
                                         "MATCH (n:Dnode) - [] -> (c:CreatedBy {wNum:?})\n" +
                                         "WITH DISTINCT n\n" +
                                         "RETURN toString(n.d) as denominator, toString(n.n) as numerator, toString(n.determined) as determined"); 


        psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
                                         "MATCH (m:MuNumber {d:?})\n" +
                                         "WITH m.d as mDen\n" +
                                         "MATCH (n:Dnode {d:toInteger(mDen)}) - [] -> (c:CreatedBy {wNum:?})   \n" +
                                         "WITH DISTINCT n\n" +
                                         "RETURN toString(n.d) as denominator, toString(n.n) as numerator, ?, toString(n.determined) as determined"); 


        psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
                                         "MATCH (n:MuNumber )\n" +
                                         "RETURN toString(n.Value) as value,toString(n.size) as size,toString(n.d) as d,toString(n.n) as n,n.nBinary as nBinary");


        psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
				        "MATCH (e:MuNumber)\n" +
				        "RETURN e.nBinary"); 


       psInsert = conn.prepareStatement("CYPHER runtime=interpreted\n" +
                                        "MATCH (n:Dnode) - [] -> (c:CreatedBy {wNum:?})\n" +
                                        "WITH DISTINCT n,toString(c.wNum) AS wNum,c.skipList AS skipPattern\n" +
                                        "RETURN toString(n.d) AS denominator, toString(n.n) AS numerator, wNum, toString(n.determined) AS determined, skipPattern");







Notes need a preconditions paragraph   -  the graph connectivity, jars...

 This is a Hardanger bowed dulcimer but quite a ways from the traditional approach for a Hardanger instrument.

MATCH (n:Dnode) 
WITH n.muList as nB, size(n.muList) as nBSize,n
WITH substring(nB,1,nBSize-2) as sBsubstring,n
WITH split(sBsubstring,', ') AS listNB,n
SET n.muListSize=size(listNB)
RETURN COUNT(n) as NodesUpdated


MATCH (m:MuNumber) 
WITH m                                               
OPTIONAL MATCH (d:Dnode {muList:m.nBinary})
WITH m,d
FOREACH(x IN (CASE WHEN d IS NULL THEN [] else [1] END) |
DELETE m)


MATCH (d:Dnode)
WITH d
SET d.allZerosMu=0
FOREACH(x IN (CASE WHEN d.muListSize=d.totalZero THEN [1] else [0] END) |
SET d.allZerosMu=1)



MATCH (d:Dnode)-[p:predictedLink]->(dd:Dnode) WHERE d.dd=dd.dd
DELETE p
MERGE (d)-[:zMap]->(dd)
RETURN COUNT(p)

MATCH (:Dnode)-[r:predictedLink]->(:Dnode)
DELETE r


MATCH (n:Dnode) - [] -> (c:CreatedBy)   
Set n.wNum=c.wNum
return count(n)


CALL gds.beta.graphSage.train(
  'myGraph',
  {
     modelName: 'myGraphh',
     epochs:75
    , aggregator: 'pool'
//    , aggregator: 'mean'
    , activationFunction: 'relu'
    , featureProperties: ['dd']
    , projectedFeatureDimension: 1
    , sampleSizes: [25, 10]
    , searchDepth: 25
  }
)




MATCH (d:Dnode) 
WITH d 
FOREACH(x IN (CASE WHEN d.totalZero=0 THEN [1] else [0] END) | SET d.zero=1)      totalZero
FOREACH(x IN (CASE WHEN d.totalZero=1 THEN [1] else [0] END) | SET d.one=1)
FOREACH(x IN (CASE WHEN d.totalZero=2 THEN [1] else [0] END) | SET d.two=1)
FOREACH(x IN (CASE WHEN d.totalZero=3 THEN [1] else [0] END) | SET d.three=1)
RETURN COUNT(d)


MATCH (d:Dnode) 
set d.zero=0
case when d.totalZero=0 then [1] else [] as update
foreach (x in update | set d.zero=1)
return count(d)


MATCH (d:Dnode) 
set d.zero=0
WITH d, CASE WHEN d.totalZero=0 then [1] else [] end as update
foreach (x in update | set d.zero=1)
return count(d)


MATCH (d:Dnode) 
set d.three=0
WITH d, CASE WHEN d.totalZero=3 then [1] else [] end as update
foreach (x in update | set d.three=1)
return count(d)


MATCH (n:Dnode {determined:1}  ) RETURN count(n)

MATCH (n:Dnode {predictedDetermined:1, determined:0}  ) RETURN n

MATCH (n:Dnode) 
set n.predictedDetermined=-1
set n.predictedProbabilities=-1
return count(n)

MATCH (n:Dnode) where n.wNum is NULL return n


MATCH (n {name: 'Stefan'})
SET n:German
RETURN n.name, labels(n) AS labels


MATCH (n {name: 'Peter'})
REMOVE n:German
RETURN n.name, labels(n)

MATCH (d:Dnode {determined:1})
SET d:DDetermined
RETURN COUNT(d)

MATCH (d:Dnode {determined:0})
SET d:DUndetermined
RETURN COUNT(d)

MATCH (d:DDetermined),(dd:DUndetermined)
REMOVE d:Dnode
REMOVE dd:Dnode
RETURN d,dd

MATCH (d:DDetermined),(dd:DUndetermined)
SET d:Dnode
SET dd:Dnode
RETURN COUNT(d),COUNT(dd)



MATCH (d:DUndetermined {predictedDetermined:1}) RETURN COUNT(n)
SET d:BadPrediction
RETURN COUNT(d)


MATCH (d:DDetermined),(dd:DUndetermined),(ddd:BadPrediction)
RETURN d,dd,ddd

MATCH (n:Dnode) 
WITH n.muList as nB, size(n.muList) as nBSize,n
WITH substring(nB,1,nBSize-2) as sBsubstring,n
WITH split(sBsubstring,', ') AS listNB,n
SET n.muListSize=size(listNB)
RETURN COUNT(n) as NodesUpdated

MATCH (d:Dnode)
SET d.wNum=toFloat(d.wNum)
RETURN count(d)


MATCH (d:Dnode)
WITH d
SET d.allZerosMu=0
FOREACH(x IN (CASE WHEN d.muListSize=d.totalZero THEN [1] else [0] END) |
SET d.allZerosMu=1)

MATCH (d:Dnode)
SET d.determined=toInteger(d.determined)
RETURN count(d)


MATCH (c:CreatedBy {wNum:5})<-[r:CreatedBye]-(d) RETURN c,d LIMIT 25

Needs some embellisment.

pArray becomes a list.  
are interested in wNum=4 andd the corrosponding pArray index. 

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
//RETURN pArrayS LIMIT 100
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
RETURN pArrayN

WITH [str in pArrayN | toInteger(str)] as pArrayNN
RETURN pArrayNN Limit 100

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
//RETURN pArrayS LIMIT 100
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
//RETURN pArrayN

WITH [str in pArrayN | str] as pArrayNN
RETURN pArrayNN Limit 100

looks like an error with pArray.  there is a leading space for what reason??



MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
UNWIND split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArraySS
WITH trim(pArraySS) AS pArraySSS
WITH COLLECT(toInteger(pArraySSS) AS pArrayI
RETURN pArrayI LIMIT 100

With substring(pArraySS,0,1) AS testS
Return testS

RETURN pArrayN

trim(original)


CASE WHEN substring(pArraySS,1,1)=' ' THEN  substring(pArraySS,0,1) ELSE toString(vvScalar) END


MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
UNWIND split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArraySS
WITH trim(pArraySS) AS pArraySSS
WITH COLLECT(toInteger(pArraySSS)) AS pArrayI
RETURN pArrayI LIMIT 100


MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
//RETURN pArrayS LIMIT 100
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
//RETURN pArrayN
WITH [str in pArrayN | toInteger(trim(str)] as pArrayNN
RETURN pArrayNN Limit 100

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
//RETURN pArrayS LIMIT 100
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
//RETURN pArrayN
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN

WITH pArrayNN[size(pArrayNN)-2] as pElement

RETURN pElement limit 100

WITH [num in pArrayNN WHERE            ]

RETURN pArrayNN Limit 100

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN
WITH pArrayNN[size(pArrayNN)-2] as pElement
RETURN pElement limit 100

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=2 END as pElement,c
RETURN pElement,c

WITH [x in pArrayNN[size(pArrayNN)-2] WHERE x=2] as px

RETURN px limit 100     ]

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
//WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=1 THEN pArrayNN[size(pArrayNN)-2]   END as pElement,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=1 THEN c End as cc
return cc
//RETURN pElement,c

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
//WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=1 THEN pArrayNN[size(pArrayNN)-2]   END as pElement,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=1 THEN c End as cc
WITH cc WHERE cc IS NOT null 
return cc

// filters for wNum:34 the constan in third with clause.

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=3 THEN c End as cc
WITH cc WHERE cc IS NOT null 
return cc


MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=3 THEN c End as cc
WITH cc WHERE cc IS NOT null 
//return cc
MATCH (cc:CreatedBy)<-[r:CreatedBye]-(d) RETURN dd

RETURN pElement limit 100

4/26

MATCH (c:CreatedBy {wNum:4}) WITH c.pArray as pArrayS,c
WITH split(substring(pArrayS, 1, size(pArrayS)-2), ',') as pArrayN,c
WITH [str in pArrayN | toInteger(trim(str))] as pArrayNN,c
//WITH CASE WHEN pArrayNN[size(pArrayNN)-2]=4 THEN c End as cc
WITH CASE WHEN pArrayNN[size(pArrayNN)-2] IN [1, 2, 3] THEN c End as cc
WITH cc WHERE cc IS NOT null 
//return cc
MATCH (cc:CreatedBy)<-[r:CreatedBye]-(d) RETURN d




https://stats.stackexchange.com/questions/61328/libsvm-data-format

https://spark.apache.org/docs/latest/ml-classification-regression.html#one-vs-rest-classifier-aka-one-vs-all

https://en.wikipedia.org/wiki/Singular_value_decomposition

https://web.stanford.edu/class/cs520/2020/notes/What_Are_Some_Inference_Algorithms.html

http://zyxue.github.io/2018/09/12/visualize-various-gradient-descent-algorithms.html
//  "pretty" useless.


https://towardsdatascience.com/why-visualize-gradient-descent-optimization-algorithms-a393806eee2

https://towardsdatascience.com/an-intuitive-explanation-of-graphsage-6df9437ee64f

We can divide GraphSAGE into three main parts as context construction, information aggregation, and loss function

https://dsgiitr.com/blogs/graphsage/

https://sefiks.com/2021/06/06/graph-embeddings-in-neo4j-with-graphsage/
//  Neo4j graphsage walk through.  uses eucliddeanDistance of embedding for similarity.

https://www.quantamagazine.org/how-big-data-carried-graph-theory-into-new-dimensions-20210819/
// wax -  The higher-order analogue of a graph, for example, is called a hypergraph, and instead of edges, it has “hyperedges.
//        https://www.quantamagazine.org/new-math-proof-raises-lower-bounds-of-graph-randomness-20201104/

https://medium.com/analytics-vidhya/ohmygraphs-graphsage-and-inductive-representation-learning-ea26d2835331
//  Algorithm explained.


https://antonsruberts.github.io/graph/graphsage/
// GS deep dive.  does incpomprehsable scatter plot. 

https://towardsdatascience.com/t-distributed-stochastic-neighbor-embedding-t-sne-bb60ff109561

http://www.edwardraff.com/jsat_docs/JSAT-0.0.8-javadoc/jsat/datatransform/visualization/TSNE.html

https://www.tabnine.com/code/java/classes/org.deeplearning4j.plot.Tsne

https://alvinalexander.com/java/jwarehouse/deeplearning4j/deeplearning4j-core/src/main/java/org/deeplearning4j/plot/Tsne.java.shtml

https://onix-systems.com/blog/top-10-java-machine-learning-tools-and-libraries

https://github.com/rahul-raj/Java-Deep-Learning-Cookbook/blob/master/05_Implementing_NLP/sourceCode/cookbookapp/words.txt

Here is an image of the tsne-standard-coords.csv file plotted using gnuplot.

Have to write the embedding into Dnode.
Have to ZADScripts read the embedding into dataframe.

So, tSNE has implementation curve.
Neo4j GraphSage will write a 2 dimensional/3 dimensional embedding  ---  can k-Means ---  Have the plot variables.

https://www.geeksforgeeks.org/difference-between-pca-vs-t-sne/

https://medium.com/analytics-vidhya/pca-vs-t-sne-17bcd882bf3d

remember running zad:

CREATE INDEX ON :CreatedBy(resultId)
CREATE INDEX ON :Dnode(vmResult)

CREATE (n:Configure {maxFigPScalar:1, dimension:4, setProductRange:20, integerRange:200, setProductRAngeIncrement:20,maxSetProductRange:10,pArray:"[-10, -10, -10, -10, 0]"})

https://web.stanford.edu/class/cs520/2020/notes/What_Are_Some_Inference_Algorithms.html

http://zyxue.github.io/2018/09/12/visualize-various-gradient-descent-algorithms.html

https://towardsdatascience.com/why-visualize-gradient-descent-optimization-algorithms-a393806eee2

https://towardsdatascience.com/an-intuitive-explanation-of-graphsage-6df9437ee64f

https://www.arxiv-vanity.com/papers/1910.04807/

https://www.youtube.com/watch?v=qdbhCG-Yn74

https://neo4j.com/videos/improve-ml-predictions-using-graph-algorithms/

https://neo4j.com/videos/improve-machine-learning-predictions-using-graph-algorithms/

https://www.quantamagazine.org/how-big-data-carried-graph-theory-into-new-dimensions-20210819/

https://en.wikipedia.org/wiki/Critical_point_(mathematics)

https://towardsdatascience.com/what-really-is-a-matrix-determinant-89c09884164c

https://en.wikipedia.org/wiki/Lagrangian_mechanics

https://www.cantorsparadise.com/bayes-unbound-f0b464683e7c

https://www.cantorsparadise.com/the-goldbach-conjecture-5ffafb9cee8e

https://en.wikipedia.org/wiki/Geometric_progression   -if ratio of cosecutive terms is constant.

https://towardsdatascience.com/what-really-is-a-matrix-determinant-89c09884164c

https://en.wikipedia.org/wiki/Lagrangian_mechanics

https://www.cantorsparadise.com/bayes-unbound-f0b464683e7c

https://www.cantorsparadise.com/the-goldbach-conjecture-5ffafb9cee8e

https://en.wikipedia.org/wiki/Geometric_progression   -if ratio of cosecutive terms is constant.

https://en.wikipedia.org/wiki/Rational_root_theorem 
https://en.wikipedia.org/wiki/Geometrical_properties_of_polynomial_roots
https://en.wikipedia.org/wiki/Root-finding_algorithms
https://www.searchenginejournal.com/flan-google-research-finds-better-machine-learning/428732/#close

https://www.datarobot.com/blog/how-mlops-helps-you-dodge-the-wrecking-ball-of-underspecification/

weisfeiler lehman isomorphism test

10000 mainacs outdoor fires

Kostrikin's Linear Algebra and Geometry.

Gradient descent.

Beyond the Gradient: Jacobian and Hessian Matrices

Mitchell (1997) provides a succinct deﬁnition:
“A computer program is said to learn from experience
E
with respect to some
class of tasks
T
and performance measure
P
, if its performance at tasks in
T
, as
measured by
P
, improves with experience
E
.”
chapter 3.2 of the book "The Elements of Statistical Learning" (Friedman, Hastie and Tibshirani 2009)





data science vs ai..

Data Science is a comprehensive process that involves pre-processing, analysis, visualization and prediction. On the other hand, 
AI is the implementation of a predictive model to forecast
future events. Data Science comprises of various statistical techniques whereas AI makes use of computer algorithms.


identify problem

business sponser:  objective success criteria project plan timeline target variable definition reporting specs sighn off
data preperation: data inventory data quality review reove duplicates missing value review finalize eda file sign off
data exploration:  table statistics summary  univariate decisioin trees identify interation terms calculate scaling options historgram plots coliniarity testing sign off
transform and select:   class imbalance adjustment binarization quadratic plots dimension reduction transform testing norm sigmoid conversion sign off
                        https://towardsdatascience.com/practical-tips-for-class-imbalance-in-binary-classification-6ee29bcdb8a7 
                        training set and validation set have similar ratio of classes.
predictive modeling:  gmm clustering cart/cs distributed evolutionary algorithms support vector machines convolutional neural networks lstm gradient boosting trees encoding sign off
validate models:  area under curve log loss avarage prediction f1 score recall vs prediction sign off
deploy models:  tbo sign off
evaluate monitor: results scoring times population stability report performance sign off

Building training sets      2      *
cleaning and organizing data 60    *
collecting data sets 19            *
mining data for patterns 9
refining algorithms 4
other 5

Tip 1 craft over process.
    2 try to simplify relationships to either binary flags or straight lines.
    3 automate continuous variable transformations for testing.
    4 consider ensembling individual engineered features -  each feature can be its own mini model.
      what transformation can we apply to an individual variable as if it was a model of that variable.
       heck -  80% of the variables will be thrown out.
    5 use target mean encoding for categorical inputs  a technique not an algorithm
    6 replace traditional binning with decision trees.
      bin a continuous variable vs tree  
    7 leverage random forests in two ways: feature importanse, indifidual trees as engineered 
      features.
    8 consider binning 0 values separately in monetary values.
       - zero as a flag, not a continuous variable.
    9 desision trees for "pultting it all together".

https://www.analyticsvidhya.com/blog/2018/04/fundamentals-deep-learning-regularization-techniques/

What is Regularization?
How does Regularization help in reducing Overfitting?
Different Regularization techniques in Deep Learning

    L2 and L1 regularization
    Dropout
    Data augmentation
    Early stopping

Regularization is a technique which makes slight modifications to the learning algorithm such that
the model generalizes better. This in turn improves the model’s performance on the unseen data (test) as well.
(underfitting/overfitting/just right)

in machine learning, you will have a fair idea that regularization penalizes the coefficients.
In deep learning, it actually penalizes the weight matrices of the nodes.

L2 & L1 regularization
L1 and L2 are the most common types of regularization. These update the general cost function by adding
another term known as the regularization term.
Cost function = Loss (say, binary cross entropy) + Regularization term

Here, lambda is the regularization parameter. It is the hyperparameter whose value is optimized for better results.

Dropout
At every iteration, it randomly selects some nodes and removes them along with all of their incoming and 
outgoing connections as shown below.
It can also be thought of as an ensemble technique in machine learning. 

This probability of choosing how many nodes should be dropped is the hyperparameter of the dropout function. 

Data Argumentation
The simplest way to reduce overfitting is to increase the size of the training data. In machine learning, 
we were not able to increase the size of training data as the labeled data was too costly.

Early stopping
Early stopping is a kind of cross-validation strategy where we keep one part of the training set as the 
validation set. When we see that the performance on the validation set is getting worse, we immediately 
stop the training on the model. This is known as early stopping.

Patience denotes the number of epochs...  - A hyperparameter


markov chains with absorbing states.



 First, the laws of probability tell us how AI
systems should reason

Second, we can use probability
and statistics to theoretically analyze the behavior of proposed AI systems


Probability theory
was originally developed to analyze the frequencies of events.


 In the case of the doctor diagnosing the patient, we use probability
to represent a
degree of belief
,

The former kind of probability, related directly to the rates at which
events occur, is known as
frequentist probability
, while the latter, related to
qualitative levels of certainty, is known as Bayesian probability


Exception: java.lang.OutOfMemoryError thrown from the UncaughtExceptionHandler in thread "kafka-producer-network-thread | producer-1"
[Neo4jDriverIO-2-22] WARN org.neo4j.driver.internal.shaded.io.netty.channel.nio.NioEventLoop - Unexpected exception in the selector loop.
org.neo4j.driver.internal.shaded.io.netty.util.IllegalReferenceCountException: refCnt: 0, decrement: 1
[Neo4jDriverIO-2-22] WARN org.neo4j.driver.internal.shaded.io.netty.util.concurrent.SingleThreadEventExecutor - Unexpected exception from an event executor:
java.lang.OutOfMemoryError: Java heap space

ZADScripts did throw above.  Its process hanged at 3067MB.


machine learning in supply chain.

12/7

DL4j lookover yesterday....  
Not really.  It does though tsne.  Have the jar, need it in eclipse.  Instructions say use maven.
 

Must speak of ZDCTH in terms of open and closed sets.  Will say closed set is the precision of the constant term up to the degree of p.
Example D64 is 2^7, so 7 digits of precision are closed sets. -- weekend...

//  got a column in the wrong order.  - fixed.

GraphicMu-

Effort began Dec 3.

D3Legacy,D3pArrayFork are dataframes populated from respective graphs.
muNumbersXL is the reference dataframe composed of the power set for size=3.


Inner Join

The inner join is the default join in Spark SQL. It selects rows that have matching values in both relations.

Syntax:

relation [ INNER ] JOIN relation [ join_criteria ]


Branch-and-Bound algorithms for Mixed-Integer Linear Programming Optimization

we can artificially create a repartitioning key (key salting)

https://towardsdatascience.com/the-art-of-joining-in-spark-dcbd33d693c

https://stackoverflow.com/questions/40343625/joining-spark-dataframes-on-the-key


12/8

MATCH (n:Dnode) - [] -> (c:CreatedBy {wNum:3})
WITH DISTINCT n,toString(c.wNum) as wNum
RETURN toString(n.d) as denominator, toString(n.n) as numerator, wNum, toString(n.determined) as determined 

MATCH (n:Dnode) - [] -> (c:CreatedBy {wNum:0})
WITH DISTINCT n,toString(c.wNum) as wNum
RETURN toString(n.d) as denominator, toString(n.n) as numerator, wNum, toString(n.determined) as determined, n.muList as muList


+-----+----+------+---------+---+---+
|value|size|length|nBinary  |n  |d  |
+-----+----+------+---------+---+---+
|1    |1   |1     |[1]      |1  |1  |
|3    |2   |2     |[1, 1]   |1  |2  |
|2    |1   |2     |[2]      |2  |2  |
|7    |3   |3     |[1, 1, 1]|1  |3  |
|5    |2   |3     |[2, 1]   |2  |3  |
|4    |1   |3     |[3]      |3  |3  |
|6    |2   |3     |[2, 2]   |2  |4  |
+-----+----+------+---------+---+---+


╒═════════════════════════════════════════════════════════════════════════════════════════════════════════════╕
│"n"                                                                                                          │
╞═════════════════════════════════════════════════════════════════════════════════════════════════════════════╡
│{"pArray":"[0, 0, 0, 0]","setProductRange":3,"setProductRAngeIncrement":3,"dimension":3,"maxSetProductRange":│
│3,"maxFigPScalar":1,"integerRange":200}                                                                      │
└─────────────────────────────────────────────────────────────────────────────────────────────────────────────┘


+-----+----+------+-------+---+---+-----------+---------+----+----------+------+
|value|size|length|nBinary|n  |d  |denominator|numerator|wNum|determined|muList|
+-----+----+------+-------+---+---+-----------+---------+----+----------+------+
|1    |1   |1     |[1]    |1  |1  |1          |1        |2   |1         |[1]   |
|2    |1   |2     |[2]    |2  |2  |2          |2        |2   |1         |[2]   |
|4    |1   |3     |[3]    |3  |3  |3          |3        |2   |1         |[3]   |
|6    |2   |3     |[2, 2] |2  |4  |4          |2        |1   |1         |[2, 2]|
+-----+----+------+-------+---+---+-----------+---------+----+----------+------+

123

+-----+----+------+---------+---+---+-----------+---------+----+----------+---------+
|value|size|length|nBinary  |n  |d  |denominator|numerator|wNum|determined|muList   |
+-----+----+------+---------+---+---+-----------+---------+----+----------+---------+
|1    |1   |1     |[1]      |1  |1  |1          |1        |2   |1         |[1]      |
|1    |1   |1     |[1]      |1  |1  |1          |1        |1   |1         |[1]      |
|3    |2   |2     |[1, 1]   |1  |2  |2          |1        |1   |1         |[1, 1]   |
|3    |2   |2     |[1, 1]   |1  |2  |2          |1        |0   |1         |[1, 1]   |
|2    |1   |2     |[2]      |2  |2  |2          |2        |2   |1         |[2]      |
|2    |1   |2     |[2]      |2  |2  |2          |2        |1   |1         |[2]      |
|7    |3   |3     |[1, 1, 1]|1  |3  |3          |1        |0   |1         |[1, 1, 1]|
|4    |1   |3     |[3]      |3  |3  |3          |3        |2   |1         |[3]      |
|4    |1   |3     |[3]      |3  |3  |3          |3        |1   |1         |[3]      |
|4    |1   |3     |[3]      |3  |3  |3          |3        |1   |1         |[3]      |
|6    |2   |3     |[2, 2]   |2  |4  |4          |2        |1   |1         |[2, 2]   |
|6    |2   |3     |[2, 2]   |2  |4  |4          |2        |0   |1         |[2, 2]   |
+-----+----+------+---------+---+---+-----------+---------+----+----------+---------+

34

int lbSetProductRange=0;
int pArrayResetValue=0;   
will attempt -1 as value.

legacy
MATCH (n:CreatedBy{resultId:600001}    ) RETURN n LIMIT 25

╒══════════════════════════════════════════════════════════════════════╕
│"n"                                                                   │
╞══════════════════════════════════════════════════════════════════════╡
│{"skipList":"[false, false, false]","wNum":0,"pArray":"[0, 0, 0, 0]","│
│resultId":600001}                                                     │
├──────────────────────────────────────────────────────────────────────┤
│{"skipList":"[false, false, false]","wNum":1,"pArray":"[0, 0, 0, 0]","│
│resultId":600001}                                                     │
├──────────────────────────────────────────────────────────────────────┤
│{"skipList":"[false, false, false]","wNum":2,"pArray":"[0, 0, 0, 0]","│
│resultId":600001}                                                     │
├──────────────────────────────────────────────────────────────────────┤
│{"skipList":"[false, false, false]","wNum":3,"pArray":"[0, 0, 0, 0]","│
│resultId":600001}                                                     │
└──────────────────────────────────────────────────────────────────────┘



pArrayFork


╒══════════════════════════════════════════════════════════════════════╕
│"n"                                                                   │
╞══════════════════════════════════════════════════════════════════════╡
│{"skipList":"[false, false, false]","wNum":0,"pArray":"[-1, -1, -1, 0]│
│","resultId":600001}                                                  │
├──────────────────────────────────────────────────────────────────────┤
│{"skipList":"[false, false, false]","wNum":1,"pArray":"[-1, 1, -1, 0]"│
│,"resultId":600001}                                                   │
├──────────────────────────────────────────────────────────────────────┤
│{"skipList":"[false, false, false]","wNum":2,"pArray":"[-1, 1, 6, 0]",│
│"resultId":600001}                                                    │
├──────────────────────────────────────────────────────────────────────┤
│{"skipList":"[false, false, false]","wNum":3,"pArray":"[-1, 1, 6, 0]",│
│"resultId":600001}                                                    │
└──────────────────────────────────────────────────────────────────────┘






















%md
<p align="center">
  <img src="https://www.zeljkoobrenovic.com/tools/tech/images/eclipse_deeplearning4j.png">
</p>

 [![Documentation](https://img.shields.io/badge/user-documentation-blue.svg)](https://deeplearning4j.konduit.ai/)
[![Get help at the community forum](https://img.shields.io/badge/Get%20Help-Community%20Forum-blue)](https://community.konduit.ai/)
[![javadoc](https://javadoc.io/badge2/org.deeplearning4j/deeplearning4j-nn/DL4J%20API%20Doc.svg)](https://javadoc.io/doc/org.deeplearning4j/deeplearning4j-nn)
[![javadoc](https://javadoc.io/badge2/org.nd4j/nd4j-api/ND4J%20API%20Doc.svg)](https://javadoc.io/doc/org.nd4j/nd4j-api)
[![License](https://img.shields.io/github/license/eclipse/deeplearning4j)](LICENSE)
![GitHub commit activity](https://img.shields.io/github/commit-activity/m/eclipse/deeplearning4j)


The **[Eclipse Deeplearning4J](https://deeplearning4j.konduit.ai/)** (DL4J) ecosystem is a set of projects intended to support all the needs of a JVM based deep learning application. This means starting with the raw data, loading and preprocessing it from wherever and whatever format it is in to building and tuning a wide variety of simple and complex deep learning networks. 

Because Deeplearning4J runs on the JVM you can use it with a wide variety of JVM based languages other than Java, like Scala, Kotlin, Clojure and many more. 

The DL4J stack comprises of:
- **DL4J**: High level API to build MultiLayerNetworks and ComputationGraphs with a variety of layers, including custom ones. Supports importing Keras models from h5, including tf.keras models (as of 1.0.0-beta7) and also supports distributed training on Apache Spark
- **ND4J**: General purpose linear algebra library with over 500 mathematical, linear algebra and deep learning operations. ND4J is based on the highly-optimized C++ codebase LibND4J that provides CPU (AVX2/512) and GPU (CUDA) support and acceleration by libraries such as OpenBLAS, OneDNN (MKL-DNN), cuDNN, cuBLAS, etc
- **SameDiff** : Part of the ND4J library, SameDiff is our automatic differentiation / deep learning framework. SameDiff uses a graph-based (define then run) approach, similar to TensorFlow graph mode. Eager graph (TensorFlow 2.x eager/PyTorch) graph execution is planned. SameDiff supports importing TensorFlow frozen model format .pb (protobuf) models. Import for ONNX, TensorFlow SavedModel and Keras models are planned. Deeplearning4j also has full SameDiff support for easily writing custom layers and loss functions.
- **DataVec**: ETL for machine learning data in a wide variety of formats and files (HDFS, Spark, Images, Video, Audio, CSV, Excel etc)
- **LibND4J** : C++ library that underpins everything. For more information on how the JVM acceses native arrays and operations refer to [JavaCPP](https://github.com/bytedeco/javacpp)

All projects in the DL4J ecosystem support Windows, Linux and macOS. Hardware support includes CUDA GPUs (10.0, 10.1, 10.2 except OSX), x86 CPU (x86_64, avx2, avx512), ARM CPU (arm, arm64, armhf) and PowerPC (ppc64le).

## Community Support
For support for the project, please go over to https://community.konduit.ai/

## Using Eclipse Deeplearning4J in your project
Deeplearning4J has quite a few dependencies. For this reason we only support usage with a build tool.

```xml
<dependencies>
  <dependency>
      <groupId>org.deeplearning4j</groupId>
      <artifactId>deeplearning4j-core</artifactId>
      <version>1.0.0-M1.1</version>
  </dependency>
  <dependency>
      <groupId>org.nd4j</groupId>
      <artifactId>nd4j-native-platform</artifactId>
      <version>1.0.0-M1.1</version>
  </dependency>
</dependencies>
```

Add these dependencies to your pom.xml file to use Deeplearning4J with the CPU backend. A full standalone project example is [available in the example repository](https://github.com/eclipse/deeplearning4j-examples), if you want to start a new Maven project from scratch.

## A taste of code
Deeplearning4J offers a very high level API for defining even complex neural networks. The following example code shows
you how LeNet, a convolutional neural network, is defined in DL4J.

```java
MultiLayerConfiguration conf = new NeuralNetConfiguration.Builder()
                .seed(seed)
                .l2(0.0005)
                .weightInit(WeightInit.XAVIER)
                .updater(new Adam(1e-3))
                .list()
                .layer(new ConvolutionLayer.Builder(5, 5)
                        .stride(1,1)
                        .nOut(20)
                        .activation(Activation.IDENTITY)
                        .build())
                .layer(new SubsamplingLayer.Builder(PoolingType.MAX)
                        .kernelSize(2,2)
                        .stride(2,2)
                        .build())
                .layer(new ConvolutionLayer.Builder(5, 5)
                        .stride(1,1)
                        .nOut(50)
                        .activation(Activation.IDENTITY)
                        .build())
                .layer(new SubsamplingLayer.Builder(PoolingType.MAX)
                        .kernelSize(2,2)
                        .stride(2,2)
                        .build())
                .layer(new DenseLayer.Builder().activation(Activation.RELU)
                        .nOut(500).build())
                .layer(new OutputLayer.Builder(LossFunctions.LossFunction.NEGATIVELOGLIKELIHOOD)
                        .nOut(outputNum)
                     .activation(Activation.SOFTMAX)
                        .build())
                .setInputType(InputType.convolutionalFlat(28,28,1))
                .build();

```

## Documentation, Guides and Tutorials
You can find the official documentation for Deeplearning4J and the other libraries of its ecosystem at http://deeplearning4j.konduit.ai/.

## Want some examples?
We have separate repository with various examples available: https://github.com/eclipse/deeplearning4j-examples

## Building from source
It is preferred to use the official pre-compiled releases (see above). But if you want to build from source, first take a look at the prerequisites for building from source here: https://deeplearning4j.konduit.ai/multi-project/how-to-guides/build-from-source.

To build everything, we can use commands like
```
./change-cuda-versions.sh x.x
./change-scala-versions.sh 2.xx
./change-spark-versions.sh x
mvn clean install -Dmaven.test.skip -Dlibnd4j.cuda=x.x -Dlibnd4j.compute=xx
```
or
```
mvn -B -V -U clean install -pl  -Dlibnd4j.platform=linux-x86_64 -Dlibnd4j.chip=cuda -Dlibnd4j.cuda=11.0 -Dlibnd4j.compute=<your GPU CC> -Djavacpp.platform=linux-x86_64 -Dmaven.test.skip=true
```

An example of GPU "CC" or compute capability is 61 for Titan X Pascal.


## License

[Apache License 2.0](LICENSE)

## Commercial Support
Deeplearning4J is actively developed by the team at [Konduit K.K.](https://konduit.ai). 

[If you need any commercial support feel free to reach out to us. at [support@konduit.ai](mailto:support@konduit.ai)  

  

12/12

https://math.stackexchange.com/questions/2132144/how-to-find-parametric-equations-from-a-polynomial-equation-curve

https://www.youtube.com/watch?v=97pe-QlSGqA   the good stuff at 30.00

https://www.youtube.com/watch?v=rLsmajsyaEg

12/13

12/30


DataRobot’s Feature Discovery streamlines this process by offering
automated feature engineering that enables the creation of valuable new features
for your machine learning models.




















































