11/21/19


First things first... 
Have not been on this in a while...

Need the good scripts that mention indices/dimensions available.
And no cluttering the workbook, so start with a new ?page? in notebook.

//  Return indices available on ZADDB

MATCH (i:IndexedBy)
WITH toInteger(i.MaxN) as iMaxNN Order By toInteger(i.MaxN)  
RETURN COLLECT(DISTINCT iMaxNN)      // ORDER BY toInteger(i.MaxN)
//RETURN iMaxNN


zepl substitutes i.N for text input value as follows

WHERE (i.N='4' OR i.N='6')

    for record in tx.run("""MATCH (v:VertexNode) <-[]-(i:IndexedBy)-[]->(e:Evaluate),
    (t:TwoSeqFactor)<-[]-(i) WHERE (i.N='$zinput' OR i.    ...




The two create new dimension scripts.
The first is specific to quadratics

The second can be generalized to the "next" even dimension.



MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) 
                     where i.N='5' AND i.MaxN='6' AND i.Dimension="2" //AND t.twoSeq=1
WITH i.N as iN, i.MaxN as iM,e,v,t                        
OPTIONAL MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:toString(t.twoSeq)}),(tt:TwoSeqFactor)<-[]-(ii)
                    where ii.MaxN='6'  AND ii.Dimension="2"
WITH iN,iM,e,v,vv,t,tt,ee
CREATE (p:ProductArgsNode {Divisor:t.twoSeq,Dimension:"2"})        // Because the products are 2 Dimension.  
FOREACH(snoreMe IN CASE  WHEN vv.Vertex IS null  THEN [1] ELSE [] END | 
CREATE (v) <- [:ProductRelationT {T:t.twoSeq}] - (p)                           
 Set p.Divisor = 2 )
FOREACH(snoreMe IN CASE  WHEN vv.Vertex IS not null  THEN [1] ELSE [] END | 
CREATE (v) <- [:ProductRelationT {T:t.twoSeq}] - (p) 
Set p.Divisor = 4   
cREATE (p) - [:ProductRelationA {T:tt.twoSeq, Eval:ee.Value}] -> (vv)  )
MERGE  (i:IndexedBy {N:iN, Dimension:"4",MaxN:iM,RowCounter:t.twoSeq})
MERGE  (i)-[:VertexIndexedBy]->(p)
MERGE (i) -[:IndexedByEvaluate]->(e)
return i,p,v


MATCH (v:VertexNode) <-[pR:ProductRelationT] -  (p:ProductArgsNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate) 
      where i.N='5' AND i.MaxN='6' AND i.Dimension="4" 
WITH i.N as iN, i.MaxN as iM,e,p, pR.T as t                          
OPTIONAL MATCH (pp:ProductArgsNode)<-[]- (ii:IndexedBy)-[]->(ee:Evaluate {Value:toString(t)})
      where ii.MaxN='6'  AND ii.Dimension="4"  // and ee.Value="4" 
WITH  iN,iM,e,p,pp,t,ee
CREATE (ppp:ProductArgsNode {Divisor:t,Dimension:"4"}) 
FOREACH(snoreMe IN CASE  WHEN pp IS null  THEN [1] ELSE [] END | 
CREATE (p) <- [:ProductRelationT {T:1}] - (ppp) )
FOREACH(snoreMe IN CASE  WHEN pp IS not null  THEN [1] ELSE [] END | 
CREATE (p) <- [:ProductRelationT {T:t}] - (ppp)    
CREATE (ppp) - [:ProductRelationA {T:t, Eval:ee.Value}] -> (pp)  )
MERGE  (i:IndexedBy {N:iN, Dimension:"8",MaxN:iM,RowCounter:t})
MERGE  (i)-[:VertexIndexedBy]->(ppp)
MERGE (i) -[:IndexedByEvaluate]->(e)
return  count(ppp)


Remember again how these scripts run.  With i.MaxN, have to run for each of it's rows.


The pm lab is put quartets and then octets for NmaxN=6 on graphdb.

The big + is now to use    //MATCH (i:IndexedBy) where i.Dimension="${Dimension}"    example.

and try:   // make quartets

iN  iMaxN
2    6
3    6
4    6
5    6

//  make octets

iN  iMaxN
2    6
3    6
4    6
5    6


11/22


Rember quadratic/integer isomorphism theory:

(MaxN,N) define a ^ 2 integer.
The definition is composed of sets of quadratics with each set multipied through by a scalar.
The scalar is in a sequence of 2^n.

The definition permits further degreed representation of integers:
With the scalar being a power of 2 and (MaxN,N) also a power of 2.
Wherever the power of two is defined, substitute in it's definition.
  
The substition is performed set theoretically.  

MATCH (v:VertexNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate),(t:TwoSeqFactor)<-[]-(i) 
                     where i.N='5' AND i.MaxN='6' AND i.Dimension="2" //AND t.twoSeq=1
WITH i.N as iN, i.MaxN as iM,e,v,t                        
OPTIONAL MATCH (vv:VertexNode)<-[]-(ii:IndexedBy)-[]->(ee:Evaluate {Value:toString(t.twoSeq)}),(tt:TwoSeqFactor)<-[]-(ii)
                    where ii.MaxN='6'  AND ii.Dimension="2"
WITH iN,iM,e,v,vv,t,tt,ee
CREATE (p:ProductArgsNode {Divisor:t.twoSeq,Dimension:"2"})        // Because the products are 2 Dimension.  
FOREACH(snoreMe IN CASE  WHEN vv.Vertex IS null  THEN [1] ELSE [] END | 
CREATE (v) <- [:ProductRelationT {T:t.twoSeq}] - (p)                           
 Set p.Divisor = 2 )
FOREACH(snoreMe IN CASE  WHEN vv.Vertex IS not null  THEN [1] ELSE [] END | 
CREATE (v) <- [:ProductRelationT {T:t.twoSeq}] - (p) 
Set p.Divisor = 4   
cREATE (p) - [:ProductRelationA {T:tt.twoSeq, Eval:ee.Value}] -> (vv)  )
MERGE  (i:IndexedBy {N:iN, Dimension:"4",MaxN:iM,RowCounter:t.twoSeq})
MERGE  (i)-[:VertexIndexedBy]->(p)
MERGE (i) -[:IndexedByEvaluate]->(e)
return i,p,v


MATCH (i:IndexedBy)-[]->(e:Evaluate),(i:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode) where i.N='4' AND i.MaxN='10' AND i.Dimension="4"
WITH i,e,p,i.N as iN, i.MaxN as iM
MATCH (v:VertexNode) <- [p1:ProductRelationT] - (p) 
WITH i,e,p,v,p1,iN,iM
OPTIONAL MATCH  (p) - [p2:ProductRelationA] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD


Need the sleuthing of collecting paths of ProductArgNode's downto the respective VertexNode's.

Given the index node signature,
as before, last summer, want to start with relating ProductArgNodes {Dimension:2} and ProductArgNodes {Dimension:4}

//  Note the new terminology:  he he,, the "signature" of the index nodes.





MATCH (v:VertexNode) <-[pR:ProductRelationT] -  (p:ProductArgsNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate) 
      where i.N='5' AND i.MaxN='6' AND i.Dimension="4" 
WITH i.N as iN, i.MaxN as iM,e,p, pR.T as t                           
OPTIONAL MATCH (pp:ProductArgsNode)<-[]- (ii:IndexedBy)-[]->(ee:Evaluate {Value:toString(t)})
      where ii.MaxN='6'  AND ii.Dimension="4"  // and ee.Value="4" 
WITH  iN,iM,e,p,pp,t,ee
CREATE (ppp:ProductArgsNode {Divisor:t,Dimension:"4"}) 
FOREACH(snoreMe IN CASE  WHEN pp IS null  THEN [1] ELSE [] END | 
CREATE (p) <- [:ProductRelationT {T:1}] - (ppp) )
FOREACH(snoreMe IN CASE  WHEN pp IS not null  THEN [1] ELSE [] END | 
CREATE (p) <- [:ProductRelationT {T:t}] - (ppp)    
CREATE (ppp) - [:ProductRelationA {T:t, Eval:ee.Value}] -> (pp)  )
MERGE  (i:IndexedBy {N:iN, Dimension:"8",MaxN:iM,RowCounter:t})
MERGE  (i)-[:VertexIndexedBy]->(ppp)
MERGE (i) -[:IndexedByEvaluate]->(e)
return  count(ppp)




MATCH (i:IndexedBy)-[]->(e:Evaluate),
      (i:IndexedBy)-[:VertexIndexedBy]->(pp:ProductArgsNode)-[pR1:ProductRelationT|ProductRelationA]->(p:ProductArgsNode), 
      (ii:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode)
 where i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter=2 AND ii.RowCounter=2
WITH i,e,p,i.N as iN, i.MaxN as iM,pp,pR1.T as pR1T,pp.Divisor as ppD1,pR1.Eval as pR1E
MATCH (v:VertexNode) <- [p1:ProductRelationT] - (p) 
WITH i,e,p,v,p1,iN,iM,pp,pR1T,pp.Divisor as pD1,pR1E,p1.T as p1TT,ppD1 
OPTIONAL MATCH  (p) - [p2:ProductRelationA] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD,pp,pR1T,pR1E,ppD1, p1TT,p2.T as p2TT,p2.Eval as p2EE
return i,e,pp,p


11/24


Rember quadratic/integer isomorphism theory:

(MaxN,N) define a ^ 2 integer.
The definition is composed of sets of quadratics with each set multipied through by a scalar.
The scalar is in a sequence of 2^n.

The definition permits further degreed representation of integers:
With the scalar being a power of 2 and (MaxN,N) also a power of 2.
Wherever the power of two is defined, substitute in it's definition.
  
The substition is performed set theoretically.


The description of opportunity twoSeq presents for nextEvenDimension.


11/25

The enquery into CreateNextDimension nodes scripts.

Two scripts exist.  The first is a script particular to the TwoPolynomial Quadratics.
The second is the general form of further graph extensions.  They both are performant.

DimensionalArithmetic developemnt was suspended late July. The believed to be correct second script 
for further graph extensions was embelished with a first pass at the comprehension.

The course of developemnt for the further dimension comprehension scripts will be in accord to the
origonal development.  With NMax=6 on graph.db, will attempt to comprehend rowCounter=8 pattern.

 
MATCH (i:IndexedBy)-[]->(e:Evaluate),
      (i:IndexedBy)-[:VertexIndexedBy]->(pp:ProductArgsNode)-[pR1:ProductRelationA]->(p:ProductArgsNode),
      (ii:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter="8"
Return  distinct pp.Divisor  // i      // count(p) 

pp.Divisor
"8"


MATCH (i:IndexedBy)-[]->(e:Evaluate),
      (i:IndexedBy)-[:VertexIndexedBy]->(pp:ProductArgsNode)-[pR1:ProductRelationA]->(p:ProductArgsNode),
      (ii:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter="8"
Return  distinct p.Divisor  // i      // count(p)

p.Divisor
2             
// ********************************************************************************************* //
MATCH (i:IndexedBy)-[]->(e:Evaluate),
      (i:IndexedBy)-[:VertexIndexedBy]->(pp:ProductArgsNode)-[pR1:ProductRelationT|ProductRelationA]->(p:ProductArgsNode),
      (ii:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter=8 //  AND p.Divisor=4
WITH i,e,p,i.N as iN, i.MaxN as iM,            pp,pR1.T as pR1T,pp.Divisor as ppD1,pR1.Eval as pR1E

MATCH (v:VertexNode {Degree:"0") <- [p1:ProductRelationT] - (p) 
WITH i,e,p,v,p1,iN,iM,pp,pR1T,pp.Divisor as pD1,pR1E,p1.T as p1TT,ppD1 
OPTIONAL MATCH  (p) - [p2:ProductRelationA ] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD       ,pp,pR1T,pR1E,ppD1, p1TT,p2.T as p2TT,p2.Eval as p2EE
RETURN i,e,p,v,vv,pp

//  *******************************************************************************************  //

MATCH (i:IndexedBy)-[]->(e:Evaluate),(i:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode) where i.N='4' AND i.MaxN='10' AND i.Dimension="4"
WITH i,e,p,i.N as iN, i.MaxN as iM

MATCH (v:VertexNode) <- [p1:ProductRelationT] - (p) 
WITH i,e,p,v,p1,iN,iM
OPTIONAL MATCH  (p) - [p2:ProductRelationA] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD
WITH {Divisor:pD,afe:toInteger(p2.Eval),tft:toInteger(p1.T),DS: COLLECT( {  TDegree:CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END,
                                      TScalar:CASE WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END,
                                      ATwoSeq:toInteger(p2.T),
                                      ADegree:toInteger(vv.Degree),   
                                      AScalar:CASE WHEN toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END })    }  AS argumentProduct,iN,iM,e

WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.tft as aPafe,iN,iM,argumentProduct.Divisor as apD
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe,iN,iM,apD
UNWIND aPTds as aPTdsU
WITH CASE WHEN aPTdsU.AScalar IS null THEN                                         //  ProductArgsNode gets the division information.                 
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toInteger(aPafe)), 
      ResultDegree:aPTdsU.TDegree,
      ResultTwoSeq:aPTdsU.tft}),ET:aPafe,Divisor:apD}
ELSE
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toFloat(aPTdsU.AScalar)*aPTdsU.ATwoSeq), 
      ResultDegree: CASE WHEN aPTdsU.ADegree=-1 THEN aPTdsU.TDegree ELSE aPTdsU.ADegree+aPTdsU.TDegree END,
      ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe,Divisor:apD}
END
AS resultProduct,iN,iM
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT,iN,iM,resultProduct.Divisor as rpD1
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT,iN,iM,rpD1
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT,Divisor:rpD1} as resultMap,iN,iM

WITH COLLECT(resultMap) as resultMapC,resultMap.ET as eTrm,resultMap.RDegree as rDRM,iN,iM,resultMap.Divisor as rpD2
UNWIND RANGE(0,SIZE(resultMapC)-1) as iII
WITH resultMapC[iII].RScalarList as rSL,eTrm,rDRM,iN,iM,rpD2
UNWIND RANGE(0,SIZE(rSL)-1) as iIII
UNWIND rSL[iIII] as rSLI
WITH COLLECT(rSLI.RScalar) as cts,eTrm,rDRM,iN,iM,rpD2

With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,eTrm,rDRM,iN,iM,rpD2
With TotalRScalar/rpD2 as TotalRScalaR,eTrm,rDRM,iN,iM
//RETURN TotalRScalar,eTrm,rDRM,iN,iM
RETURN TotalRScalaR,toInteger(eTrm),toInteger(rDRM),toInteger(iN),toInteger(iM)


// *****************************************************************************************  //

11/27

    The lab is to refactor Match pattern into a path = 

    The current pattern, identifies a terminal ProductArgsNode. Subsequent Match, Optional Match pattern across ProductRelationT | ProductRelationA complete pattern.

    Believe need homogeneous information across terminal relations will permit complete algebra snapshot in "p= Optional Match".

    The CreateNextDimension script differentiates  ProductRelationT | ProductRelationA with ProductRelationA maintaining its "Eval"  

    The refactor will not contain the pattern snippit for other than primary IndexedBy nodes.


MATCH (i:IndexedBy)-[]->(e:Evaluate),
      p= (i:IndexedBy)-[:VertexIndexedBy]->(pp:ProductArgsNode)-[*1..10]->(p:ProductArgsNode)- [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter=8 
RETURN p

     //     (ii:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode)


WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter=8 //  AND p.Divisor=4
WITH i,e,p,i.N as iN, i.MaxN as iM,            pp,pR1.T as pR1T,pp.Divisor as ppD1,pR1.Eval as pR1E

MATCH (v:VertexNode {Degree:"0") <- [p1:ProductRelationT] - (p) 
WITH i,e,p,v,p1,iN,iM,pp,pR1T,pp.Divisor as pD1,pR1E,p1.T as p1TT,ppD1 
OPTIONAL MATCH  (p) - [p2:ProductRelationA ] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD       ,pp,pR1T,pR1E,ppD1, p1TT,p2.T as p2TT,p2.Eval as p2EE
RETURN i,e,p,v,vv,pp


MATCH p=(pp:ProductArgsNode)-[*1..10]->(p:ProductArgsNode)- [pAT] -> (v:VertexNode)
RETURN p


MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*1..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter="8" 
RETURN path


definatly need the path 

11/28

%neo4j

MATCH (v:VertexNode)<-[r1]-(i:IndexedBy)-[r2]->(e:Evaluate),(t:TwoSeqFactor)<-[r3]-(i) 
                     where i.N='5' AND i.MaxN='6' AND i.Dimension="2" //AND t.twoSeq=1
Return i.N as iN, i.MaxN as iM,e,v,t,r1,r2,r3,i

%neo4j

MATCH (v:VertexNode)<-[r1]-(i:IndexedBy)-[r2]->(e:Evaluate),(t:TwoSeqFactor)<-[r3]-(i) 
                     where i.N='4' AND i.MaxN='6' AND i.Dimension="2" //AND t.twoSeq=1
Return i.N as iN, i.MaxN as iM,e,v,t,r1,r2,r3,i


%neo4j
MATCH (v:VertexNode)<-[r1]-(i:IndexedBy)-[r2]->(e:Evaluate),(t:TwoSeqFactor)<-[r3]-(i) 
                     where i.N='3' AND i.MaxN='6' AND i.Dimension="2" //AND t.twoSeq=1
Return i.N as iN, i.MaxN as iM,e,v,t,r1,r2,r3,i

%neo4j
MATCH (v:VertexNode)<-[r1]-(i:IndexedBy)-[r2]->(e:Evaluate),(t:TwoSeqFactor)<-[r3]-(i) 
                     where i.N='2' AND i.MaxN='6' AND i.Dimension="2" //AND t.twoSeq=1
Return i.N as iN, i.MaxN as iM,e,v,t,r1,r2,r3,i


MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*1..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter="8" 
RETURN path

╒═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╕
│"path"                                                                                                                                                                                                                                 │
╞═══════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════════╡
│[{"Dimension":"8","RowCounter":"8","MaxN":"6","N":"5"},{},{"Divisor":"8","Dimension":"4"},{"Divisor":"8","Dimension":"4"},{"T":"8","Eval":"8"},{"Divisor":2,"Dimension":"2"},{"Divisor":2,"Dimension":"2"},{"T":"1"},{"Vertex":"1 -3 1 │
│0 0","Degree":"1","Scalar":"-3"}]                                                                                                                                                                                                      │
├───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────┤
│[{"Dimension":"8","RowCounter":"8","MaxN":"6","N":"5"},{},{"Divisor":"8","Dimension":"4"},{"Divisor":"8","Dimension":"4"},{"T":"8"},{"Divisor":4,"Dimension":"2"},{"Divisor":4,"Dimension":"2"},{"T":"2","Eval":"8"},{"Vertex":"1 -5 1 │
│0 0","Degree":"1","Scalar":"-5"}]

══════════════╕
│"length(path)"│
╞══════════════╡
│3             │
├──────────────┤
│3             │
├──────────────┤


Seems like length(path) returns the number of relations in path.





MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*1..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter="8" 
RETURN [node in nodes(path) | node.RowCounter] as nodesinPath

╒════════════════════╕
│"nodesinPath"       │
╞════════════════════╡
│["8",null,null,null]│
├────────────────────┤
│["8",null,null,null]│
├────────────────────┤

MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*1..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter="8" 
With [node in nodes(path) | node.Dimension] as nodesinPath
RETURN nodesinPath[0]

╒════════════════╕
│"nodesinPath[0]"│
╞════════════════╡
│"8"             │
├────────────────┤
│"8"             │
├────────────────┤


MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*1..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter="8" 
With pp,path 
Unwind NODES(path) as pathh
RETURN id(pp),pathh


╒════════╤═════════════════════════════════════════════════════╕
│"id(pp)"│"pathh"                                              │
╞════════╪═════════════════════════════════════════════════════╡
│282919  │{"Dimension":"8","RowCounter":"8","MaxN":"6","N":"5"}│
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Divisor":"8","Dimension":"4"}                      │
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Divisor":2,"Dimension":"2"}                        │
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Vertex":"1 -3 1 0 0","Degree":"1","Scalar":"-3"}   │
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Dimension":"8","RowCounter":"8","MaxN":"6","N":"5"}│
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Divisor":"8","Dimension":"4"}                      │
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Divisor":4,"Dimension":"2"}                        │
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Vertex":"1 -5 1 0 0","Degree":"1","Scalar":"-5"}   │
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Dimension":"8","RowCounter":"8","MaxN":"6","N":"5"}│
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Divisor":"8","Dimension":"4"}                      │
├────────┼─────────────────────────────────────────────────────┤
│282919  │{"Divisor":4,"Dimension":"2"}                        │
├────────┼─────────────────────────────────────────────────────┤

12/3

  cypher filter,extract was applied in script testing wilson's theory.

Working with the path pattern started last week.  Afternoon is getting data from each entity in path and 
some sort of aggrigating.


//Btw, I am using neo4j-shell to connect remotely to a server and I already set wrapper.java.initmemory and wrapper.java.maxmemory to 5000. 


//I know it is possible to do the summing with Neo4j Traversal API. Is it possible to do this in Cypher?

//Aggregation in Cypher uses all the non-aggregation variables as the grouping key, which provides context for the aggregation


MATCH p=(n:Person{name:"Neo"})-[*]->(end) where not (end)-->()
RETURN extract(x IN nodes(p) | x.name)

MATCH p = (n)-[*]->(m)
RETURN n.ID as Source, m.ID as Target, n.Amount,
       reduce(total = 0, tot IN nodes(p) | total + tot.Amount) AS totalEUR
ORDER BY totalEUR DESC


So, please state the nature of this problem....
It has something to do with the rounding error,  want to aggrigate divisors more completely.


Current division information within zaddb:

The comprehend quartets script, reads p:ProductArgsNode as p.Divisor and is included as an index for 
first pattern projection.  

Looks like it really is time to dig in and "comprehend" the script.



Eyes are on the Dimension=4 script.


An argumentProduct projection exists for each rowCounter, known in the projection as tft.
In the 6,5 computation, there are projections for 1,2,4,8.  Divisor information is recorded alongside
the rowcounter; in the quadratic, the divisor is either 2 or 4. 

 
MATCH (i:IndexedBy)-[]->(e:Evaluate),(i:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode) where i.N='5' AND i.MaxN='6' AND i.Dimension='4'
WITH i,e,p,i.N as iN, i.MaxN as iM
MATCH (v:VertexNode) <- [p1:ProductRelationT] - (p) 
WITH i,e,p,v,p1,iN,iM
OPTIONAL MATCH  (p) - [p2:ProductRelationA] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD
WITH {Divisor:pD,afe:toInteger(p2.Eval),tft:toInteger(p1.T),DS: COLLECT( {  TDegree:CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END,
                                      TScalar:CASE WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END,
                                      ATwoSeq:toInteger(p2.T),
                                      ADegree:toInteger(vv.Degree),   
                                      AScalar:CASE WHEN toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END })    }  AS argumentProduct,iN,iM,e
 WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.tft as aPafe,iN,iM,argumentProduct.Divisor as apD                                     
 Return aPafe,iN,iM,apD,argumentProductt


12/4  


The theory on higher dimension integer representations is built on the the generated quadratic theory previously described.
Have each integer represented in a MaxN,N sequence composed of  the terms of a quadratic equation multiplied through by their
respective power of two scalar.  The power of two scalar is the opportunity for substitution as it may be represented in a previously
defined Nmax,N integer.  That is, multiply the quadratic defined with its scalar by the quadratic's defining the scalar.  And do
not forget to devide out the result by that same numerical scalar.



A first go at QuadraticCypher script naration:

argumentProduct is projection of rows of collected  pairs of argument,target vertex's (note argument vertex's may be null).
Its context is apafe, aka argumentProduct.tft, otherwise known as rowCounter and is ProductRelatonT.t.  There are rowcounter many of 
them.

Then collected, argumentProductt an arbitrary lenght list.
The pairs of vertex terms collected in each map in list are multiplied and then multiplied by aTwoSeq aka ProductRelationA.T
when argument terms exist otherewise ProductRelatonT.T 
ResultProduct is the projection  with apafe and divisior as context and there are rowCounter many of them.

A map of Scalars are collected by degree along with context of degree, apafe, and divisor and named resultMap.

This subsequent paragraph may be redundant.  The scalars themselves are aggrigated as list with context of eTerm (rowcounter value0,
degree and rpD2 (divisor).

The list is reduced maintaining context.


and so, when along the path,  a node twice before the next relaton to vertex...  how to see this in cypher.  Itt needs to be reconciled.
and so, the point of breaking apart...  There is more division to corrolate...   
and so, the mess of matching the pattern with no contraints on arguments can be refined with guess what... adding a constraint on the arguments.

RELATIONSHIPS(p)

282267

iM,iN and aPafe // apafe is otherwise known as rowCounter.



12/6 

 A look at the data dictionary.
 Need Nodes and Relations.


MATCH (n:IndexedBy) RETURN n 
╒══════════════════════════════════════════════════════════╕
│"n"                                                       │
╞══════════════════════════════════════════════════════════╡
│{"Dimension":"2","RowCounter":"42","MaxN":"200","N":"103"}│
├──────────────────────────────────────────────────────────┤
│{"Dimension":"2","RowCounter":"-1","MaxN":"4","N":"2"}    │
├──────────────────────────────────────────────────────────┤
│{"Dimension":"2","RowCounter":"43","MaxN":"200","N":"103"}│
├──────────────────────────────────────────────────────────┤
MATCH (n:ProductArgsNode) RETURN n
╒═════════════╕
│"n"          │
╞═════════════╡
│{"Divisor":2}│
├─────────────┤
│{"Divisor":2}│
├─────────────┤
│{"Divisor":2}│
├─────────────┤
MATCH (n:VertexNode) RETURN n
╒══════════════════════════════════════════════════════╕
│"n"                                                   │
╞══════════════════════════════════════════════════════╡
│{"Vertex":"0 3 -1 0 0","Degree":"-1","Scalar":"3"}    │
├──────────────────────────────────────────────────────┤
│{"Vertex":"1 -2 1 0 0","Degree":"1","Scalar":"-2"}    │
├──────────────────────────────────────────────────────┤
│{"Vertex":"1 1 2 0 0","Degree":"2","Scalar":"1"}      │
├──────────────────────────────────────────────────────┤
MATCH p=()-[r:ProductRelationA]->() RETURN p 
╒══════════════════════════════════════════════════════════════════════╕
│"p"                                                                   │
╞══════════════════════════════════════════════════════════════════════╡
│[{"Divisor":4},{"T":"1","Eval":"4"},{"Vertex":"0 72 0 0 0","Degree":"0│
│","Scalar":"72"}]                                                     │
├──────────────────────────────────────────────────────────────────────┤
│[{"Divisor":4},{"T":"1","Eval":"4"},{"Vertex":"1 -9 1 0 0","Degree":"1│
│","Scalar":"-9"}]                                                     │
├──────────────────────────────────────────────────────────────────────┤
MATCH p=()-[r:ProductRelationT]->() RETURN p
╒══════════════════════════════════════════════════════════════════════╕
│"p"                                                                   │
╞══════════════════════════════════════════════════════════════════════╡
│[{"Divisor":2},{"T":"1"},{"Vertex":"1 -98 1 0 0","Degree":"1","Scalar"│
│:"-98"}]                                                              │
├──────────────────────────────────────────────────────────────────────┤
│[{"Divisor":2},{"T":"1"},{"Vertex":"1 1 2 0 0","Degree":"2","Scalar":"│
│1"}]                                                                  │
├──────────────────────────────────────────────────────────────────────┤

MATCH p=(:Person{pid:1})-[*0..]-(m)
WITH m, NODES(p) AS ns
UNWIND ns AS n
WITH m, ns, COUNT(DISTINCT n) AS cns
WHERE SIZE(ns) = cns
return m


MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*1..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter="8" 
With  nodes(path) as nPath
RETURN SIZE(nPath)


╒═════════════╕
│"SIZE(nPath)"│
╞═════════════╡
│4            │
├─────────────┤
│4            │
├─────────────┤

MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*1..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="8" AND i.RowCounter="8" 
With  RELATIONSHIPS(path) as nPath
RETURN SIZE(nPath)


╒═════════════╕
│"SIZE(nPath)"│
╞═════════════╡
│3            │
├─────────────┤
│3            │
├─────────────┤



╒══════════════════════════════════════════════════════════════════════╕
│"path"                                                                │
├──────────────────────────────────────────────────────────────────────┤
│[{"Dimension":"8","RowCounter":"2","MaxN":"6","N":"5"},{},{"Divisor":"│
│2","Dimension":"4"},{"Divisor":"2","Dimension":"4"},{"T":1},{"Divisor"│
│:2,"Dimension":"2"},{"Divisor":2,"Dimension":"2"},{"T":"2"},{"Vertex":│
│"0 12 0 0 0","Degree":"0","Scalar":"12"}]                             │
├──────────────────────────────────────────────────────────────────────┤
│[{"Dimension":"8","RowCounter":"4","MaxN":"6","N":"5"},{},{"Divisor":"│
│4","Dimension":"4"},{"Divisor":"4","Dimension":"4"},{"T":"4","Eval":"4│
│"},{"Divisor":2,"Dimension":"2"},{"Divisor":2,"Dimension":"2"},{"T":"1│
│"},{"Vertex":"1 1 2 0 0","Degree":"2","Scalar":"1"}]                  │
└──────────────────────────────────────────────────────────────────────┘


Still, this script works.

MATCH (i:IndexedBy)-[]->(e:Evaluate),(i:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode) where i.N='4' AND i.MaxN='10' AND i.Dimension="4"
WITH i,e,p,i.N as iN, i.MaxN as iM
MATCH (v:VertexNode) <- [p1:ProductRelationT] - (p) 


WITH i,e,p,v,p1,iN,iM
OPTIONAL MATCH  (p) - [p2:ProductRelationA] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD
WITH {Divisor:pD,afe:toInteger(p2.Eval),tft:toInteger(p1.T),DS: COLLECT( {  TDegree:CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END,
                                      TScalar:CASE WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END,
                                      ATwoSeq:toInteger(p2.T),
                                      ADegree:toInteger(vv.Degree),   
                                      AScalar:CASE WHEN toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END })    }  AS argumentProduct,iN,iM,e

WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.tft as aPafe,iN,iM,argumentProduct.Divisor as apD
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe,iN,iM,apD
UNWIND aPTds as aPTdsU
WITH CASE WHEN aPTdsU.AScalar IS null THEN                                         //  ProductArgsNode gets the division information.                 
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toInteger(aPafe)), 
      ResultDegree:aPTdsU.TDegree,
      ResultTwoSeq:aPTdsU.tft}),ET:aPafe,Divisor:apD}
ELSE
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toFloat(aPTdsU.AScalar)*aPTdsU.ATwoSeq), 
      ResultDegree: CASE WHEN aPTdsU.ADegree=-1 THEN aPTdsU.TDegree ELSE aPTdsU.ADegree+aPTdsU.TDegree END,
      ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe,Divisor:apD}
END
AS resultProduct,iN,iM
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT,iN,iM,resultProduct.Divisor as rpD1
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT,iN,iM,rpD1
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT,Divisor:rpD1} as resultMap,iN,iM

WITH COLLECT(resultMap) as resultMapC,resultMap.ET as eTrm,resultMap.RDegree as rDRM,iN,iM,resultMap.Divisor as rpD2
UNWIND RANGE(0,SIZE(resultMapC)-1) as iII
WITH resultMapC[iII].RScalarList as rSL,eTrm,rDRM,iN,iM,rpD2
UNWIND RANGE(0,SIZE(rSL)-1) as iIII
UNWIND rSL[iIII] as rSLI
WITH COLLECT(rSLI.RScalar) as cts,eTrm,rDRM,iN,iM,rpD2

With REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,eTrm,rDRM,iN,iM,rpD2
With TotalRScalar/rpD2 as TotalRScalaR,eTrm,rDRM,iN,iM
//RETURN TotalRScalar,eTrm,rDRM,iN,iM
RETURN TotalRScalaR,toInteger(eTrm),toInteger(rDRM),toInteger(iN),toInteger(iM)




MATCH (i:IndexedBy)-[]->(e:Evaluate),(i:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode) where i.N='4' AND i.MaxN='10' AND i.Dimension="4"
WITH i,e,p,i.N as iN, i.MaxN as iM
MATCH (v:VertexNode) <- [p1:ProductRelationT] - (p) 


WITH i,e,p,v,p1,iN,iM
OPTIONAL MATCH  (p) - [p2:ProductRelationA] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD
WITH {Divisor:pD,afe:toInteger(p2.Eval),tft:toInteger(p1.T),DS: COLLECT( {  TDegree:CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END,
                                      TScalar:CASE WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END,
                                      ATwoSeq:toInteger(p2.T),
                                      ADegree:toInteger(vv.Degree),   
                                      AScalar:CASE WHEN toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END })    }  AS argumentProduct,iN,iM,e


MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*0..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="4" //AND i.RowCounter="8" 
//With  RELATIONSHIPS(path) as nPath
RETURN path limit 5

╒══════════════════════════════════════════════════════════════════════╕
│"path"                                                                │
╞══════════════════════════════════════════════════════════════════════╡
│[{"Dimension":"4","RowCounter":"4","MaxN":"6","N":"5"},{},{"Divisor":4│
│,"Dimension":"2"},{"Divisor":4,"Dimension":"2"},{"T":"1","Eval":"4"},{│
│"Vertex":"0 30 0 0 0","Degree":"0","Scalar":"30"}]                    │
├──────────────────────────────────────────────────────────────────────┤
│[{"Dimension":"4","RowCounter":"4","MaxN":"6","N":"5"},{},{"Divisor":4│
│,"Dimension":"2"},{"Divisor":4,"Dimension":"2"},{"T":"4"},{"Vertex":"1│
│ -5 1 0 0","Degree":"1","Scalar":"-5"}]                               │
├──────────────────────────────────────────────────────────────────────┤


MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*0..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="4" //AND i.RowCounter="8" 
With  RELATIONSHIPS(path) as nPath
RETURN SIZE(nPath)

╒═════════════╕
│"SIZE(nPath)"│
╞═════════════╡
│2            │
├─────────────┤
│2            │
├─────────────┤
│2            │



MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*0..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="4" //AND i.RowCounter="8" 
With  nodes(path) as nPath
RETURN SIZE(nPath)


╒═════════════╕
│"SIZE(nPath)"│
╞═════════════╡
│3            │
├─────────────┤
│3            │
├─────────────┤
│3            │
├─────────────┤


So, when path variable is associated with optional match....  // no


MATCH (i:IndexedBy)-[]->(e:Evaluate),(i:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode) where i.N='4' AND i.MaxN='10' AND i.Dimension="4"
WITH i,e,p,i.N as iN, i.MaxN as iM
MATCH (v:VertexNode) <- [p1:ProductRelationT] - (p) 
WITH i,e,p,v,p1,iN,iM
OPTIONAL MATCH  (p) - [p2:ProductRelationA] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD
WITH {Divisor:pD,afe:toInteger(p2.Eval),tft:toInteger(p1.T),DS: COLLECT( {  TDegree:CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END,
                                      TScalar:CASE WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END,
                                      ATwoSeq:toInteger(p2.T),
                                      ADegree:toInteger(vv.Degree),   
                                      AScalar:CASE WHEN toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END })    }  AS argumentProduct,iN,iM,e


MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*0..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="4" //AND i.RowCounter="8" 
//With  RELATIONSHIPS(path) as nPath
RETURN path limit 5


The origonal script takes advantage of optional match for setting argument scalar (has value null otherwise)

Have big issue with "path" variable.  It dosn't associate the target/argument variables.
Otherwise must include node id case  


Want something like, for each IndexedBy node, span and collect.

How about....  The match pattern is alway productArgs node to productArgs node.  With Cavit....
               Being, akin to GenerateNextDimension script, the map, argumentProduct or even resultProduct is kept unprocessed but now a formal member of graph.


The answer is no maps as properties...  
The work around is re-image the graph.    

This means, 

WITH {Divisor:pD,afe:toInteger(p2.Eval),tft:toInteger(p1.T),


                                      DS: COLLECT( {  TDegree:CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END,
                                      TScalar:CASE WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END,
                                      ATwoSeq:toInteger(p2.T),
                                      ADegree:toInteger(vv.Degree),   
                                      AScalar:CASE WHEN toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END })    }  AS argumentProduct,iN,iM,e


MaxN,N,Dimension, along with    Divisor,afe,tft are properties of   "CollectedProductArgsNode".
Each of this node's childeren are memebers of the Collected DS.


MATCH (v:VertexNode) <-[pR:ProductRelationT] -  (p:ProductArgsNode)<-[]-(i:IndexedBy)-[]->(e:Evaluate) 
      where i.N="${iN}" AND i.MaxN="${iMaxN}" AND i.Dimension="4" 
WITH i.N as iN, i.MaxN as iM,e,p, pR.T as t                          
OPTIONAL MATCH (pp:ProductArgsNode)<-[]- (ii:IndexedBy)-[]->(ee:Evaluate {Value:toString(t)})
      where ii.MaxN="${iiMaxN}"  AND ii.Dimension="4"  // and ee.Value="4" 
WITH  iN,iM,e,p,pp,t,ee
CREATE (ppp:ProductArgsNode {Divisor:t,Dimension:"4"}) 
FOREACH(snoreMe IN CASE  WHEN pp IS null  THEN [1] ELSE [] END | 
CREATE (p) <- [:ProductRelationT {T:1}] - (ppp) )
FOREACH(snoreMe IN CASE  WHEN pp IS not null  THEN [1] ELSE [] END | 
CREATE (p) <- [:ProductRelationT {T:t}] - (ppp)    
CREATE (ppp) - [:ProductRelationA {T:t, Eval:ee.Value}] -> (pp)  )
MERGE  (i:IndexedBy {N:iN, Dimension:"8",MaxN:iM,RowCounter:t})
MERGE  (i)-[:VertexIndexedBy]->(ppp)
MERGE (i) -[:IndexedByEvaluate]->(e)
return  count(ppp)

In conclusion, the 12/6 laboratory have a new workbook page QaurtetsRefactored.

It transforms resultproduct into a graph extention of relations of CollectProductArgNode's 
ad ArgumentsNode.  

The next laboratory reads this new pattern and feeds it into remaining quartets script comprehension.

 

MATCH (i:IndexedBy)-[]->(e:Evaluate),(i:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode) where i.N='5' AND i.MaxN='6' AND i.Dimension="4"
WITH i,e,p,i.N as iN, i.MaxN as iM
MATCH (v:VertexNode) <- [p1:ProductRelationT] - (p) 
WITH i,e,p,v,p1,iN,iM
OPTIONAL MATCH  (p) - [p2:ProductRelationA] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD
//WITH {Divisor:pD,afe:toInteger(p2.Eval),tft:toInteger(p1.T),DS: COLLECT( {  TDegree:CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END,
//                                      TScalar:CASE WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END,
//                                      ATwoSeq:toInteger(p2.T),
//                                      ADegree:toInteger(vv.Degree),   
//                                      AScalar:CASE WHEN toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END })    }  AS argumentProduct,iN//,iM,e
Merge (cl:CollectedProductArgNode {Dimension:'4',MaxN:'6',N:5,Divisor:pD,afe:CASE WHEN p2.Eval IS null THEN 0 ELSE  toInteger(p2.Eval) END,tft:toInteger(p1.T)})
CREATE (cl)-[:Arguments]->(aN:ArgumentsNode {  TDegree:CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END,
                                                TScalar:CASE WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END,
                                                ATwoSeq:toInteger(p2.T),
                                                ADegree:toInteger(vv.Degree),   
                                                AScalar:CASE WHEN toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END })

//Return pD, toInteger(p2.Eval) AS afe, toInteger(p1.T) AS tft,CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END as TDegree,CASE
//WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END as TScalar ,toInteger(p2.T) AS ATwoSeq,toInteger(vv.Degree) AS ADegree,CASE WHEN //toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END as AScalar




MATCH (i:IndexedBy)-[]->(e:Evaluate),(i:IndexedBy)-[:VertexIndexedBy]->(p:ProductArgsNode) where i.N='4' AND i.MaxN='100' AND i.Dimension='4'
WITH i,e,p,i.N as iN, i.MaxN as iM
MATCH (v:VertexNode) <- [p1:ProductRelationT] - (p) 
WITH i,e,p,v,p1,iN,iM
OPTIONAL MATCH  (p) - [p2:ProductRelationA] -> (vv:VertexNode)
WITH i,e,p,v,p1,p2,vv,iN,iM,p.Divisor as pD
WITH {Divisor:pD,afe:toInteger(p2.Eval),tft:toInteger(p1.T),DS: COLLECT( {  TDegree:CASE WHEN toInteger(v.Degree)=-1 THEN toInteger(v.Degree)+1 ELSE toInteger(v.Degree) END,
                                      TScalar:CASE WHEN toInteger(v.Degree)=-1 THEN toFloat(v.Scalar)*2 ELSE toFloat(v.Scalar) END,
                                      ATwoSeq:toInteger(p2.T),
                                      ADegree:toInteger(vv.Degree),   
                                      AScalar:CASE WHEN toInteger(vv.Degree)=-1 THEN toFloat(vv.Scalar)*2 ELSE toFloat(vv.Scalar) END })    }  AS argumentProduct,iN,iM,e

WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.tft as aPafe,iN,iM,argumentProduct.Divisor as apD
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe,iN,iM,apD
UNWIND aPTds as aPTdsU
WITH CASE WHEN aPTdsU.AScalar IS null THEN                                   //  important when collecting different dimensions.                                                          
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toInteger(aPafe)), 
      ResultDegree:aPTdsU.TDegree,
      ResultTwoSeq:aPTdsU.tft}),ET:aPafe,Divisor:apD}
ELSE
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toFloat(aPTdsU.AScalar)*aPTdsU.ATwoSeq), 
      ResultDegree: CASE WHEN aPTdsU.ADegree=-1 THEN aPTdsU.TDegree ELSE aPTdsU.ADegree+aPTdsU.TDegree END,
      ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe,Divisor:apD}
END
AS resultProduct,iN,iM
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT,iN,iM,resultProduct.Divisor as rpD1
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT,iN,iM,rpD1
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT,Divisor:rpD1} as resultMap,iN,iM

WITH COLLECT(resultMap) as resultMapC,resultMap.ET as eTrm,resultMap.RDegree as rDRM,iN,iM,resultMap.Divisor as rpD2
UNWIND RANGE(0,SIZE(resultMapC)-1) as iII
WITH resultMapC[iII].RScalarList as rSL,eTrm,rDRM,iN,iM,rpD2
UNWIND RANGE(0,SIZE(rSL)-1) as iIII
UNWIND rSL[iIII] as rSLI
WITH COLLECT(rSLI.RScalar) as cts,eTrm,rDRM,iN,iM,rpD2
WITH REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,eTrm,rDRM,iN,iM,rpD2
WITH TotalRScalar/rpD2 as TotalRScalaR,eTrm,rDRM,iN,iM
Return TotalRScalaR,toInteger(iM) as VariableX,toInteger(rDRM) as PDegree




MATCH (cl:CollectedProductArgNode {Dimension:'4',MaxN:'6',N:5})-[:Arguments]->(aN:ArgumentsNode)
WITH {Divisor:cl.Divisor,afe:cl.afe,tft:cl.tft,DS: COLLECT( {  TDegree:aN.TDegree,
                                      TScalar:aN.TScalar,
                                      ATwoSeq:aN.ATwoSeq,
                                      ADegree:aN.ADegree,   
                                      AScalar:aN.AScalar})}  AS argumentProduct,cl.N as iN,cl.MaxN as iM
WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.tft as aPafe,iN,iM,argumentProduct.Divisor as apD
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe,iN,iM,apD
UNWIND aPTds as aPTdsU
WITH CASE WHEN aPTdsU.AScalar = 0 THEN                                   //  important when collecting different dimensions.                                                          
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toInteger(aPafe)), 
      ResultDegree:aPTdsU.TDegree,
      ResultTwoSeq:aPTdsU.tft}),ET:aPafe,Divisor:apD}
ELSE
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toFloat(aPTdsU.AScalar)*aPTdsU.ATwoSeq), 
      ResultDegree: CASE WHEN aPTdsU.ADegree=-1 THEN aPTdsU.TDegree ELSE aPTdsU.ADegree+aPTdsU.TDegree END,
      ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe,Divisor:apD}
END
AS resultProduct,iN,iM
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT,iN,iM,resultProduct.Divisor as rpD1
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT,iN,iM,rpD1
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT,Divisor:rpD1} as resultMap,iN,iM

WITH COLLECT(resultMap) as resultMapC,resultMap.ET as eTrm,resultMap.RDegree as rDRM,iN,iM,resultMap.Divisor as rpD2
UNWIND RANGE(0,SIZE(resultMapC)-1) as iII
WITH resultMapC[iII].RScalarList as rSL,eTrm,rDRM,iN,iM,rpD2
UNWIND RANGE(0,SIZE(rSL)-1) as iIII
UNWIND rSL[iIII] as rSLI
WITH COLLECT(rSLI.RScalar) as cts,eTrm,rDRM,iN,iM,rpD2
WITH REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,eTrm,rDRM,iN,iM,rpD2
WITH TotalRScalar/rpD2 as TotalRScalaR,eTrm,rDRM,iN,iM
Return TotalRScalaR,toInteger(iM) as VariableX,toInteger(rDRM) as PDegree



12/9

QuadraticCypherBrokenApart

All the transfroms are represented in respective parargraphs.


QuartetsRefactored

The latest attempt at correct even-dimensional representations in paragraphs.
It falls short because of unexplained null projection.

Time to restrict script to suspect aPafe values.


crazey problem argumentProdcut.tft is also apafe 
but argumentProduct.afe should be apafe but is now aPclafe.....

and mabybe can fix problem.  Answer is a work around.
unable to get null test as origonal cypher to work for resultProduct.  sleuting is over.

now must detach deleate and repopulate nMax 6 
TODO:  Must use a form for refactored graph extensions.

Otherwise,  nMax 6 series works as quartets.

Time to join the points for D=8 , nMax=6 sereis.
DimensionalArithmetic CreateDimensions 6,5,8 is connected on graphdb.

   
So,  

  Have two patterns for higher dimensions:

  The CreateDimensions pattern,
  And the QuartetsRefactored pattern

And so....  a Narration...

Given (NMax,N,Dimension), the QuartetsRefactord merge script Matches the IndexedBy node.
Each node is expanded downTo the ProductArgsNode wich is Optionaly expaned to VertexNode's.

Rows of argumentProduct are cast as nodes and patterned to "CollectedProductArgNode"  

Note:  This pattern is no longer part of oringonal pattern.  // a cartesian product.

The good is DimensionalArithmetiCreateDimension's ProductArgsNode's are now
Their own homogenious arbitrary lengh Match path=... and subject to nodes(path),relationships(path) comprehenson.

So...  Back to July attempt with rub this time.  Not to collect vertices... they already are.
Need to collect the divisors and such.

Back to the narration:

With Target scalar in (NMax,N,Dimension,rowCounter) want it realated for collection with every Argument scalar in f(NMax,N)=Rowcounter. 

Meaning, for every rowCounter substitution must also divide out by integer rowCounter.

The attempt is:

MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*0..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="4" //AND i.RowCounter="8" 
With  RELATIONSHIPS(path) as nPath
RETURN SIZE(nPath)

╒═════════════╕
│"SIZE(nPath)"│
╞═════════════╡
│2            │
├─────────────┤
│2            │
├─────────────┤
│2            │

MATCH    path= (i:IndexedBy)-[]-> (pp:ProductArgsNode)-[*0..2]->(p:ProductArgsNode) - [pAT] -> (v:VertexNode)
WHERE i.N='5' AND i.MaxN='6' AND i.Dimension="4" //AND i.RowCounter="8" 
With  nodes(path) as nPath
RETURN SIZE(nPath)

╒═════════════╕
│"SIZE(nPath)"│
╞═════════════╡
│3            │
├─────────────┤
│3            │
├─────────────┤
│3            │
├─────────────┤


The QuartetsRefactored compute script 

12/10 

  QuartetsRefactored  is the current quadratic transform.
  There seems to be a bit more to the problem.
    
  Perhaps one of the transfroms further in the scrip is to be graphed.
  Need the result at end of script coallesed and then appended to graph.

12/11

╒══════════╤═════════╤═══════════╕
│"TRScalar"│"pTermsD"│"pTermsDiv"│
╞══════════╪═════════╪═══════════╡
│-120.0    │3        │4          │
├──────────┼─────────┼───────────┤
│4.0       │2        │2          │
├──────────┼─────────┼───────────┤
│4120.0    │0        │4          │
├──────────┼─────────┼───────────┤
│914.0     │2        │4          │
├──────────┼─────────┼───────────┤
│-22.0     │1        │2          │
├──────────┼─────────┼───────────┤
│6.0       │4        │4          │
├──────────┼─────────┼───────────┤
│-3144.0   │1        │4          │
├──────────┼─────────┼───────────┤
│44.0      │0        │2          │
└──────────┴─────────┴───────────┘


is to be the graph of 6,5.   the next dimension needs complete 6,5.4.3.2 for computation.


12/12


The QuadraticCypherBrokenApart script's scalars are collected by Degree,divisor (The above output). 
The return rows are to become new graph nodes and relations.
Below is the script of yesterday applied to QuartetsRefactored.
 
╒══════════╤═════════╤═══════════╕
│"TRScalar"│"pTermsD"│"pTermsDiv"│
╞══════════╪═════════╪═══════════╡
│-120.0    │3        │4          │
├──────────┼─────────┼───────────┤
│4.0       │2        │2          │
├──────────┼─────────┼───────────┤
│4120.0    │0        │4          │
├──────────┼─────────┼───────────┤
│914.0     │2        │4          │
├──────────┼─────────┼───────────┤
│-22.0     │1        │2          │
├──────────┼─────────┼───────────┤
│6.0       │4        │4          │
├──────────┼─────────┼───────────┤
│-3144.0   │1        │4          │
├──────────┼─────────┼───────────┤
│44.0      │0        │2          │
└──────────┴─────────┴───────────┘


So,  the Return rows in QuartetsRefactored are correct.
These rows need graphing.  



Need to write, it appears in the style of the 2d CreateMoreDimensions script, at the rSLI script object, the next dimension of nodes.

Note:  Traditionally, this requires .csv, but for the sake of whooopeee....  

MERGE (i:IndexedBy {N:line.NN,RowCounter:line.flatFileRowCounterr,MaxN:line.nMaxx} )
MERGE (t:TwoSeqFactor {twoSeq:line.tSeqDB} )
MERGE (v:VertexNode {Vertex:line.vertexDBVertex,Scalar:line.vertexScalarDB,Degree:line.vertexDegreeDB} )
MERGE (e:Evaluate {Value:line.targetEvaluate})
MERGE  (i)-[ee:TwoFactor]->(t)
MERGE (i) -[:IndexedByEvaluate]->(e)
MERGE  (i)-[ee:VertexIndexedBy]->(v)

need a vertex populated with 

vertex.Scalar=rSLI.RScalar
vertex.Degree=rDRM

IndexedBy.Dimension=   maybe 8 not sure yet
IndexedBy.Rowcounter=
IndexedBy.MaxN=
IndexedBy.N=



QuartetsRefactord has two Scripts. 
The first reads the CreateMoreDimensions Dimension=2 script graph and writes a collectedNodes section of graphDB.
The second consumes the collectedNodes script and and outputs graph nodes similar to the origonal load from .csv or results.

Note: the origonal CreateMoreDimensions script sets p.Divisor to 2 or 4 ... is now set to pTermsDiv


The process is repeated. for each nextEvenDimension.

DimensionalArithmetic CreateMoreDimensions 


Upto point where current script in quartets refactors has to merge nodes with dimension attribute.  A conflict
appears with the scrips starting with the CreatMoreDimensions script functionality.



RefactoredQuartets join next dimansion (octets) (The first step in three for octets)  needs to account for divisors recorded
in the third of three nextNimension comprehension scripts.

FOREACH(snoreMe IN CASE  WHEN vv.Vertex IS null  THEN [1] ELSE [] END | 
                                                                    CREATE (v) <- [:ProductRelationT {T:t.twoSeq}] - (p) )
FOREACH(snoreMe IN CASE  WHEN vv.Vertex IS not null  THEN [1] ELSE [] END | 
CREATE (v) <- [:ProductRelationT {T:t.twoSeq}] - (p) 
                                                                    CREATE (p) - [:ProductRelationA {T:tt.twoSeq, Eval:ee.Value}] -> (vv)  )

// for starters  perform arithmetic in these create clauses.


And now it looks like there are three scripts for a dimension comprehension.



me thinkith many productarg nodes floating around zaddb.


MATCH (cl:CollectedProductArgNode {Dimension:'8',MaxN:'6',N:'5'})-[:Arguments]->(aN:ArgumentsNode)
WITH {Divisor:cl.Divisor,afe:cl.afe,tft:cl.tft,DS: COLLECT( {  TDegree:aN.TDegree,
                                      TScalar:aN.TScalar,
                                      ATwoSeq:aN.ATwoSeq,
                                      ADegree:aN.ADegree,   
                                      AScalar:aN.AScalar})}  AS argumentProduct,cl.N as iN,cl.MaxN as iM
WITH COLLECT(argumentProduct) as argumentProductt,argumentProduct.tft as aPafe,iN,iM,argumentProduct.Divisor as apD,argumentProduct.afe AS aPclafe
UNWIND RANGE(0,SIZE(argumentProductt)-1) as iii
WITH argumentProductt[iii].DS as aPTds,aPafe,iN,iM,apD,aPclafe
UNWIND aPTds as aPTdsU
WITH CASE WHEN aPclafe = 99 THEN                                   //  important when collecting different dimensions.                                                          
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toInteger(aPafe)), 
      ResultDegree:aPTdsU.TDegree,
      ResultTwoSeq:aPTdsU.tft}),ET:aPafe,Divisor:apD}
ELSE
{DS:COLLECT({ResultScalar:(toFloat(aPTdsU.TScalar)*toFloat(aPTdsU.AScalar)*aPTdsU.ATwoSeq), 
      ResultDegree: CASE WHEN aPTdsU.ADegree=-1 THEN aPTdsU.TDegree ELSE aPTdsU.ADegree+aPTdsU.TDegree END,
      ResultTwoSeq:aPTdsU.ATwoSeq}),ET:aPafe,Divisor:apD}
END
AS resultProduct,iN,iM
WITH COLLECT(resultProduct) as rPC,resultProduct.ET as eT,iN,iM,resultProduct.Divisor as rpD1
UNWIND RANGE(0,SIZE(rPC)-1) as iI
WITH rPC[iI].DS as rPCDS,eT,iN,iM,rpD1
UNWIND rPCDS as rPCDSU
WITH {RScalarList:COLLECT({RScalar:rPCDSU.ResultScalar}),RDegree:rPCDSU.ResultDegree,ET:eT,Divisor:rpD1} as resultMap,iN,iM

WITH COLLECT(resultMap) as resultMapC,resultMap.ET as eTrm,resultMap.RDegree as rDRM,iN,iM,resultMap.Divisor as rpD2
UNWIND RANGE(0,SIZE(resultMapC)-1) as iII
WITH resultMapC[iII].RScalarList as rSL,eTrm,rDRM,iN,iM,rpD2
UNWIND RANGE(0,SIZE(rSL)-1) as iIII
UNWIND rSL[iIII] as rSLI

//MERGE (i:IndexedBy {N:iN,RowCounter:eTrm,MaxN:iM,Dimension:"8"} )
//MERGE (t:TwoSeqFactor {twoSeq:rpD2} )
//MERGE (v:VertexNode {Scalar:rSLI.RScalar,Degree:rDRM} )
//MERGE (e:Evaluate {Value:2^toInteger(iN)})                //   Must compute evaluate   or just say it is computing 2^n
//MERGE  (i)-[ee:TwoFactor]->(t)
//MERGE (i) -[:IndexedByEvaluate]->(e)
//MERGE  (i)-[eee:VertexIndexedBy]->(v)

//RETURN rSLI.RScalar,eTrm,rDRM,iN,iM,rpD2

WITH COLLECT(rSLI.RScalar) as cts,eTrm,rDRM,iN,iM,rpD2
WITH REDUCE(tSum=0,ff IN cts | tSum +ff) As TotalRScalar,eTrm,rDRM,iN,iM,rpD2
With {Degree:rDRM,Divisor:rpD2,Scalar:Collect(TotalRScalar)} AS pTerms
WITH pTerms.Scalar as pTermsS,pTerms.Degree as pTermsD,pTerms.Divisor as pTermsDiv
With REDUCE(tSum=0,ff IN pTermsS | tSum +ff) As TRScalar,pTermsD,pTermsDiv
RETURN TRScalar,pTermsD,pTermsDiv








