5/3

These java commands populate the typical TwoPolynomials 
to the arbitrary degreed p as argumented. 

CREATE INDEX ON :IndexedBy(N,MaxN)
CREATE INDEX ON :Evaluate(Value)
CREATE INDEX ON :TwoSeqFactor(twoSeq)
CREATE INDEX ON :CollectedProductArgNode(MaxN,N)
CREATE INDEX ON :IndexedByArgument(N,MaxN)

java -jar TwoPolynomialGenerator.jar test.csv 8 2 9       67         
java -jar TwoPolynomialGenerator.jar test.csv 16 2 17     2939        
java -jar TwoPolynomialGenerator.jar test.csv 32 2 33     25216             
java -jar TwoPolynomialGenerator.jar test.csv 64 2 65     47492            

java -jar TwoPolynomialGenerator.jar test.csv 10 2 11                     
java -jar TwoPolynomialGenerator.jar test.csv 100 2 101           
java -jar TwoPolynomialGenerator.jar test.csv 1000 2 101           
java -jar TwoPolynomialGenerator.jar test.csv 10000 2 101  72126   

chdir JavaProjects\ZADScriptsK\ZADScripts\dist

java -jar ZADScripts.jar 2 8 8 2       818               //  not gracefull exit...                                                
java -jar ZADScripts.jar 2 8 8 8       1226              //  maybe something to do with upper bound.
java -jar ZADScripts.jar 2 8 8 16      1838              //       
java -jar ZADScripts.jar 2 8 8 32      2766              //

java -jar ZADScripts.jar 2 13 16 2     8279       
java -jar ZADScripts.jar 2 13 16 8     10319   
java -jar ZADScripts.jar 2 13 16 16    14579                    
java -jar ZADScripts.jar 2 13 16 32    24611

java -jar ZADScripts.jar 2 13 32 2     30556        
java -jar ZADScripts.jar 2 13 32 8     32596     
java -jar 

2 13 32 16    36856                 
java -jar ZADScripts.jar 2 13 32 32    46888 

java -jar ZADScripts.jar 2 13 64 2     51973             
java -jar ZADScripts.jar 2 13 64 8     56505        
java -jar ZADScripts.jar 2 13 64 16    60765                   
java -jar ZADScripts.jar 2 13 64 32    70797 

chdir JavaProjects\TwoPolynomialGeneratorK\dist
java -jar TwoPolynomialGenerator.jar test.csv 10000 2 17  105009

java -jar ZADScripts.jar 2 10 10000 2    78499 
java -jar ZADScripts.jar 2 10 10000 8    79561  
java -jar ZADScripts.jar 2 10 10000 16   81547                        
java -jar ZADScripts.jar 2 10 10000 32   85585  


Load the GraphicZero data on MLGraph.

The scope of a complete ZerosAndDifferences graph must exist as GraphicZero note:

.The complete set of fractions for seed p evaluate exists?
.The power set is complete?  
.Can p map to itself?


on or after 5/26.

5/4

Have the GraphicZero twoPolynomials dfScripted and on new database mlDB1.
Have ZAD wired to skip or not to skip.


The toDo:

https://neo4j.com/developer/manage-multiple-databases/

https://neo4j.com/docs/operations-manual/current/manage-databases/

https://neo4j.com/docs/cypher-manual/4.2/clauses/use/


USE myDatabase
MATCH (n) RETURN n

:use system
:dbs

CREATE DATABASE command

5/5

individual database for 
.twoPoly                              need a gausstable1 skip pattern like method returning a zad seed p.
.zad_i                                each zad_i has owne named db
.fractionintegerdriver iterate.       the skip pattern for a seed dimenension.


https://soundcloud.com/platz-fur-tanz/guestmix-65-alex-glass?fbclid=IwAR337WtkPl4qiAXWqtck7bXkcrh4p0vuW1aoTtix9eKJqt1-MfbG0dCFtCw

https://www.youtube.com/watch?v=xG6GEb4D4Cw&feature=share

5/6

message passing

relational class
iterative class
belief propagation

assumption of homophiliy

classification label of a node v in network may depend on
.features of v
.labels of the nodes in v's neighborhood
.features of the nodes in v's neighborhood.

the adjacency matrix over n nodes.

conditional probability

collective classification involves 3 steps
local classifier         does not use network information.  predicts lable based on node attributes/features.standard classification task
.assign initial labels
relational classifier capture correlations .  learns a classifier to label one node based on the labels and/or attributes of its neighbors.  network informamtion is used. 
.capture correlations between nodes
collective inference  propagate the correlation.  apply relational classifier to each node iteratively.  iterate until he inconsistency between neighboring labels is minimixed.
.propagte correlations through network

https://www.youtube.com/watch?v=QUO-HQ44EDc

relational classifiers

yea old iterate over nodes with conditional probability function untill convergance
label no features.  local connections concidered.

iterative classification


two classifiers.

phi1 predict node label based on node feature vector
phi2 predict label based on node feature vector fv and summary zv of labels of v's neighbors.

step one classify based on node attributes alone. train classifier linear classifier
neueral networks,...

collective classification:  Belief Propagation

loopy belief propagation

dynamic programming approacch to answering probability queries in a graph.
probalbility of node v belonging to class 1

https://www.youtube.com/results?search_query=graph+lable+prediction

modularity algorithms.  Modularity is a measure of the structure of networks or graphs which measures the strength of division of a network into modules (also called groups, clusters or communities). ... Modularity is often used
in optimization methods for detecting community structure in networks.

https://www.youtube.com/watch?v=r0Ogt-q956I

remember overfitting/underfitting in the poly / scatter plot sense.

want the least highest dimension giving tollerance.

regulaization.


does mlgraph have current .conf?  

mlGraph

C:\Users\Aibes\.Neo4jDesktop\relate-data\dbmss\dbms-38e2b0f7-730e-4df9-a439-989a61af03da\conf
does now include streams topics.


The priority is ZAD.jar.

.pSeed                   - read from tenant graph
.pArrayInitial           - read from tenant graph
.setProductRange         - ....

so ZAD.jar maybe has no args[].  It is to, though, query tenant graph for individual runs.


https://learnopencv.com/autoencoder-in-tensorflow-2-beginners-guide/?fbclid=IwAR05VJORWIFUamj5tAYPSv23dOYEmXPPmo9oSbAwV8faBfkPDYs5CVMclzk


5/7

The tenant graphs representing args[]:

N=2,MaxN=8,D=8            D=8 are the quartets.

pArray_0                 //  Each pArray arguments a subgraph of complete graph.  
pArray_1                 //  The setProduct range should be included in tenant graph iteration node.
...                      //  It is updated in each node depending on the subscript.
pArray_4                 //  As mentiond below, the set is defined for each member of skip pattern. 
     
N=3,MaxN=8,D=8            Note N=2,3 are quads.
N=4,MaxN=8,D=8
N=5,MaxN=8,D=8

N=2,MaxN=8,D=16            D=8 are the octets.
N=3,MaxN=8,D=16            Note N=2,3 are quads.
N=4,MaxN=8,D=16
N=5,MaxN=8,D=16

N=2,MaxN=10000,D=8         D=8 are the quartets.
N=3,MaxN=10000,D=8         Note N=2,3 are quads.
N=4,MaxN=10000,D=8
N=5,MaxN=10000,D=8

N=2,MaxN=10000,D=16        D=8 are the octets.
N=3,MaxN=10000,D=16        Note N=2,3 are quads.
N=4,MaxN=10000,D=16
N=5,MaxN=10000,D=16

Each need their respective skip patterns   
The two sets are "ZAD args[]" retrieved in muQuerry style method.

Want ZAD graph summary. 

Is root power set complete?
Is mu root set complete?
What percentage of the power set is determined/under determined?

Do need each 4,8 skip pattern (power set) on respective tenant graphs. 


5/9

Project 2

MLGraph:    

MLGraph1:   The ZDCT p's


LoopsDriverTwoPManager has int fIDI

if -1 then noBufferRun with muListBoolean(all false) 
if 0 then muQuerry  and if not empty noBufferRun with muListBoolen(skip list)

Note: LoopsDriverTwoPManager does one muQuerry take and falls through.

The ZAD jar accepts args[] composed of a TwoPolyNomial coordinate N,MaxN,D or null.

 


5/10

https://towardsdatascience.com/what-really-is-a-matrix-determinant-89c09884164c

https://en.wikipedia.org/wiki/Lagrangian_mechanics

https://www.cantorsparadise.com/bayes-unbound-f0b464683e7c

https://www.cantorsparadise.com/the-goldbach-conjecture-5ffafb9cee8e

https://en.wikipedia.org/wiki/Geometric_progression   -if ratio of cosecutive terms is constant.

strategy into tactics.

Louvain algorithm, which is used for community detection


the moving average.
prediction vs descriptive

https://towardsdatascience.com/presenting-multiple-node-label-support-and-graph-mutability-features-of-the-neo4j-graph-data-a0b0ea744884


Summary of yesterday:

DifferencesOfPolynomials.ods pattern observation:

Maybe a hypo (another off-hand hypothesis in need of proof) about the number of
consecutive zeros at w0 (p itself). if w1 at index has zero then trivial for w0
to have zero at index.  If w1, w2 at index has zero then trivial for w0 to have two
consecutive zeros starting at index.
....
This speaks of an algorithm for writing an arbitrary number of consecutive zeros starting
at an arbitrary index of w0.  

Suppose want algorithem (p transform instructions) for writing an arbitrary pattern of
zeros at w0 (want a pattern in set of mu as resulting p). 

ZAD irratta:

Did populate The Project 2 FractionIntegerDriverIterate folder's default neo4j graph 
with mu numbers with denominators from 1 to 25. Note 1 to 50 is an imense number of mu's.  
The intention was feasability of populating a ZAD graph by argumenting LoopsDriverTwoP
with individual MuNumber.nBinary list for a single iteration of LoopsDriverTwoP.call()'s
semaphore pattern.  The feature request appears feasable and will probably exit gracefully.
However, the graph ZAD would populate increases geometricly in size and even a D=8 p
is a graph of 8^8 nodes...   Many, Many nodes.

Today work is graph tenancy.

The GraphicZero p's need ZAD representation.  Yesterday's effort suggests the infeasability
of brute forcing ZAD with an eight dimensional GraphicZero P.  Dimension 4 P's though, are
ZAD iterable without the ZAD irratta feature.  Can make due though with GraphicZero P's
of dimension 2, 4 in tenancy. 

Need a muQuerry like method for retrieving GraphicZero P's from a dedicated tenant graph. 
Apriori, need the tenant graph created and populated.  Note this graph, like the muNumbers
graph, is composed of unconnected nodes.


Project2 FractionIntegerDriverIterate should be reanamed.
         MLGraph1 (the twoPolynomials) should be a tenant graph in renamed FIDI.

But first:

https://neo4j.com/developer/multi-tenancy-worked-example/
https://neo4j.com/docs/operations-manual/current/fabric/introduction/

the good stuff:

https://neo4j.com/docs/operations-manual/current/fabric/queries/

to fabric or to use....

seems:
.fabric is for different Projects, folders, and graphs.
."use" is for the graphs in a Project folder.
.Multiple "use" in a query implies call {} sub queries.
.The ZAD use case maybe "use" in first querry clause.

5/11

Inportant reminder:  need property for train/test partioning.  Probably need the pArray parcer.

Need project name.
     db name. 
     tenant graphs names.

jars:
.FractionIntegerDriverIterate
.TwoPolynomialGenerator
.DFScripts
.ZAD

Project Name: NewtonDifferenceGraph
DB name: Graphs

Tenant graphs: 
.differenceGraph
.integerpolys
.skipmu
.createbymu

:use system

CREATE DATABASE differenceGraph
CREATE DATABASE integerpolys
CREATE DATABASE skipmu
CREATE DATABASE createbymu

SHOW DATABASES

CREATE INDEX ON :IndexedBy(N,MaxN)
CREATE INDEX ON :Evaluate(Value)
CREATE INDEX ON :TwoSeqFactor(twoSeq)
CREATE INDEX ON :CollectedProductArgNode(MaxN,N)
CREATE INDEX ON :IndexedByArgument(N,MaxN)

CREATE INDEX ON :CreatedBy(resultId)
CREATE INDEX ON :Dnode(vmResult)

chdir JavaProjects\TwoPolynomialGeneratorK\dist

java -jar TwoPolynomialGenerator.jar test.csv 8 2 9                
java -jar TwoPolynomialGenerator.jar test.csv 16 2 17             
java -jar TwoPolynomialGenerator.jar test.csv 32 2 33                  
java -jar TwoPolynomialGenerator.jar test.csv 64 2 65                 

java -jar TwoPolynomialGenerator.jar test.csv 10 2 11                     
java -jar TwoPolynomialGenerator.jar test.csv 100 2 101           
java -jar TwoPolynomialGenerator.jar test.csv 1000 2 101           
java -jar TwoPolynomialGenerator.jar test.csv 10000 2 101     

chdir JavaProjects\ZADScriptsK\ZADScripts\dist

java -jar ZADScripts.jar 2 8 8 2       818               //  not gracefull exit...                                                
java -jar ZADScripts.jar 2 8 8 8       1226              //  maybe something to do with upper bound.
java -jar ZADScripts.jar 2 8 8 16      1838              //       
java -jar ZADScripts.jar 2 8 8 32      2766              //

java -jar ZADScripts.jar 2 13 16 2     8279       
java -jar ZADScripts.jar 2 13 16 8     10319   
java -jar ZADScripts.jar 2 13 16 16    14579                    
java -jar ZADScripts.jar 2 13 16 32    24611

java -jar ZADScripts.jar 2 13 32 2     30556        
java -jar ZADScripts.jar 2 13 32 8     32596     
java -jar 

2 13 32 16    36856                 
java -jar ZADScripts.jar 2 13 32 32    46888 

java -jar ZADScripts.jar 2 13 64 2     51973             
java -jar ZADScripts.jar 2 13 64 8     56505        
java -jar ZADScripts.jar 2 13 64 16    60765                   
java -jar ZADScripts.jar 2 13 64 32    70797 

chdir JavaProjects\TwoPolynomialGeneratorK\dist
java -jar TwoPolynomialGenerator.jar test.csv 10000 2 17  105009

java -jar ZADScripts.jar 2 10 10000 2    78499 
java -jar ZADScripts.jar 2 10 10000 8    79561  
java -jar ZADScripts.jar 2 10 10000 16   81547                        
java -jar ZADScripts.jar 2 10 10000 32   85585 

https://stackoverflow.com/questions/67493235/neo4j-streams-fabric-integration-not-working-log-reports-the-use-graph-clau

5/12  

DO NEED:

"Determined/UnderDetermined" property.

Have:

Worker   Is Determined 

0         5
1         4
2         3
3         2
4         1
5         0


Worker   Is Determined 

0         5
1         4
2         3
3         2
4         1
5         0

MATCH (d:Dnode), (k:CreatedBy)

MERGE  (d)-[ee:CreatedBye]->(k)

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum=5)
WITH  CASE WHEN k.wNum=0 THEN CASE WHEN d.totalZero=5 THEN 1 ELSE 0 END ELSE 2 END as determined
RETURN d.totalZero,k.wNum,determined limit 1000

d.totalZero
k.wNum

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy)
WITH  CASE WHEN k.wNum=0 THEN CASE WHEN d.totalZero=5 THEN 1 ELSE 0 END ELSE
      CASE WHEN k.wNum=1 THEN CASE WHEN d.totalZero=4 THEN 1 ELSE 0 END END AS determined,d,k
RETURN d.totalZero,k.wNum,determined limit 100

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy)
WITH  CASE WHEN k.wNum=0 THEN CASE WHEN d.totalZero=5 THEN 1 ELSE 0 END ELSE
      CASE WHEN k.wNum=1 THEN CASE WHEN d.totalZero=4 THEN 1 ELSE 0 END ELSE
      CASE WHEN k.wNUM=2 THEN CASE WHEN d.totalZero=3 THEN 1 ELSE 0 END ELSE 2 END as determined,d,k
RETURN d.totalZero,k.wNum,determined limit 100


The meaning is determined=1 is determined determined=0 is under determined.

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:0})
WITH  CASE WHEN k.wNum=0 THEN CASE WHEN d.totalZero=5 THEN 1 ELSE 0 END ELSE 2 END as determin,d,k
SET d.determined=determin
RETURN d.totalZero,k.wNum,determin

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:1})
WITH  CASE WHEN k.wNum=1 THEN CASE WHEN d.totalZero=4 THEN 1 ELSE 0 END ELSE 2 END as determin,d,k
SET d.determined=determin
RETURN d.totalZero,k.wNum,determin
 
MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:2})
WITH  CASE WHEN k.wNum=2 THEN CASE WHEN d.totalZero=3 THEN 1 ELSE 0 END ELSE 2 END as determin,d,k
SET d.determined=determin
RETURN d.totalZero,k.wNum,determin 

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:3})
WITH  CASE WHEN k.wNum=3 THEN CASE WHEN d.totalZero=2 THEN 1 ELSE 0 END ELSE 2 END as determin,d,k
SET d.determined=determin
RETURN d.totalZero,k.wNum,determin

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:4})
WITH  CASE WHEN k.wNum=4 THEN CASE WHEN d.totalZero=1 THEN 1 ELSE 0 END ELSE 2 END as determin,d,k
SET d.determined=determin
RETURN d.totalZero,k.wNum,determin

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:5})
WITH  CASE WHEN k.wNum=5 THEN CASE WHEN d.totalZero=0 THEN 1 ELSE 0 END ELSE 2 END as determin,d,k
SET d.determined=determin
RETURN d.totalZero,k.wNum,determin

Need wNum on dNode

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:0})
SET d.wNum=k.wNum
RETURN d.wNum

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:1})
SET d.wNum=k.wNum
RETURN d.wNum
 
MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:2})
SET d.wNum=k.wNum
RETURN d.wNum 

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:3})
SET d.wNum=k.wNum
RETURN d.wNum

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:4})
SET d.wNum=k.wNum
RETURN d.wNum

MATCH (d:Dnode)-[ee:CreatedBye]->(k:CreatedBy {wNum:5})
SET d.wNum=k.wNum
RETURN d.wNum

so,  dNode is 

CALL gds.graph.create('myGraph', {
    dNode: {properties: ['wNum','determined']
  },
  {
        zMap: {
        type: 'zMap',
        orientation: 'UNDIRECTED'    
        } 
)

call gds.graph.create(
    'myGraph',
    {
        DNode: {
        label: 'Dnode',
        properties: ['wNum','determined']
    }
    },{
        zMap: {
        type: 'zMap',
        orientation: 'UNDIRECTED'    
        }
    }
    )

CALL gds.alpha.ml.nodeClassification.train('myGraph', {
  nodeLabels: ['DNode'],
  modelName: 'nc-model',
  featureProperties: ['wNum'],
  targetProperty: 'determined',
  randomSeed: 2,
  holdoutFraction: 0.2,
  validationFolds: 5,
  metrics: [ 'F1_WEIGHTED' ],
  params: [
    {penalty: 0.0625},
    {penalty: 0.5},
    {penalty: 1.0},
    {penalty: 4.0}
  ]
}) YIELD modelInfo
RETURN
  modelInfo.bestParameters AS winningModel,
  modelInfo.metrics.F1_WEIGHTED.outerTrain AS trainGraphScore,
  modelInfo.metrics.F1_WEIGHTED.test AS testGraphScore

Node classification:

Has wNum, totalZero fields and predict determined.

CALL gds.alpha.ml.splitRelationships.mutate('myGraph', {
  relationshipTypes: ['zMap'],
  remainingRelationshipType: 'zMap_REMAINING',
  holdoutRelationshipType: 'zMap_TESTGRAPH',
  holdoutFraction: 0.2
}) YIELD relationshipsWritten

relationshipsWritten
14914

CALL gds.alpha.ml.splitRelationships.mutate('myGraph', {
  relationshipTypes: ['zMap_REMAINING'],
  remainingRelationshipType: 'zMap_IGNORED_FOR_TRAINING',
  holdoutRelationshipType: 'zMap_TRAINGRAPH',
  holdoutFraction: 0.2
}) YIELD relationshipsWritten


╒══════════════════════╕
│"relationshipsWritten"│
╞══════════════════════╡
│11932                 │
└──────────────────────┘

CALL gds.alpha.ml.linkPrediction.train('myGraph', {
  trainRelationshipType: 'zMap_TRAINGRAPH',
  testRelationshipType: 'zMap_TESTGRAPH',
  modelName: 'lp-determined-model',
  featureProperties: ['determined','wNum'],
  validationFolds: 5,
  classRatio: 1.33,
  randomSeed: 2,
  params: [
    {penalty: 0.5, maxIterations: 1000},
    {penalty: 1.0, maxIterations: 1000},
    {penalty: 0.0, maxIterations: 1000}
  ]
}) YIELD modelInfo
RETURN
  modelInfo.bestParameters AS winningModel,
  modelInfo.metrics.AUCPR.outerTrain AS trainGraphScore,
  modelInfo.metrics.AUCPR.test AS testGraphScore

╒════════════════════════════════════╤══════════════════╤══════════════════╕
│"winningModel"                      │"trainGraphScore" │"testGraphScore"  │
╞════════════════════════════════════╪══════════════════╪══════════════════╡
│{"maxIterations":1000,"penalty":1.0}│0.6225597915281794│0.6159130482395654│
└────────────────────────────────────┴──────────────────┴──────────────────┘

https://en.wikipedia.org/wiki/Ray_Kurzweil#The_Law_of_Accelerating_Returns

the graph is in a geometric space (progression)
with edges...


5/13

https://neo4j.com/docs/graph-data-science/current/algorithms/ml-models/node-classification/


Today, re-label some of the Dnodes as UnknownDnode.  It will maintain the wNum property.
                                                     Will want to predict the determined/undetermined variable.

Need to:

.Drop the in-memory graph.

https://www.universetoday.com/151040/in-1-3-million-years-a-star-will-come-within-24-light-days-of-the-sun/


5/14

structure can help only if labels/values of linked nodes are correlated.
homophily
hetrophily.

node classification  by label propagation.

interative relational classifier.

weighted vote relational neighbor classifier.
network only naive bayes classifier 
where....

transductive learing: learn a function that predicts labels y_u for the unlabeled
input x_u.


semi-supervized learning and random walks.

markov chains with absorbing states.

The random walk matrix

absorbing nodes are labeled nodes.

all labled nodes will be sinks.

node classification
Graph classification
link prediction.

https://www.youtube.com/watch?v=Iiv9R6BjxHM


4 fundamental graph problems  graph classification and regression, node classification, edge classification.

https://www.youtube.com/watch?v=Iiv9R6BjxHM

https://github.com/graphdeeplearning/benchmarking-gnns

models 

mlp
mlp gated 
gcn
graphSage
gin 
diffPool
gat
moNet
GatedGCN


Travelling Salesman problem  given 2 2dgraph find a tour with minimal length.  

deeplearning an combinatorial optimization.

https://www.youtube.com/channel/UCupQLyNchb9-2Z5lmUOIijw


5/15

a solver app max # zeros on differences.ods


5/17


convex subsets.

knowledge through thinking.

how to know something about the world is necessarly true.

1 pair of 2 shoes.  objectivity.  but need context...

analytic true is necessarly true. true by definition 

synthetic truth maybe true not necessarly true.

knowledge prior to experience - apriori.  vs apostori

do justice to objectivity ....  cantors math vs russell and freugee.

throw the cat amung the pigeons.


https://www.youtube.com/watch?v=H6oOhElB3yE


how does ai learn structure.

a graph shifted signal.

once the graph convolution is defined its off to the races.


do need to include the unknown nodes to complete mlgraph1.

pytorch geometric


https://www.quora.com/What-do-you-mean-by-introducing-non-linearity-in-a-neural-network

some majic... some non linearity.

the multi layer perceptron.

max pooling of vector node.


injetive graph pooling.
WL kernel


Gin, a new com-putational framework that is able to generate highly efficient computekernels

normalize adjacency matrix

do you think of graph embeddings instead of the adjacency matrix


image classification into graph classification.

5/18

Deep reinforcement learning   the q function expected total reward.  present/discount.  
policy maximizes q function.
policy gradients.


https://www.facebook.com/ComputerLunch


I understand this guy has a legitimate brain pathology but he had me dying at "I live on the 4th floor of a 3 floor walk up."

tangential speech or tangentiality is a communication disorder in which the train of thought wanders and demonstrates a lack of focus, and importantly, never returns to the initial topic of the conversation. 
Now, go read some Alfred Adler or Benjamin Rush for a refresher course in psychoanalysis & psychiatric therapy.


5/19

GraphQL is seeing increased adoption in the Blockchain and Cryptocurrency space. 
Due to the distributed nature of blockchains, querying on-chain data is a hard 
problem and it is being simplified using GraphQL. With Graph APIs, viewing data 
across different crypto exchanges, markets, assets, and on-chain data can all be 
done in a single query.

https://dzone.com/articles/graphql-revisited?edition=670391

https://www.youtube.com/watch?v=r0Ogt-q956I&t=8888s

do back propigation
do gradient decent.

filter has learnd to look for edges.

looking for feet, water, beaks....

the input tensor

https://dzone.com/articles/microservices-interview-questions-answers?edition=673400

https://www.quantamagazine.org/how-mathematicians-use-homology-to-make-sense-of-topology-20210511/

https://colab.research.google.com/github/stellargraph/stellargraph/blob/v1.2.0/demos/link-prediction/homogeneous-comparison-link-prediction.ipynb#scrollTo=l7HUjYEnC_av



5/20https://www.youtube.com/watch?v=LFSR27BaNIQ




5/20

rest api has several endpoints

https://docs.openzeppelin.com/contracts/2.x/

peer to peer protocal

ipfs

build smart contracts on etherium.

write a smart contract and deploy it to the blockchain.
if call a method on the contract... it is executing simutainously on thousands of nodes.

the ico craze..

all written on etherium blockchain.

tokenized economies
decentralized finance/digitized securities
real estate
identificatin/self sovereign identity
logistics supply chain transportation
improved enterprise efficiency
gaming
decentralized autonomous organizations.






ptp layer -node discovery, consencus... synching the state

operational -- querry ,  perform ...  where graphql is.

comming from json rpc   lighweigh rpc...  
json rpc    troubble overfetching/underfetcingng
            not typed 
            data and data relationships not well modeled.
            not good querying with.


blocks      top level point in time  data structure. 
transactions 
logs/events
accounts  identities in a blockchain also a contraction.  call a

fetch a block number, number of transactions...  json rpc vs graphql

writing to the blockchain produces logs  --- stored in another system.


https://www.youtube.com/watch?v=UPTgF3II2Vo
19:45

https://www.youtube.com/watch?v=coQ5dg8wM2o

https://www.youtube.com/watch?v=JPkgJwJHYSc

smart contracts:12 use cases for business & beyond   chamber of digital commerce

state of the dapps:  5 observations from usage data  mccann

ethereum competitors:  guide to alternative smart contract platforms blockonomi

smart contracts:  building blocks for digital markets   szabo
a next generation smart contract and decentralized application platform   ethereum
blockchain technology as a regulatory technology  de filippi & hassan


smart contacts  

set of promisces in digital form
includes protocal.  sop's includes math.
smart contracts may not be smart  - mechanized mayby not ai.

proof of work
proof of state

no transacton script    -  state transitions

two ledgers permissions and public
            balance ledger/transacton ledger


bitcoin transaction ledger.

etherim is turing complete  (write loops)  not so bitcoin scripting.
-  account based.



merckle keys..   at least 4 trees  


consensul:  proof of work

hash function sha 256  ethash
cannt use asic   

sufficiently decentralized /  not a security.


opinion - democratize capitol markets.


dapps have a native token and run as a smart contract on top of a platform.



what goes into the valuation of something that is not functionalble?

inital coin offerings
crowdfunding for investment and consumption
.proceeds used to build networks
.tokens usually issued prior to being functional
developemnt while open source is largely centralized
promoters allocate themselves fpremined tokens
tokens are fungible and transferable
scarcity is fostered with preset monetary policy
purchasers anticipate profits through appreciation


impulse  -  speculation....


some contract law....

promise of performance given in exchange for promise or performance.


the legal system has an interest in the contract.

digital rights management.


eliminate risk  vs allocate risk


https://www.theregister.com/2021/05/20/graph_databases_to_map_ai/


indexing and quering protocal.


https://www.youtube.com/watch?v=5vfZRuNMgfE


blockchain smart contracts

https://www.youtube.com/watch?v=E_0tSNHWwWA

5/21

a specification built around http://


express server.

npm i express 

https://www.youtube.com/watch?v=ZQL7tL2S0oQ  @31 minutes 

and my buffer class inside driver class has the answer:
need a function type...  not in java pardyne.

post put delete  --  use mutation objects.

apps and appliances... - style guide.

json most popular data format.
though asynch...  avro, protobuf.

http 2  soap old
whats app. xmpp.


kafka protocal is based on tcp

websocket api...   http call with upgrade headers.  thus full duplex with single tcp connection
browser support for websocket client
interface with asyncAPISpec

Blockchain.com  https://www.blockchain.com/api/api_websocket

graphql subscriptions   websockets - apollo

subscription os a read only push stream 

graphql schema definition language (sdl)

graphql subscription and live query samples
reactive queries at facebook ...

learn graphql spec.

if full stack if frontend...  

front end query what you want... if don't know how the resolvers work...
 combining nested queries...  how expensive they are... latency...

back end needs to know front end ... viseversa... more learning.

start from graphql schema...  write to graphql server...

graphql scala library... sangria...

apollo again

use lots of query fragments.


graphql with node and typescript...

combining type definitions and resolvers....


what is apollo???   -- a library of code used to write graphql. - both server and client.

createreact app.


5/24

https://www.youtube.com/watch?v=k3AiUhwHQ28&t=73s

https://www.youtube.com/watch?v=ed8SzALpx1Q

the apple feast of the savior spassk


5/28

The Node Classification model does not rely on relationship information. However, a node embedding algorithm
could embed the neighborhoods of nodes as a node property, to transfer this information into the Node Classification
model (see Node embeddings).


stack   sensory attributes  [sweet,salt,creamy, color,...] by product       vector of known consumer liking scores
and build a regression model.

https://www.youtube.com/watch?v=LDTe8uFqbws&fbclid=IwAR2i76ZDLuPPHx6y8nL9bjmU1GVx232e9IFoOzOMq4u4LT4MX38mUXN2Mn0
https://www.iaea.org/newscenter/news/managing-nuclear-knowledge-with-semantic-technologies?fbclid=IwAR2SXhbMEI-QglXL2Wpirb6LfWbSKEWQ7WZYqFIUQiVdG1Z7AupwGsPDK2Y


5/31

http://www.koutschan.de/

Cognitive dissonace is a much broader term. It is every situation where someone believes/knows two or more things that contradict each other.

 "I believe god is good and created the world the way he wanted but the world is a horrible, evil place".


http://www.koutschan.de/publ/WienLinz13/talk_WienLinz13.pdf

https://en.wikipedia.org/wiki/Holonomic_constraints
and also in regard to random walks.


In physics and mathematics, an ansatz (/ˈænsæts/; German: [ˈʔanzats], meaning:
"initial placement of a tool at a work piece", plural Ansätze /ˈænsɛtsə/; 
German: [ˈʔanzɛtsə]) is an educated guess or an additional assumption made to help solve a problem, 
and which may later be verified to be part of the solution by its results.[1][2].

















































filed returning a function that resoves an object.
cannot return an object -  the object references an object not yet defined.  the functional paradyne.
































































https://www.youtube.com/watch?v=4eGn-_mHGkY
From abovd:
Two ways to construct real numbers:  Cauchy Sequence   Dedekind cuts.
















what are the candidate theories of general intelligence?

























sarcasm because meaning opposite

never use sacrasm in retorich

the absurd....

Legacy graph algorithms and modern graph algorithms.

you blown it all sky high


https://www.facebook.com/groups/banensdumonde/

ray cooper

take the oar and row.
back to back and side to side.





